{
  "太阳": {
    "白羊座": {
      "1": "太阳在白羊座带来开创与直接的表达，你更倾向以行动的方式推动自我实现。 同时留意急躁带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第1宫，自我呈现与开端成为你意志与存在感的重要舞台。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "太阳在白羊座带来开创与直接的表达，你更倾向以行动的方式推动自我实现。 同时留意急躁带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第2宫，资源与价值成为你意志与存在感的重要舞台。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "太阳在白羊座带来开创与直接的表达，你更倾向以行动的方式推动自我实现。 同时留意急躁带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第3宫，学习与沟通成为你意志与存在感的重要舞台。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "太阳在白羊座带来开创与直接的表达，你更倾向以行动的方式推动自我实现。 同时留意急躁带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第4宫，家庭与根基成为你意志与存在感的重要舞台。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "太阳在白羊座带来开创与直接的表达，你更倾向以行动的方式推动自我实现。 同时留意急躁带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第5宫，创造与表达成为你意志与存在感的重要舞台。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "太阳在白羊座带来开创与直接的表达，你更倾向以行动的方式推动自我实现。 同时留意急躁带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第6宫，日常与健康成为你意志与存在感的重要舞台。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "太阳在白羊座带来开创与直接的表达，你更倾向以行动的方式推动自我实现。 同时留意急躁带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第7宫，伴侣与合作成为你意志与存在感的重要舞台。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "太阳在白羊座带来开创与直接的表达，你更倾向以行动的方式推动自我实现。 同时留意急躁带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第8宫，共享与转化成为你意志与存在感的重要舞台。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "太阳在白羊座带来开创与直接的表达，你更倾向以行动的方式推动自我实现。 同时留意急躁带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第9宫，远行与信念成为你意志与存在感的重要舞台。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "太阳在白羊座带来开创与直接的表达，你更倾向以行动的方式推动自我实现。 同时留意急躁带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第10宫，事业与公众成为你意志与存在感的重要舞台。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "太阳在白羊座带来开创与直接的表达，你更倾向以行动的方式推动自我实现。 同时留意急躁带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第11宫，社群与愿景成为你意志与存在感的重要舞台。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "太阳在白羊座带来开创与直接的表达，你更倾向以行动的方式推动自我实现。 同时留意急躁带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第12宫，潜意识与疗愈成为你意志与存在感的重要舞台。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "金牛座": {
      "1": "太阳在金牛座带来稳健与务实的表达，你更倾向以耐心的方式推动自我实现。 同时留意固执带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第1宫，自我呈现与开端成为你意志与存在感的重要舞台。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "太阳在金牛座带来稳健与务实的表达，你更倾向以耐心的方式推动自我实现。 同时留意固执带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第2宫，资源与价值成为你意志与存在感的重要舞台。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "太阳在金牛座带来稳健与务实的表达，你更倾向以耐心的方式推动自我实现。 同时留意固执带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第3宫，学习与沟通成为你意志与存在感的重要舞台。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "太阳在金牛座带来稳健与务实的表达，你更倾向以耐心的方式推动自我实现。 同时留意固执带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第4宫，家庭与根基成为你意志与存在感的重要舞台。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "太阳在金牛座带来稳健与务实的表达，你更倾向以耐心的方式推动自我实现。 同时留意固执带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第5宫，创造与表达成为你意志与存在感的重要舞台。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "太阳在金牛座带来稳健与务实的表达，你更倾向以耐心的方式推动自我实现。 同时留意固执带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第6宫，日常与健康成为你意志与存在感的重要舞台。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "太阳在金牛座带来稳健与务实的表达，你更倾向以耐心的方式推动自我实现。 同时留意固执带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第7宫，伴侣与合作成为你意志与存在感的重要舞台。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "太阳在金牛座带来稳健与务实的表达，你更倾向以耐心的方式推动自我实现。 同时留意固执带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第8宫，共享与转化成为你意志与存在感的重要舞台。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "太阳在金牛座带来稳健与务实的表达，你更倾向以耐心的方式推动自我实现。 同时留意固执带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第9宫，远行与信念成为你意志与存在感的重要舞台。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "太阳在金牛座带来稳健与务实的表达，你更倾向以耐心的方式推动自我实现。 同时留意固执带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第10宫，事业与公众成为你意志与存在感的重要舞台。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "太阳在金牛座带来稳健与务实的表达，你更倾向以耐心的方式推动自我实现。 同时留意固执带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第11宫，社群与愿景成为你意志与存在感的重要舞台。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "太阳在金牛座带来稳健与务实的表达，你更倾向以耐心的方式推动自我实现。 同时留意固执带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第12宫，潜意识与疗愈成为你意志与存在感的重要舞台。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "双子座": {
      "1": "太阳在双子座带来机敏与好奇的表达，你更倾向以沟通的方式推动自我实现。 同时留意分散带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第1宫，自我呈现与开端成为你意志与存在感的重要舞台。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "太阳在双子座带来机敏与好奇的表达，你更倾向以沟通的方式推动自我实现。 同时留意分散带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第2宫，资源与价值成为你意志与存在感的重要舞台。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "太阳在双子座带来机敏与好奇的表达，你更倾向以沟通的方式推动自我实现。 同时留意分散带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第3宫，学习与沟通成为你意志与存在感的重要舞台。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "太阳在双子座带来机敏与好奇的表达，你更倾向以沟通的方式推动自我实现。 同时留意分散带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第4宫，家庭与根基成为你意志与存在感的重要舞台。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "太阳在双子座带来机敏与好奇的表达，你更倾向以沟通的方式推动自我实现。 同时留意分散带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第5宫，创造与表达成为你意志与存在感的重要舞台。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "太阳在双子座带来机敏与好奇的表达，你更倾向以沟通的方式推动自我实现。 同时留意分散带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第6宫，日常与健康成为你意志与存在感的重要舞台。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "太阳在双子座带来机敏与好奇的表达，你更倾向以沟通的方式推动自我实现。 同时留意分散带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第7宫，伴侣与合作成为你意志与存在感的重要舞台。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "太阳在双子座带来机敏与好奇的表达，你更倾向以沟通的方式推动自我实现。 同时留意分散带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第8宫，共享与转化成为你意志与存在感的重要舞台。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "太阳在双子座带来机敏与好奇的表达，你更倾向以沟通的方式推动自我实现。 同时留意分散带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第9宫，远行与信念成为你意志与存在感的重要舞台。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "太阳在双子座带来机敏与好奇的表达，你更倾向以沟通的方式推动自我实现。 同时留意分散带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第10宫，事业与公众成为你意志与存在感的重要舞台。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "太阳在双子座带来机敏与好奇的表达，你更倾向以沟通的方式推动自我实现。 同时留意分散带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第11宫，社群与愿景成为你意志与存在感的重要舞台。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "太阳在双子座带来机敏与好奇的表达，你更倾向以沟通的方式推动自我实现。 同时留意分散带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第12宫，潜意识与疗愈成为你意志与存在感的重要舞台。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "巨蟹座": {
      "1": "太阳在巨蟹座带来照护与敏感的表达，你更倾向以归属的方式推动自我实现。 同时留意多虑带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第1宫，自我呈现与开端成为你意志与存在感的重要舞台。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "太阳在巨蟹座带来照护与敏感的表达，你更倾向以归属的方式推动自我实现。 同时留意多虑带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第2宫，资源与价值成为你意志与存在感的重要舞台。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "太阳在巨蟹座带来照护与敏感的表达，你更倾向以归属的方式推动自我实现。 同时留意多虑带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第3宫，学习与沟通成为你意志与存在感的重要舞台。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "太阳在巨蟹座带来照护与敏感的表达，你更倾向以归属的方式推动自我实现。 同时留意多虑带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第4宫，家庭与根基成为你意志与存在感的重要舞台。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "太阳在巨蟹座带来照护与敏感的表达，你更倾向以归属的方式推动自我实现。 同时留意多虑带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第5宫，创造与表达成为你意志与存在感的重要舞台。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "太阳在巨蟹座带来照护与敏感的表达，你更倾向以归属的方式推动自我实现。 同时留意多虑带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第6宫，日常与健康成为你意志与存在感的重要舞台。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "太阳在巨蟹座带来照护与敏感的表达，你更倾向以归属的方式推动自我实现。 同时留意多虑带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第7宫，伴侣与合作成为你意志与存在感的重要舞台。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "太阳在巨蟹座带来照护与敏感的表达，你更倾向以归属的方式推动自我实现。 同时留意多虑带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第8宫，共享与转化成为你意志与存在感的重要舞台。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "太阳在巨蟹座带来照护与敏感的表达，你更倾向以归属的方式推动自我实现。 同时留意多虑带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第9宫，远行与信念成为你意志与存在感的重要舞台。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "太阳在巨蟹座带来照护与敏感的表达，你更倾向以归属的方式推动自我实现。 同时留意多虑带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第10宫，事业与公众成为你意志与存在感的重要舞台。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "太阳在巨蟹座带来照护与敏感的表达，你更倾向以归属的方式推动自我实现。 同时留意多虑带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第11宫，社群与愿景成为你意志与存在感的重要舞台。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "太阳在巨蟹座带来照护与敏感的表达，你更倾向以归属的方式推动自我实现。 同时留意多虑带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第12宫，潜意识与疗愈成为你意志与存在感的重要舞台。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "狮子座": {
      "1": "太阳在狮子座带来自信与创造的表达，你更倾向以表现的方式推动自我实现。 同时留意自我中心带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第1宫，自我呈现与开端成为你意志与存在感的重要舞台。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "太阳在狮子座带来自信与创造的表达，你更倾向以表现的方式推动自我实现。 同时留意自我中心带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第2宫，资源与价值成为你意志与存在感的重要舞台。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "太阳在狮子座带来自信与创造的表达，你更倾向以表现的方式推动自我实现。 同时留意自我中心带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第3宫，学习与沟通成为你意志与存在感的重要舞台。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "太阳在狮子座带来自信与创造的表达，你更倾向以表现的方式推动自我实现。 同时留意自我中心带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第4宫，家庭与根基成为你意志与存在感的重要舞台。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "太阳在狮子座带来自信与创造的表达，你更倾向以表现的方式推动自我实现。 同时留意自我中心带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第5宫，创造与表达成为你意志与存在感的重要舞台。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "太阳在狮子座带来自信与创造的表达，你更倾向以表现的方式推动自我实现。 同时留意自我中心带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第6宫，日常与健康成为你意志与存在感的重要舞台。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "太阳在狮子座带来自信与创造的表达，你更倾向以表现的方式推动自我实现。 同时留意自我中心带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第7宫，伴侣与合作成为你意志与存在感的重要舞台。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "太阳在狮子座带来自信与创造的表达，你更倾向以表现的方式推动自我实现。 同时留意自我中心带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第8宫，共享与转化成为你意志与存在感的重要舞台。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "太阳在狮子座带来自信与创造的表达，你更倾向以表现的方式推动自我实现。 同时留意自我中心带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第9宫，远行与信念成为你意志与存在感的重要舞台。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "太阳在狮子座带来自信与创造的表达，你更倾向以表现的方式推动自我实现。 同时留意自我中心带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第10宫，事业与公众成为你意志与存在感的重要舞台。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "太阳在狮子座带来自信与创造的表达，你更倾向以表现的方式推动自我实现。 同时留意自我中心带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第11宫，社群与愿景成为你意志与存在感的重要舞台。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "太阳在狮子座带来自信与创造的表达，你更倾向以表现的方式推动自我实现。 同时留意自我中心带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第12宫，潜意识与疗愈成为你意志与存在感的重要舞台。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "处女座": {
      "1": "太阳在处女座带来细致与分析的表达，你更倾向以改进的方式推动自我实现。 同时留意挑剔带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第1宫，自我呈现与开端成为你意志与存在感的重要舞台。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "太阳在处女座带来细致与分析的表达，你更倾向以改进的方式推动自我实现。 同时留意挑剔带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第2宫，资源与价值成为你意志与存在感的重要舞台。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "太阳在处女座带来细致与分析的表达，你更倾向以改进的方式推动自我实现。 同时留意挑剔带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第3宫，学习与沟通成为你意志与存在感的重要舞台。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "太阳在处女座带来细致与分析的表达，你更倾向以改进的方式推动自我实现。 同时留意挑剔带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第4宫，家庭与根基成为你意志与存在感的重要舞台。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "太阳在处女座带来细致与分析的表达，你更倾向以改进的方式推动自我实现。 同时留意挑剔带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第5宫，创造与表达成为你意志与存在感的重要舞台。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "太阳在处女座带来细致与分析的表达，你更倾向以改进的方式推动自我实现。 同时留意挑剔带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第6宫，日常与健康成为你意志与存在感的重要舞台。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "太阳在处女座带来细致与分析的表达，你更倾向以改进的方式推动自我实现。 同时留意挑剔带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第7宫，伴侣与合作成为你意志与存在感的重要舞台。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "太阳在处女座带来细致与分析的表达，你更倾向以改进的方式推动自我实现。 同时留意挑剔带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第8宫，共享与转化成为你意志与存在感的重要舞台。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "太阳在处女座带来细致与分析的表达，你更倾向以改进的方式推动自我实现。 同时留意挑剔带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第9宫，远行与信念成为你意志与存在感的重要舞台。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "太阳在处女座带来细致与分析的表达，你更倾向以改进的方式推动自我实现。 同时留意挑剔带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第10宫，事业与公众成为你意志与存在感的重要舞台。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "太阳在处女座带来细致与分析的表达，你更倾向以改进的方式推动自我实现。 同时留意挑剔带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第11宫，社群与愿景成为你意志与存在感的重要舞台。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "太阳在处女座带来细致与分析的表达，你更倾向以改进的方式推动自我实现。 同时留意挑剔带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第12宫，潜意识与疗愈成为你意志与存在感的重要舞台。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "天秤座": {
      "1": "太阳在天秤座带来平衡与合作的表达，你更倾向以审美的方式推动自我实现。 同时留意犹豫带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第1宫，自我呈现与开端成为你意志与存在感的重要舞台。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "太阳在天秤座带来平衡与合作的表达，你更倾向以审美的方式推动自我实现。 同时留意犹豫带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第2宫，资源与价值成为你意志与存在感的重要舞台。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "太阳在天秤座带来平衡与合作的表达，你更倾向以审美的方式推动自我实现。 同时留意犹豫带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第3宫，学习与沟通成为你意志与存在感的重要舞台。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "太阳在天秤座带来平衡与合作的表达，你更倾向以审美的方式推动自我实现。 同时留意犹豫带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第4宫，家庭与根基成为你意志与存在感的重要舞台。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "太阳在天秤座带来平衡与合作的表达，你更倾向以审美的方式推动自我实现。 同时留意犹豫带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第5宫，创造与表达成为你意志与存在感的重要舞台。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "太阳在天秤座带来平衡与合作的表达，你更倾向以审美的方式推动自我实现。 同时留意犹豫带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第6宫，日常与健康成为你意志与存在感的重要舞台。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "太阳在天秤座带来平衡与合作的表达，你更倾向以审美的方式推动自我实现。 同时留意犹豫带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第7宫，伴侣与合作成为你意志与存在感的重要舞台。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "太阳在天秤座带来平衡与合作的表达，你更倾向以审美的方式推动自我实现。 同时留意犹豫带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第8宫，共享与转化成为你意志与存在感的重要舞台。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "太阳在天秤座带来平衡与合作的表达，你更倾向以审美的方式推动自我实现。 同时留意犹豫带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第9宫，远行与信念成为你意志与存在感的重要舞台。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "太阳在天秤座带来平衡与合作的表达，你更倾向以审美的方式推动自我实现。 同时留意犹豫带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第10宫，事业与公众成为你意志与存在感的重要舞台。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "太阳在天秤座带来平衡与合作的表达，你更倾向以审美的方式推动自我实现。 同时留意犹豫带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第11宫，社群与愿景成为你意志与存在感的重要舞台。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "太阳在天秤座带来平衡与合作的表达，你更倾向以审美的方式推动自我实现。 同时留意犹豫带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第12宫，潜意识与疗愈成为你意志与存在感的重要舞台。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "天蝎座": {
      "1": "太阳在天蝎座带来深度与洞察的表达，你更倾向以专注的方式推动自我实现。 同时留意控制欲带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第1宫，自我呈现与开端成为你意志与存在感的重要舞台。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "太阳在天蝎座带来深度与洞察的表达，你更倾向以专注的方式推动自我实现。 同时留意控制欲带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第2宫，资源与价值成为你意志与存在感的重要舞台。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "太阳在天蝎座带来深度与洞察的表达，你更倾向以专注的方式推动自我实现。 同时留意控制欲带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第3宫，学习与沟通成为你意志与存在感的重要舞台。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "太阳在天蝎座带来深度与洞察的表达，你更倾向以专注的方式推动自我实现。 同时留意控制欲带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第4宫，家庭与根基成为你意志与存在感的重要舞台。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "太阳在天蝎座带来深度与洞察的表达，你更倾向以专注的方式推动自我实现。 同时留意控制欲带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第5宫，创造与表达成为你意志与存在感的重要舞台。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "太阳在天蝎座带来深度与洞察的表达，你更倾向以专注的方式推动自我实现。 同时留意控制欲带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第6宫，日常与健康成为你意志与存在感的重要舞台。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "太阳在天蝎座带来深度与洞察的表达，你更倾向以专注的方式推动自我实现。 同时留意控制欲带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第7宫，伴侣与合作成为你意志与存在感的重要舞台。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "太阳在天蝎座带来深度与洞察的表达，你更倾向以专注的方式推动自我实现。 同时留意控制欲带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第8宫，共享与转化成为你意志与存在感的重要舞台。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "太阳在天蝎座带来深度与洞察的表达，你更倾向以专注的方式推动自我实现。 同时留意控制欲带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第9宫，远行与信念成为你意志与存在感的重要舞台。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "太阳在天蝎座带来深度与洞察的表达，你更倾向以专注的方式推动自我实现。 同时留意控制欲带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第10宫，事业与公众成为你意志与存在感的重要舞台。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "太阳在天蝎座带来深度与洞察的表达，你更倾向以专注的方式推动自我实现。 同时留意控制欲带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第11宫，社群与愿景成为你意志与存在感的重要舞台。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "太阳在天蝎座带来深度与洞察的表达，你更倾向以专注的方式推动自我实现。 同时留意控制欲带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第12宫，潜意识与疗愈成为你意志与存在感的重要舞台。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "射手座": {
      "1": "太阳在射手座带来探索与远见的表达，你更倾向以自由的方式推动自我实现。 同时留意冒进带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第1宫，自我呈现与开端成为你意志与存在感的重要舞台。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "太阳在射手座带来探索与远见的表达，你更倾向以自由的方式推动自我实现。 同时留意冒进带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第2宫，资源与价值成为你意志与存在感的重要舞台。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "太阳在射手座带来探索与远见的表达，你更倾向以自由的方式推动自我实现。 同时留意冒进带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第3宫，学习与沟通成为你意志与存在感的重要舞台。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "太阳在射手座带来探索与远见的表达，你更倾向以自由的方式推动自我实现。 同时留意冒进带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第4宫，家庭与根基成为你意志与存在感的重要舞台。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "太阳在射手座带来探索与远见的表达，你更倾向以自由的方式推动自我实现。 同时留意冒进带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第5宫，创造与表达成为你意志与存在感的重要舞台。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "太阳在射手座带来探索与远见的表达，你更倾向以自由的方式推动自我实现。 同时留意冒进带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第6宫，日常与健康成为你意志与存在感的重要舞台。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "太阳在射手座带来探索与远见的表达，你更倾向以自由的方式推动自我实现。 同时留意冒进带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第7宫，伴侣与合作成为你意志与存在感的重要舞台。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "太阳在射手座带来探索与远见的表达，你更倾向以自由的方式推动自我实现。 同时留意冒进带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第8宫，共享与转化成为你意志与存在感的重要舞台。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "太阳在射手座带来探索与远见的表达，你更倾向以自由的方式推动自我实现。 同时留意冒进带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第9宫，远行与信念成为你意志与存在感的重要舞台。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "太阳在射手座带来探索与远见的表达，你更倾向以自由的方式推动自我实现。 同时留意冒进带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第10宫，事业与公众成为你意志与存在感的重要舞台。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "太阳在射手座带来探索与远见的表达，你更倾向以自由的方式推动自我实现。 同时留意冒进带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第11宫，社群与愿景成为你意志与存在感的重要舞台。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "太阳在射手座带来探索与远见的表达，你更倾向以自由的方式推动自我实现。 同时留意冒进带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第12宫，潜意识与疗愈成为你意志与存在感的重要舞台。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "摩羯座": {
      "1": "太阳在摩羯座带来纪律与目标的表达，你更倾向以结构的方式推动自我实现。 同时留意保守带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第1宫，自我呈现与开端成为你意志与存在感的重要舞台。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "太阳在摩羯座带来纪律与目标的表达，你更倾向以结构的方式推动自我实现。 同时留意保守带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第2宫，资源与价值成为你意志与存在感的重要舞台。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "太阳在摩羯座带来纪律与目标的表达，你更倾向以结构的方式推动自我实现。 同时留意保守带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第3宫，学习与沟通成为你意志与存在感的重要舞台。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "太阳在摩羯座带来纪律与目标的表达，你更倾向以结构的方式推动自我实现。 同时留意保守带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第4宫，家庭与根基成为你意志与存在感的重要舞台。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "太阳在摩羯座带来纪律与目标的表达，你更倾向以结构的方式推动自我实现。 同时留意保守带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第5宫，创造与表达成为你意志与存在感的重要舞台。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "太阳在摩羯座带来纪律与目标的表达，你更倾向以结构的方式推动自我实现。 同时留意保守带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第6宫，日常与健康成为你意志与存在感的重要舞台。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "太阳在摩羯座带来纪律与目标的表达，你更倾向以结构的方式推动自我实现。 同时留意保守带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第7宫，伴侣与合作成为你意志与存在感的重要舞台。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "太阳在摩羯座带来纪律与目标的表达，你更倾向以结构的方式推动自我实现。 同时留意保守带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第8宫，共享与转化成为你意志与存在感的重要舞台。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "太阳在摩羯座带来纪律与目标的表达，你更倾向以结构的方式推动自我实现。 同时留意保守带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第9宫，远行与信念成为你意志与存在感的重要舞台。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "太阳在摩羯座带来纪律与目标的表达，你更倾向以结构的方式推动自我实现。 同时留意保守带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第10宫，事业与公众成为你意志与存在感的重要舞台。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "太阳在摩羯座带来纪律与目标的表达，你更倾向以结构的方式推动自我实现。 同时留意保守带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第11宫，社群与愿景成为你意志与存在感的重要舞台。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "太阳在摩羯座带来纪律与目标的表达，你更倾向以结构的方式推动自我实现。 同时留意保守带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第12宫，潜意识与疗愈成为你意志与存在感的重要舞台。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "水瓶座": {
      "1": "太阳在水瓶座带来独立与革新的表达，你更倾向以理性的方式推动自我实现。 同时留意疏离带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第1宫，自我呈现与开端成为你意志与存在感的重要舞台。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "太阳在水瓶座带来独立与革新的表达，你更倾向以理性的方式推动自我实现。 同时留意疏离带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第2宫，资源与价值成为你意志与存在感的重要舞台。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "太阳在水瓶座带来独立与革新的表达，你更倾向以理性的方式推动自我实现。 同时留意疏离带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第3宫，学习与沟通成为你意志与存在感的重要舞台。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "太阳在水瓶座带来独立与革新的表达，你更倾向以理性的方式推动自我实现。 同时留意疏离带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第4宫，家庭与根基成为你意志与存在感的重要舞台。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "太阳在水瓶座带来独立与革新的表达，你更倾向以理性的方式推动自我实现。 同时留意疏离带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第5宫，创造与表达成为你意志与存在感的重要舞台。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "太阳在水瓶座带来独立与革新的表达，你更倾向以理性的方式推动自我实现。 同时留意疏离带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第6宫，日常与健康成为你意志与存在感的重要舞台。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "太阳在水瓶座带来独立与革新的表达，你更倾向以理性的方式推动自我实现。 同时留意疏离带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第7宫，伴侣与合作成为你意志与存在感的重要舞台。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "太阳在水瓶座带来独立与革新的表达，你更倾向以理性的方式推动自我实现。 同时留意疏离带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第8宫，共享与转化成为你意志与存在感的重要舞台。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "太阳在水瓶座带来独立与革新的表达，你更倾向以理性的方式推动自我实现。 同时留意疏离带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第9宫，远行与信念成为你意志与存在感的重要舞台。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "太阳在水瓶座带来独立与革新的表达，你更倾向以理性的方式推动自我实现。 同时留意疏离带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第10宫，事业与公众成为你意志与存在感的重要舞台。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "太阳在水瓶座带来独立与革新的表达，你更倾向以理性的方式推动自我实现。 同时留意疏离带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第11宫，社群与愿景成为你意志与存在感的重要舞台。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "太阳在水瓶座带来独立与革新的表达，你更倾向以理性的方式推动自我实现。 同时留意疏离带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第12宫，潜意识与疗愈成为你意志与存在感的重要舞台。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "双鱼座": {
      "1": "太阳在双鱼座带来共情与想象的表达，你更倾向以融合的方式推动自我实现。 同时留意迷离带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第1宫，自我呈现与开端成为你意志与存在感的重要舞台。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "太阳在双鱼座带来共情与想象的表达，你更倾向以融合的方式推动自我实现。 同时留意迷离带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第2宫，资源与价值成为你意志与存在感的重要舞台。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "太阳在双鱼座带来共情与想象的表达，你更倾向以融合的方式推动自我实现。 同时留意迷离带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第3宫，学习与沟通成为你意志与存在感的重要舞台。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "太阳在双鱼座带来共情与想象的表达，你更倾向以融合的方式推动自我实现。 同时留意迷离带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第4宫，家庭与根基成为你意志与存在感的重要舞台。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "太阳在双鱼座带来共情与想象的表达，你更倾向以融合的方式推动自我实现。 同时留意迷离带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第5宫，创造与表达成为你意志与存在感的重要舞台。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "太阳在双鱼座带来共情与想象的表达，你更倾向以融合的方式推动自我实现。 同时留意迷离带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第6宫，日常与健康成为你意志与存在感的重要舞台。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "太阳在双鱼座带来共情与想象的表达，你更倾向以融合的方式推动自我实现。 同时留意迷离带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第7宫，伴侣与合作成为你意志与存在感的重要舞台。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "太阳在双鱼座带来共情与想象的表达，你更倾向以融合的方式推动自我实现。 同时留意迷离带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第8宫，共享与转化成为你意志与存在感的重要舞台。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "太阳在双鱼座带来共情与想象的表达，你更倾向以融合的方式推动自我实现。 同时留意迷离带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第9宫，远行与信念成为你意志与存在感的重要舞台。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "太阳在双鱼座带来共情与想象的表达，你更倾向以融合的方式推动自我实现。 同时留意迷离带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第10宫，事业与公众成为你意志与存在感的重要舞台。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "太阳在双鱼座带来共情与想象的表达，你更倾向以融合的方式推动自我实现。 同时留意迷离带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第11宫，社群与愿景成为你意志与存在感的重要舞台。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "太阳在双鱼座带来共情与想象的表达，你更倾向以融合的方式推动自我实现。 同时留意迷离带来的判断偏差，学会在目标与节奏间取得平衡。 当太阳位于第12宫，潜意识与疗愈成为你意志与存在感的重要舞台。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    }
  },
  "月亮": {
    "白羊座": {
      "1": "月亮在白羊座强化开创与直接的情绪需求，你会以行动来寻求安全与慰藉。 需防急躁引发情绪化反应，给自己留出温和的边界。 当月亮位于第1宫，自我呈现与开端深度影响你的情绪稳定与安全感。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "月亮在白羊座强化开创与直接的情绪需求，你会以行动来寻求安全与慰藉。 需防急躁引发情绪化反应，给自己留出温和的边界。 当月亮位于第2宫，资源与价值深度影响你的情绪稳定与安全感。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "月亮在白羊座强化开创与直接的情绪需求，你会以行动来寻求安全与慰藉。 需防急躁引发情绪化反应，给自己留出温和的边界。 当月亮位于第3宫，学习与沟通深度影响你的情绪稳定与安全感。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "月亮在白羊座强化开创与直接的情绪需求，你会以行动来寻求安全与慰藉。 需防急躁引发情绪化反应，给自己留出温和的边界。 当月亮位于第4宫，家庭与根基深度影响你的情绪稳定与安全感。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "月亮在白羊座强化开创与直接的情绪需求，你会以行动来寻求安全与慰藉。 需防急躁引发情绪化反应，给自己留出温和的边界。 当月亮位于第5宫，创造与表达深度影响你的情绪稳定与安全感。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "月亮在白羊座强化开创与直接的情绪需求，你会以行动来寻求安全与慰藉。 需防急躁引发情绪化反应，给自己留出温和的边界。 当月亮位于第6宫，日常与健康深度影响你的情绪稳定与安全感。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "月亮在白羊座强化开创与直接的情绪需求，你会以行动来寻求安全与慰藉。 需防急躁引发情绪化反应，给自己留出温和的边界。 当月亮位于第7宫，伴侣与合作深度影响你的情绪稳定与安全感。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "月亮在白羊座强化开创与直接的情绪需求，你会以行动来寻求安全与慰藉。 需防急躁引发情绪化反应，给自己留出温和的边界。 当月亮位于第8宫，共享与转化深度影响你的情绪稳定与安全感。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "月亮在白羊座强化开创与直接的情绪需求，你会以行动来寻求安全与慰藉。 需防急躁引发情绪化反应，给自己留出温和的边界。 当月亮位于第9宫，远行与信念深度影响你的情绪稳定与安全感。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "月亮在白羊座强化开创与直接的情绪需求，你会以行动来寻求安全与慰藉。 需防急躁引发情绪化反应，给自己留出温和的边界。 当月亮位于第10宫，事业与公众深度影响你的情绪稳定与安全感。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "月亮在白羊座强化开创与直接的情绪需求，你会以行动来寻求安全与慰藉。 需防急躁引发情绪化反应，给自己留出温和的边界。 当月亮位于第11宫，社群与愿景深度影响你的情绪稳定与安全感。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "月亮在白羊座强化开创与直接的情绪需求，你会以行动来寻求安全与慰藉。 需防急躁引发情绪化反应，给自己留出温和的边界。 当月亮位于第12宫，潜意识与疗愈深度影响你的情绪稳定与安全感。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "金牛座": {
      "1": "月亮在金牛座强化稳健与务实的情绪需求，你会以耐心来寻求安全与慰藉。 需防固执引发情绪化反应，给自己留出温和的边界。 当月亮位于第1宫，自我呈现与开端深度影响你的情绪稳定与安全感。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "月亮在金牛座强化稳健与务实的情绪需求，你会以耐心来寻求安全与慰藉。 需防固执引发情绪化反应，给自己留出温和的边界。 当月亮位于第2宫，资源与价值深度影响你的情绪稳定与安全感。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "月亮在金牛座强化稳健与务实的情绪需求，你会以耐心来寻求安全与慰藉。 需防固执引发情绪化反应，给自己留出温和的边界。 当月亮位于第3宫，学习与沟通深度影响你的情绪稳定与安全感。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "月亮在金牛座强化稳健与务实的情绪需求，你会以耐心来寻求安全与慰藉。 需防固执引发情绪化反应，给自己留出温和的边界。 当月亮位于第4宫，家庭与根基深度影响你的情绪稳定与安全感。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "月亮在金牛座强化稳健与务实的情绪需求，你会以耐心来寻求安全与慰藉。 需防固执引发情绪化反应，给自己留出温和的边界。 当月亮位于第5宫，创造与表达深度影响你的情绪稳定与安全感。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "月亮在金牛座强化稳健与务实的情绪需求，你会以耐心来寻求安全与慰藉。 需防固执引发情绪化反应，给自己留出温和的边界。 当月亮位于第6宫，日常与健康深度影响你的情绪稳定与安全感。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "月亮在金牛座强化稳健与务实的情绪需求，你会以耐心来寻求安全与慰藉。 需防固执引发情绪化反应，给自己留出温和的边界。 当月亮位于第7宫，伴侣与合作深度影响你的情绪稳定与安全感。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "月亮在金牛座强化稳健与务实的情绪需求，你会以耐心来寻求安全与慰藉。 需防固执引发情绪化反应，给自己留出温和的边界。 当月亮位于第8宫，共享与转化深度影响你的情绪稳定与安全感。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "月亮在金牛座强化稳健与务实的情绪需求，你会以耐心来寻求安全与慰藉。 需防固执引发情绪化反应，给自己留出温和的边界。 当月亮位于第9宫，远行与信念深度影响你的情绪稳定与安全感。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "月亮在金牛座强化稳健与务实的情绪需求，你会以耐心来寻求安全与慰藉。 需防固执引发情绪化反应，给自己留出温和的边界。 当月亮位于第10宫，事业与公众深度影响你的情绪稳定与安全感。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "月亮在金牛座强化稳健与务实的情绪需求，你会以耐心来寻求安全与慰藉。 需防固执引发情绪化反应，给自己留出温和的边界。 当月亮位于第11宫，社群与愿景深度影响你的情绪稳定与安全感。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "月亮在金牛座强化稳健与务实的情绪需求，你会以耐心来寻求安全与慰藉。 需防固执引发情绪化反应，给自己留出温和的边界。 当月亮位于第12宫，潜意识与疗愈深度影响你的情绪稳定与安全感。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "双子座": {
      "1": "月亮在双子座强化机敏与好奇的情绪需求，你会以沟通来寻求安全与慰藉。 需防分散引发情绪化反应，给自己留出温和的边界。 当月亮位于第1宫，自我呈现与开端深度影响你的情绪稳定与安全感。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "月亮在双子座强化机敏与好奇的情绪需求，你会以沟通来寻求安全与慰藉。 需防分散引发情绪化反应，给自己留出温和的边界。 当月亮位于第2宫，资源与价值深度影响你的情绪稳定与安全感。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "月亮在双子座强化机敏与好奇的情绪需求，你会以沟通来寻求安全与慰藉。 需防分散引发情绪化反应，给自己留出温和的边界。 当月亮位于第3宫，学习与沟通深度影响你的情绪稳定与安全感。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "月亮在双子座强化机敏与好奇的情绪需求，你会以沟通来寻求安全与慰藉。 需防分散引发情绪化反应，给自己留出温和的边界。 当月亮位于第4宫，家庭与根基深度影响你的情绪稳定与安全感。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "月亮在双子座强化机敏与好奇的情绪需求，你会以沟通来寻求安全与慰藉。 需防分散引发情绪化反应，给自己留出温和的边界。 当月亮位于第5宫，创造与表达深度影响你的情绪稳定与安全感。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "月亮在双子座强化机敏与好奇的情绪需求，你会以沟通来寻求安全与慰藉。 需防分散引发情绪化反应，给自己留出温和的边界。 当月亮位于第6宫，日常与健康深度影响你的情绪稳定与安全感。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "月亮在双子座强化机敏与好奇的情绪需求，你会以沟通来寻求安全与慰藉。 需防分散引发情绪化反应，给自己留出温和的边界。 当月亮位于第7宫，伴侣与合作深度影响你的情绪稳定与安全感。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "月亮在双子座强化机敏与好奇的情绪需求，你会以沟通来寻求安全与慰藉。 需防分散引发情绪化反应，给自己留出温和的边界。 当月亮位于第8宫，共享与转化深度影响你的情绪稳定与安全感。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "月亮在双子座强化机敏与好奇的情绪需求，你会以沟通来寻求安全与慰藉。 需防分散引发情绪化反应，给自己留出温和的边界。 当月亮位于第9宫，远行与信念深度影响你的情绪稳定与安全感。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "月亮在双子座强化机敏与好奇的情绪需求，你会以沟通来寻求安全与慰藉。 需防分散引发情绪化反应，给自己留出温和的边界。 当月亮位于第10宫，事业与公众深度影响你的情绪稳定与安全感。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "月亮在双子座强化机敏与好奇的情绪需求，你会以沟通来寻求安全与慰藉。 需防分散引发情绪化反应，给自己留出温和的边界。 当月亮位于第11宫，社群与愿景深度影响你的情绪稳定与安全感。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "月亮在双子座强化机敏与好奇的情绪需求，你会以沟通来寻求安全与慰藉。 需防分散引发情绪化反应，给自己留出温和的边界。 当月亮位于第12宫，潜意识与疗愈深度影响你的情绪稳定与安全感。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "巨蟹座": {
      "1": "月亮在巨蟹座强化照护与敏感的情绪需求，你会以归属来寻求安全与慰藉。 需防多虑引发情绪化反应，给自己留出温和的边界。 当月亮位于第1宫，自我呈现与开端深度影响你的情绪稳定与安全感。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "月亮在巨蟹座强化照护与敏感的情绪需求，你会以归属来寻求安全与慰藉。 需防多虑引发情绪化反应，给自己留出温和的边界。 当月亮位于第2宫，资源与价值深度影响你的情绪稳定与安全感。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "月亮在巨蟹座强化照护与敏感的情绪需求，你会以归属来寻求安全与慰藉。 需防多虑引发情绪化反应，给自己留出温和的边界。 当月亮位于第3宫，学习与沟通深度影响你的情绪稳定与安全感。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "月亮在巨蟹座强化照护与敏感的情绪需求，你会以归属来寻求安全与慰藉。 需防多虑引发情绪化反应，给自己留出温和的边界。 当月亮位于第4宫，家庭与根基深度影响你的情绪稳定与安全感。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "月亮在巨蟹座强化照护与敏感的情绪需求，你会以归属来寻求安全与慰藉。 需防多虑引发情绪化反应，给自己留出温和的边界。 当月亮位于第5宫，创造与表达深度影响你的情绪稳定与安全感。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "月亮在巨蟹座强化照护与敏感的情绪需求，你会以归属来寻求安全与慰藉。 需防多虑引发情绪化反应，给自己留出温和的边界。 当月亮位于第6宫，日常与健康深度影响你的情绪稳定与安全感。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "月亮在巨蟹座强化照护与敏感的情绪需求，你会以归属来寻求安全与慰藉。 需防多虑引发情绪化反应，给自己留出温和的边界。 当月亮位于第7宫，伴侣与合作深度影响你的情绪稳定与安全感。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "月亮在巨蟹座强化照护与敏感的情绪需求，你会以归属来寻求安全与慰藉。 需防多虑引发情绪化反应，给自己留出温和的边界。 当月亮位于第8宫，共享与转化深度影响你的情绪稳定与安全感。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "月亮在巨蟹座强化照护与敏感的情绪需求，你会以归属来寻求安全与慰藉。 需防多虑引发情绪化反应，给自己留出温和的边界。 当月亮位于第9宫，远行与信念深度影响你的情绪稳定与安全感。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "月亮在巨蟹座强化照护与敏感的情绪需求，你会以归属来寻求安全与慰藉。 需防多虑引发情绪化反应，给自己留出温和的边界。 当月亮位于第10宫，事业与公众深度影响你的情绪稳定与安全感。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "月亮在巨蟹座强化照护与敏感的情绪需求，你会以归属来寻求安全与慰藉。 需防多虑引发情绪化反应，给自己留出温和的边界。 当月亮位于第11宫，社群与愿景深度影响你的情绪稳定与安全感。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "月亮在巨蟹座强化照护与敏感的情绪需求，你会以归属来寻求安全与慰藉。 需防多虑引发情绪化反应，给自己留出温和的边界。 当月亮位于第12宫，潜意识与疗愈深度影响你的情绪稳定与安全感。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "狮子座": {
      "1": "月亮在狮子座强化自信与创造的情绪需求，你会以表现来寻求安全与慰藉。 需防自我中心引发情绪化反应，给自己留出温和的边界。 当月亮位于第1宫，自我呈现与开端深度影响你的情绪稳定与安全感。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "月亮在狮子座强化自信与创造的情绪需求，你会以表现来寻求安全与慰藉。 需防自我中心引发情绪化反应，给自己留出温和的边界。 当月亮位于第2宫，资源与价值深度影响你的情绪稳定与安全感。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "月亮在狮子座强化自信与创造的情绪需求，你会以表现来寻求安全与慰藉。 需防自我中心引发情绪化反应，给自己留出温和的边界。 当月亮位于第3宫，学习与沟通深度影响你的情绪稳定与安全感。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "月亮在狮子座强化自信与创造的情绪需求，你会以表现来寻求安全与慰藉。 需防自我中心引发情绪化反应，给自己留出温和的边界。 当月亮位于第4宫，家庭与根基深度影响你的情绪稳定与安全感。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "月亮在狮子座强化自信与创造的情绪需求，你会以表现来寻求安全与慰藉。 需防自我中心引发情绪化反应，给自己留出温和的边界。 当月亮位于第5宫，创造与表达深度影响你的情绪稳定与安全感。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "月亮在狮子座强化自信与创造的情绪需求，你会以表现来寻求安全与慰藉。 需防自我中心引发情绪化反应，给自己留出温和的边界。 当月亮位于第6宫，日常与健康深度影响你的情绪稳定与安全感。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "月亮在狮子座强化自信与创造的情绪需求，你会以表现来寻求安全与慰藉。 需防自我中心引发情绪化反应，给自己留出温和的边界。 当月亮位于第7宫，伴侣与合作深度影响你的情绪稳定与安全感。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "月亮在狮子座强化自信与创造的情绪需求，你会以表现来寻求安全与慰藉。 需防自我中心引发情绪化反应，给自己留出温和的边界。 当月亮位于第8宫，共享与转化深度影响你的情绪稳定与安全感。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "月亮在狮子座强化自信与创造的情绪需求，你会以表现来寻求安全与慰藉。 需防自我中心引发情绪化反应，给自己留出温和的边界。 当月亮位于第9宫，远行与信念深度影响你的情绪稳定与安全感。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "月亮在狮子座强化自信与创造的情绪需求，你会以表现来寻求安全与慰藉。 需防自我中心引发情绪化反应，给自己留出温和的边界。 当月亮位于第10宫，事业与公众深度影响你的情绪稳定与安全感。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "月亮在狮子座强化自信与创造的情绪需求，你会以表现来寻求安全与慰藉。 需防自我中心引发情绪化反应，给自己留出温和的边界。 当月亮位于第11宫，社群与愿景深度影响你的情绪稳定与安全感。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "月亮在狮子座强化自信与创造的情绪需求，你会以表现来寻求安全与慰藉。 需防自我中心引发情绪化反应，给自己留出温和的边界。 当月亮位于第12宫，潜意识与疗愈深度影响你的情绪稳定与安全感。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "处女座": {
      "1": "月亮在处女座强化细致与分析的情绪需求，你会以改进来寻求安全与慰藉。 需防挑剔引发情绪化反应，给自己留出温和的边界。 当月亮位于第1宫，自我呈现与开端深度影响你的情绪稳定与安全感。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "月亮在处女座强化细致与分析的情绪需求，你会以改进来寻求安全与慰藉。 需防挑剔引发情绪化反应，给自己留出温和的边界。 当月亮位于第2宫，资源与价值深度影响你的情绪稳定与安全感。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "月亮在处女座强化细致与分析的情绪需求，你会以改进来寻求安全与慰藉。 需防挑剔引发情绪化反应，给自己留出温和的边界。 当月亮位于第3宫，学习与沟通深度影响你的情绪稳定与安全感。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "月亮在处女座强化细致与分析的情绪需求，你会以改进来寻求安全与慰藉。 需防挑剔引发情绪化反应，给自己留出温和的边界。 当月亮位于第4宫，家庭与根基深度影响你的情绪稳定与安全感。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "月亮在处女座强化细致与分析的情绪需求，你会以改进来寻求安全与慰藉。 需防挑剔引发情绪化反应，给自己留出温和的边界。 当月亮位于第5宫，创造与表达深度影响你的情绪稳定与安全感。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "月亮在处女座强化细致与分析的情绪需求，你会以改进来寻求安全与慰藉。 需防挑剔引发情绪化反应，给自己留出温和的边界。 当月亮位于第6宫，日常与健康深度影响你的情绪稳定与安全感。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "月亮在处女座强化细致与分析的情绪需求，你会以改进来寻求安全与慰藉。 需防挑剔引发情绪化反应，给自己留出温和的边界。 当月亮位于第7宫，伴侣与合作深度影响你的情绪稳定与安全感。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "月亮在处女座强化细致与分析的情绪需求，你会以改进来寻求安全与慰藉。 需防挑剔引发情绪化反应，给自己留出温和的边界。 当月亮位于第8宫，共享与转化深度影响你的情绪稳定与安全感。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "月亮在处女座强化细致与分析的情绪需求，你会以改进来寻求安全与慰藉。 需防挑剔引发情绪化反应，给自己留出温和的边界。 当月亮位于第9宫，远行与信念深度影响你的情绪稳定与安全感。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "月亮在处女座强化细致与分析的情绪需求，你会以改进来寻求安全与慰藉。 需防挑剔引发情绪化反应，给自己留出温和的边界。 当月亮位于第10宫，事业与公众深度影响你的情绪稳定与安全感。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "月亮在处女座强化细致与分析的情绪需求，你会以改进来寻求安全与慰藉。 需防挑剔引发情绪化反应，给自己留出温和的边界。 当月亮位于第11宫，社群与愿景深度影响你的情绪稳定与安全感。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "月亮在处女座强化细致与分析的情绪需求，你会以改进来寻求安全与慰藉。 需防挑剔引发情绪化反应，给自己留出温和的边界。 当月亮位于第12宫，潜意识与疗愈深度影响你的情绪稳定与安全感。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "天秤座": {
      "1": "月亮在天秤座强化平衡与合作的情绪需求，你会以审美来寻求安全与慰藉。 需防犹豫引发情绪化反应，给自己留出温和的边界。 当月亮位于第1宫，自我呈现与开端深度影响你的情绪稳定与安全感。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "月亮在天秤座强化平衡与合作的情绪需求，你会以审美来寻求安全与慰藉。 需防犹豫引发情绪化反应，给自己留出温和的边界。 当月亮位于第2宫，资源与价值深度影响你的情绪稳定与安全感。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "月亮在天秤座强化平衡与合作的情绪需求，你会以审美来寻求安全与慰藉。 需防犹豫引发情绪化反应，给自己留出温和的边界。 当月亮位于第3宫，学习与沟通深度影响你的情绪稳定与安全感。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "月亮在天秤座强化平衡与合作的情绪需求，你会以审美来寻求安全与慰藉。 需防犹豫引发情绪化反应，给自己留出温和的边界。 当月亮位于第4宫，家庭与根基深度影响你的情绪稳定与安全感。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "月亮在天秤座强化平衡与合作的情绪需求，你会以审美来寻求安全与慰藉。 需防犹豫引发情绪化反应，给自己留出温和的边界。 当月亮位于第5宫，创造与表达深度影响你的情绪稳定与安全感。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "月亮在天秤座强化平衡与合作的情绪需求，你会以审美来寻求安全与慰藉。 需防犹豫引发情绪化反应，给自己留出温和的边界。 当月亮位于第6宫，日常与健康深度影响你的情绪稳定与安全感。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "月亮在天秤座强化平衡与合作的情绪需求，你会以审美来寻求安全与慰藉。 需防犹豫引发情绪化反应，给自己留出温和的边界。 当月亮位于第7宫，伴侣与合作深度影响你的情绪稳定与安全感。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "月亮在天秤座强化平衡与合作的情绪需求，你会以审美来寻求安全与慰藉。 需防犹豫引发情绪化反应，给自己留出温和的边界。 当月亮位于第8宫，共享与转化深度影响你的情绪稳定与安全感。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "月亮在天秤座强化平衡与合作的情绪需求，你会以审美来寻求安全与慰藉。 需防犹豫引发情绪化反应，给自己留出温和的边界。 当月亮位于第9宫，远行与信念深度影响你的情绪稳定与安全感。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "月亮在天秤座强化平衡与合作的情绪需求，你会以审美来寻求安全与慰藉。 需防犹豫引发情绪化反应，给自己留出温和的边界。 当月亮位于第10宫，事业与公众深度影响你的情绪稳定与安全感。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "月亮在天秤座强化平衡与合作的情绪需求，你会以审美来寻求安全与慰藉。 需防犹豫引发情绪化反应，给自己留出温和的边界。 当月亮位于第11宫，社群与愿景深度影响你的情绪稳定与安全感。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "月亮在天秤座强化平衡与合作的情绪需求，你会以审美来寻求安全与慰藉。 需防犹豫引发情绪化反应，给自己留出温和的边界。 当月亮位于第12宫，潜意识与疗愈深度影响你的情绪稳定与安全感。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "天蝎座": {
      "1": "月亮在天蝎座强化深度与洞察的情绪需求，你会以专注来寻求安全与慰藉。 需防控制欲引发情绪化反应，给自己留出温和的边界。 当月亮位于第1宫，自我呈现与开端深度影响你的情绪稳定与安全感。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "月亮在天蝎座强化深度与洞察的情绪需求，你会以专注来寻求安全与慰藉。 需防控制欲引发情绪化反应，给自己留出温和的边界。 当月亮位于第2宫，资源与价值深度影响你的情绪稳定与安全感。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "月亮在天蝎座强化深度与洞察的情绪需求，你会以专注来寻求安全与慰藉。 需防控制欲引发情绪化反应，给自己留出温和的边界。 当月亮位于第3宫，学习与沟通深度影响你的情绪稳定与安全感。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "月亮在天蝎座强化深度与洞察的情绪需求，你会以专注来寻求安全与慰藉。 需防控制欲引发情绪化反应，给自己留出温和的边界。 当月亮位于第4宫，家庭与根基深度影响你的情绪稳定与安全感。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "月亮在天蝎座强化深度与洞察的情绪需求，你会以专注来寻求安全与慰藉。 需防控制欲引发情绪化反应，给自己留出温和的边界。 当月亮位于第5宫，创造与表达深度影响你的情绪稳定与安全感。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "月亮在天蝎座强化深度与洞察的情绪需求，你会以专注来寻求安全与慰藉。 需防控制欲引发情绪化反应，给自己留出温和的边界。 当月亮位于第6宫，日常与健康深度影响你的情绪稳定与安全感。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "月亮在天蝎座强化深度与洞察的情绪需求，你会以专注来寻求安全与慰藉。 需防控制欲引发情绪化反应，给自己留出温和的边界。 当月亮位于第7宫，伴侣与合作深度影响你的情绪稳定与安全感。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "月亮在天蝎座强化深度与洞察的情绪需求，你会以专注来寻求安全与慰藉。 需防控制欲引发情绪化反应，给自己留出温和的边界。 当月亮位于第8宫，共享与转化深度影响你的情绪稳定与安全感。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "月亮在天蝎座强化深度与洞察的情绪需求，你会以专注来寻求安全与慰藉。 需防控制欲引发情绪化反应，给自己留出温和的边界。 当月亮位于第9宫，远行与信念深度影响你的情绪稳定与安全感。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "月亮在天蝎座强化深度与洞察的情绪需求，你会以专注来寻求安全与慰藉。 需防控制欲引发情绪化反应，给自己留出温和的边界。 当月亮位于第10宫，事业与公众深度影响你的情绪稳定与安全感。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "月亮在天蝎座强化深度与洞察的情绪需求，你会以专注来寻求安全与慰藉。 需防控制欲引发情绪化反应，给自己留出温和的边界。 当月亮位于第11宫，社群与愿景深度影响你的情绪稳定与安全感。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "月亮在天蝎座强化深度与洞察的情绪需求，你会以专注来寻求安全与慰藉。 需防控制欲引发情绪化反应，给自己留出温和的边界。 当月亮位于第12宫，潜意识与疗愈深度影响你的情绪稳定与安全感。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "射手座": {
      "1": "月亮在射手座强化探索与远见的情绪需求，你会以自由来寻求安全与慰藉。 需防冒进引发情绪化反应，给自己留出温和的边界。 当月亮位于第1宫，自我呈现与开端深度影响你的情绪稳定与安全感。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "月亮在射手座强化探索与远见的情绪需求，你会以自由来寻求安全与慰藉。 需防冒进引发情绪化反应，给自己留出温和的边界。 当月亮位于第2宫，资源与价值深度影响你的情绪稳定与安全感。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "月亮在射手座强化探索与远见的情绪需求，你会以自由来寻求安全与慰藉。 需防冒进引发情绪化反应，给自己留出温和的边界。 当月亮位于第3宫，学习与沟通深度影响你的情绪稳定与安全感。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "月亮在射手座强化探索与远见的情绪需求，你会以自由来寻求安全与慰藉。 需防冒进引发情绪化反应，给自己留出温和的边界。 当月亮位于第4宫，家庭与根基深度影响你的情绪稳定与安全感。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "月亮在射手座强化探索与远见的情绪需求，你会以自由来寻求安全与慰藉。 需防冒进引发情绪化反应，给自己留出温和的边界。 当月亮位于第5宫，创造与表达深度影响你的情绪稳定与安全感。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "月亮在射手座强化探索与远见的情绪需求，你会以自由来寻求安全与慰藉。 需防冒进引发情绪化反应，给自己留出温和的边界。 当月亮位于第6宫，日常与健康深度影响你的情绪稳定与安全感。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "月亮在射手座强化探索与远见的情绪需求，你会以自由来寻求安全与慰藉。 需防冒进引发情绪化反应，给自己留出温和的边界。 当月亮位于第7宫，伴侣与合作深度影响你的情绪稳定与安全感。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "月亮在射手座强化探索与远见的情绪需求，你会以自由来寻求安全与慰藉。 需防冒进引发情绪化反应，给自己留出温和的边界。 当月亮位于第8宫，共享与转化深度影响你的情绪稳定与安全感。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "月亮在射手座强化探索与远见的情绪需求，你会以自由来寻求安全与慰藉。 需防冒进引发情绪化反应，给自己留出温和的边界。 当月亮位于第9宫，远行与信念深度影响你的情绪稳定与安全感。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "月亮在射手座强化探索与远见的情绪需求，你会以自由来寻求安全与慰藉。 需防冒进引发情绪化反应，给自己留出温和的边界。 当月亮位于第10宫，事业与公众深度影响你的情绪稳定与安全感。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "月亮在射手座强化探索与远见的情绪需求，你会以自由来寻求安全与慰藉。 需防冒进引发情绪化反应，给自己留出温和的边界。 当月亮位于第11宫，社群与愿景深度影响你的情绪稳定与安全感。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "月亮在射手座强化探索与远见的情绪需求，你会以自由来寻求安全与慰藉。 需防冒进引发情绪化反应，给自己留出温和的边界。 当月亮位于第12宫，潜意识与疗愈深度影响你的情绪稳定与安全感。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "摩羯座": {
      "1": "月亮在摩羯座强化纪律与目标的情绪需求，你会以结构来寻求安全与慰藉。 需防保守引发情绪化反应，给自己留出温和的边界。 当月亮位于第1宫，自我呈现与开端深度影响你的情绪稳定与安全感。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "月亮在摩羯座强化纪律与目标的情绪需求，你会以结构来寻求安全与慰藉。 需防保守引发情绪化反应，给自己留出温和的边界。 当月亮位于第2宫，资源与价值深度影响你的情绪稳定与安全感。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "月亮在摩羯座强化纪律与目标的情绪需求，你会以结构来寻求安全与慰藉。 需防保守引发情绪化反应，给自己留出温和的边界。 当月亮位于第3宫，学习与沟通深度影响你的情绪稳定与安全感。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "月亮在摩羯座强化纪律与目标的情绪需求，你会以结构来寻求安全与慰藉。 需防保守引发情绪化反应，给自己留出温和的边界。 当月亮位于第4宫，家庭与根基深度影响你的情绪稳定与安全感。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "月亮在摩羯座强化纪律与目标的情绪需求，你会以结构来寻求安全与慰藉。 需防保守引发情绪化反应，给自己留出温和的边界。 当月亮位于第5宫，创造与表达深度影响你的情绪稳定与安全感。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "月亮在摩羯座强化纪律与目标的情绪需求，你会以结构来寻求安全与慰藉。 需防保守引发情绪化反应，给自己留出温和的边界。 当月亮位于第6宫，日常与健康深度影响你的情绪稳定与安全感。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "月亮在摩羯座强化纪律与目标的情绪需求，你会以结构来寻求安全与慰藉。 需防保守引发情绪化反应，给自己留出温和的边界。 当月亮位于第7宫，伴侣与合作深度影响你的情绪稳定与安全感。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "月亮在摩羯座强化纪律与目标的情绪需求，你会以结构来寻求安全与慰藉。 需防保守引发情绪化反应，给自己留出温和的边界。 当月亮位于第8宫，共享与转化深度影响你的情绪稳定与安全感。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "月亮在摩羯座强化纪律与目标的情绪需求，你会以结构来寻求安全与慰藉。 需防保守引发情绪化反应，给自己留出温和的边界。 当月亮位于第9宫，远行与信念深度影响你的情绪稳定与安全感。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "月亮在摩羯座强化纪律与目标的情绪需求，你会以结构来寻求安全与慰藉。 需防保守引发情绪化反应，给自己留出温和的边界。 当月亮位于第10宫，事业与公众深度影响你的情绪稳定与安全感。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "月亮在摩羯座强化纪律与目标的情绪需求，你会以结构来寻求安全与慰藉。 需防保守引发情绪化反应，给自己留出温和的边界。 当月亮位于第11宫，社群与愿景深度影响你的情绪稳定与安全感。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "月亮在摩羯座强化纪律与目标的情绪需求，你会以结构来寻求安全与慰藉。 需防保守引发情绪化反应，给自己留出温和的边界。 当月亮位于第12宫，潜意识与疗愈深度影响你的情绪稳定与安全感。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "水瓶座": {
      "1": "月亮在水瓶座强化独立与革新的情绪需求，你会以理性来寻求安全与慰藉。 需防疏离引发情绪化反应，给自己留出温和的边界。 当月亮位于第1宫，自我呈现与开端深度影响你的情绪稳定与安全感。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "月亮在水瓶座强化独立与革新的情绪需求，你会以理性来寻求安全与慰藉。 需防疏离引发情绪化反应，给自己留出温和的边界。 当月亮位于第2宫，资源与价值深度影响你的情绪稳定与安全感。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "月亮在水瓶座强化独立与革新的情绪需求，你会以理性来寻求安全与慰藉。 需防疏离引发情绪化反应，给自己留出温和的边界。 当月亮位于第3宫，学习与沟通深度影响你的情绪稳定与安全感。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "月亮在水瓶座强化独立与革新的情绪需求，你会以理性来寻求安全与慰藉。 需防疏离引发情绪化反应，给自己留出温和的边界。 当月亮位于第4宫，家庭与根基深度影响你的情绪稳定与安全感。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "月亮在水瓶座强化独立与革新的情绪需求，你会以理性来寻求安全与慰藉。 需防疏离引发情绪化反应，给自己留出温和的边界。 当月亮位于第5宫，创造与表达深度影响你的情绪稳定与安全感。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "月亮在水瓶座强化独立与革新的情绪需求，你会以理性来寻求安全与慰藉。 需防疏离引发情绪化反应，给自己留出温和的边界。 当月亮位于第6宫，日常与健康深度影响你的情绪稳定与安全感。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "月亮在水瓶座强化独立与革新的情绪需求，你会以理性来寻求安全与慰藉。 需防疏离引发情绪化反应，给自己留出温和的边界。 当月亮位于第7宫，伴侣与合作深度影响你的情绪稳定与安全感。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "月亮在水瓶座强化独立与革新的情绪需求，你会以理性来寻求安全与慰藉。 需防疏离引发情绪化反应，给自己留出温和的边界。 当月亮位于第8宫，共享与转化深度影响你的情绪稳定与安全感。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "月亮在水瓶座强化独立与革新的情绪需求，你会以理性来寻求安全与慰藉。 需防疏离引发情绪化反应，给自己留出温和的边界。 当月亮位于第9宫，远行与信念深度影响你的情绪稳定与安全感。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "月亮在水瓶座强化独立与革新的情绪需求，你会以理性来寻求安全与慰藉。 需防疏离引发情绪化反应，给自己留出温和的边界。 当月亮位于第10宫，事业与公众深度影响你的情绪稳定与安全感。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "月亮在水瓶座强化独立与革新的情绪需求，你会以理性来寻求安全与慰藉。 需防疏离引发情绪化反应，给自己留出温和的边界。 当月亮位于第11宫，社群与愿景深度影响你的情绪稳定与安全感。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "月亮在水瓶座强化独立与革新的情绪需求，你会以理性来寻求安全与慰藉。 需防疏离引发情绪化反应，给自己留出温和的边界。 当月亮位于第12宫，潜意识与疗愈深度影响你的情绪稳定与安全感。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "双鱼座": {
      "1": "月亮在双鱼座强化共情与想象的情绪需求，你会以融合来寻求安全与慰藉。 需防迷离引发情绪化反应，给自己留出温和的边界。 当月亮位于第1宫，自我呈现与开端深度影响你的情绪稳定与安全感。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "月亮在双鱼座强化共情与想象的情绪需求，你会以融合来寻求安全与慰藉。 需防迷离引发情绪化反应，给自己留出温和的边界。 当月亮位于第2宫，资源与价值深度影响你的情绪稳定与安全感。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "月亮在双鱼座强化共情与想象的情绪需求，你会以融合来寻求安全与慰藉。 需防迷离引发情绪化反应，给自己留出温和的边界。 当月亮位于第3宫，学习与沟通深度影响你的情绪稳定与安全感。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "月亮在双鱼座强化共情与想象的情绪需求，你会以融合来寻求安全与慰藉。 需防迷离引发情绪化反应，给自己留出温和的边界。 当月亮位于第4宫，家庭与根基深度影响你的情绪稳定与安全感。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "月亮在双鱼座强化共情与想象的情绪需求，你会以融合来寻求安全与慰藉。 需防迷离引发情绪化反应，给自己留出温和的边界。 当月亮位于第5宫，创造与表达深度影响你的情绪稳定与安全感。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "月亮在双鱼座强化共情与想象的情绪需求，你会以融合来寻求安全与慰藉。 需防迷离引发情绪化反应，给自己留出温和的边界。 当月亮位于第6宫，日常与健康深度影响你的情绪稳定与安全感。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "月亮在双鱼座强化共情与想象的情绪需求，你会以融合来寻求安全与慰藉。 需防迷离引发情绪化反应，给自己留出温和的边界。 当月亮位于第7宫，伴侣与合作深度影响你的情绪稳定与安全感。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "月亮在双鱼座强化共情与想象的情绪需求，你会以融合来寻求安全与慰藉。 需防迷离引发情绪化反应，给自己留出温和的边界。 当月亮位于第8宫，共享与转化深度影响你的情绪稳定与安全感。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "月亮在双鱼座强化共情与想象的情绪需求，你会以融合来寻求安全与慰藉。 需防迷离引发情绪化反应，给自己留出温和的边界。 当月亮位于第9宫，远行与信念深度影响你的情绪稳定与安全感。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "月亮在双鱼座强化共情与想象的情绪需求，你会以融合来寻求安全与慰藉。 需防迷离引发情绪化反应，给自己留出温和的边界。 当月亮位于第10宫，事业与公众深度影响你的情绪稳定与安全感。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "月亮在双鱼座强化共情与想象的情绪需求，你会以融合来寻求安全与慰藉。 需防迷离引发情绪化反应，给自己留出温和的边界。 当月亮位于第11宫，社群与愿景深度影响你的情绪稳定与安全感。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "月亮在双鱼座强化共情与想象的情绪需求，你会以融合来寻求安全与慰藉。 需防迷离引发情绪化反应，给自己留出温和的边界。 当月亮位于第12宫，潜意识与疗愈深度影响你的情绪稳定与安全感。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    }
  },
  "水星": {
    "白羊座": {
      "1": "水星在白羊座使思维偏向开创与直接，你善用行动来学习与表达。 提防急躁导致信息噪音，靠结构化与复核来矫正。 当水星位于第1宫，你会以理性与沟通处理与自我呈现与开端相关的事务。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "水星在白羊座使思维偏向开创与直接，你善用行动来学习与表达。 提防急躁导致信息噪音，靠结构化与复核来矫正。 当水星位于第2宫，你会以理性与沟通处理与资源与价值相关的事务。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "水星在白羊座使思维偏向开创与直接，你善用行动来学习与表达。 提防急躁导致信息噪音，靠结构化与复核来矫正。 当水星位于第3宫，你会以理性与沟通处理与学习与沟通相关的事务。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "水星在白羊座使思维偏向开创与直接，你善用行动来学习与表达。 提防急躁导致信息噪音，靠结构化与复核来矫正。 当水星位于第4宫，你会以理性与沟通处理与家庭与根基相关的事务。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "水星在白羊座使思维偏向开创与直接，你善用行动来学习与表达。 提防急躁导致信息噪音，靠结构化与复核来矫正。 当水星位于第5宫，你会以理性与沟通处理与创造与表达相关的事务。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "水星在白羊座使思维偏向开创与直接，你善用行动来学习与表达。 提防急躁导致信息噪音，靠结构化与复核来矫正。 当水星位于第6宫，你会以理性与沟通处理与日常与健康相关的事务。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "水星在白羊座使思维偏向开创与直接，你善用行动来学习与表达。 提防急躁导致信息噪音，靠结构化与复核来矫正。 当水星位于第7宫，你会以理性与沟通处理与伴侣与合作相关的事务。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "水星在白羊座使思维偏向开创与直接，你善用行动来学习与表达。 提防急躁导致信息噪音，靠结构化与复核来矫正。 当水星位于第8宫，你会以理性与沟通处理与共享与转化相关的事务。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "水星在白羊座使思维偏向开创与直接，你善用行动来学习与表达。 提防急躁导致信息噪音，靠结构化与复核来矫正。 当水星位于第9宫，你会以理性与沟通处理与远行与信念相关的事务。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "水星在白羊座使思维偏向开创与直接，你善用行动来学习与表达。 提防急躁导致信息噪音，靠结构化与复核来矫正。 当水星位于第10宫，你会以理性与沟通处理与事业与公众相关的事务。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "水星在白羊座使思维偏向开创与直接，你善用行动来学习与表达。 提防急躁导致信息噪音，靠结构化与复核来矫正。 当水星位于第11宫，你会以理性与沟通处理与社群与愿景相关的事务。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "水星在白羊座使思维偏向开创与直接，你善用行动来学习与表达。 提防急躁导致信息噪音，靠结构化与复核来矫正。 当水星位于第12宫，你会以理性与沟通处理与潜意识与疗愈相关的事务。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "金牛座": {
      "1": "水星在金牛座使思维偏向稳健与务实，你善用耐心来学习与表达。 提防固执导致信息噪音，靠结构化与复核来矫正。 当水星位于第1宫，你会以理性与沟通处理与自我呈现与开端相关的事务。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "水星在金牛座使思维偏向稳健与务实，你善用耐心来学习与表达。 提防固执导致信息噪音，靠结构化与复核来矫正。 当水星位于第2宫，你会以理性与沟通处理与资源与价值相关的事务。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "水星在金牛座使思维偏向稳健与务实，你善用耐心来学习与表达。 提防固执导致信息噪音，靠结构化与复核来矫正。 当水星位于第3宫，你会以理性与沟通处理与学习与沟通相关的事务。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "水星在金牛座使思维偏向稳健与务实，你善用耐心来学习与表达。 提防固执导致信息噪音，靠结构化与复核来矫正。 当水星位于第4宫，你会以理性与沟通处理与家庭与根基相关的事务。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "水星在金牛座使思维偏向稳健与务实，你善用耐心来学习与表达。 提防固执导致信息噪音，靠结构化与复核来矫正。 当水星位于第5宫，你会以理性与沟通处理与创造与表达相关的事务。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "水星在金牛座使思维偏向稳健与务实，你善用耐心来学习与表达。 提防固执导致信息噪音，靠结构化与复核来矫正。 当水星位于第6宫，你会以理性与沟通处理与日常与健康相关的事务。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "水星在金牛座使思维偏向稳健与务实，你善用耐心来学习与表达。 提防固执导致信息噪音，靠结构化与复核来矫正。 当水星位于第7宫，你会以理性与沟通处理与伴侣与合作相关的事务。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "水星在金牛座使思维偏向稳健与务实，你善用耐心来学习与表达。 提防固执导致信息噪音，靠结构化与复核来矫正。 当水星位于第8宫，你会以理性与沟通处理与共享与转化相关的事务。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "水星在金牛座使思维偏向稳健与务实，你善用耐心来学习与表达。 提防固执导致信息噪音，靠结构化与复核来矫正。 当水星位于第9宫，你会以理性与沟通处理与远行与信念相关的事务。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "水星在金牛座使思维偏向稳健与务实，你善用耐心来学习与表达。 提防固执导致信息噪音，靠结构化与复核来矫正。 当水星位于第10宫，你会以理性与沟通处理与事业与公众相关的事务。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "水星在金牛座使思维偏向稳健与务实，你善用耐心来学习与表达。 提防固执导致信息噪音，靠结构化与复核来矫正。 当水星位于第11宫，你会以理性与沟通处理与社群与愿景相关的事务。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "水星在金牛座使思维偏向稳健与务实，你善用耐心来学习与表达。 提防固执导致信息噪音，靠结构化与复核来矫正。 当水星位于第12宫，你会以理性与沟通处理与潜意识与疗愈相关的事务。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "双子座": {
      "1": "水星在双子座使思维偏向机敏与好奇，你善用沟通来学习与表达。 提防分散导致信息噪音，靠结构化与复核来矫正。 当水星位于第1宫，你会以理性与沟通处理与自我呈现与开端相关的事务。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "水星在双子座使思维偏向机敏与好奇，你善用沟通来学习与表达。 提防分散导致信息噪音，靠结构化与复核来矫正。 当水星位于第2宫，你会以理性与沟通处理与资源与价值相关的事务。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "水星在双子座使思维偏向机敏与好奇，你善用沟通来学习与表达。 提防分散导致信息噪音，靠结构化与复核来矫正。 当水星位于第3宫，你会以理性与沟通处理与学习与沟通相关的事务。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "水星在双子座使思维偏向机敏与好奇，你善用沟通来学习与表达。 提防分散导致信息噪音，靠结构化与复核来矫正。 当水星位于第4宫，你会以理性与沟通处理与家庭与根基相关的事务。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "水星在双子座使思维偏向机敏与好奇，你善用沟通来学习与表达。 提防分散导致信息噪音，靠结构化与复核来矫正。 当水星位于第5宫，你会以理性与沟通处理与创造与表达相关的事务。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "水星在双子座使思维偏向机敏与好奇，你善用沟通来学习与表达。 提防分散导致信息噪音，靠结构化与复核来矫正。 当水星位于第6宫，你会以理性与沟通处理与日常与健康相关的事务。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "水星在双子座使思维偏向机敏与好奇，你善用沟通来学习与表达。 提防分散导致信息噪音，靠结构化与复核来矫正。 当水星位于第7宫，你会以理性与沟通处理与伴侣与合作相关的事务。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "水星在双子座使思维偏向机敏与好奇，你善用沟通来学习与表达。 提防分散导致信息噪音，靠结构化与复核来矫正。 当水星位于第8宫，你会以理性与沟通处理与共享与转化相关的事务。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "水星在双子座使思维偏向机敏与好奇，你善用沟通来学习与表达。 提防分散导致信息噪音，靠结构化与复核来矫正。 当水星位于第9宫，你会以理性与沟通处理与远行与信念相关的事务。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "水星在双子座使思维偏向机敏与好奇，你善用沟通来学习与表达。 提防分散导致信息噪音，靠结构化与复核来矫正。 当水星位于第10宫，你会以理性与沟通处理与事业与公众相关的事务。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "水星在双子座使思维偏向机敏与好奇，你善用沟通来学习与表达。 提防分散导致信息噪音，靠结构化与复核来矫正。 当水星位于第11宫，你会以理性与沟通处理与社群与愿景相关的事务。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "水星在双子座使思维偏向机敏与好奇，你善用沟通来学习与表达。 提防分散导致信息噪音，靠结构化与复核来矫正。 当水星位于第12宫，你会以理性与沟通处理与潜意识与疗愈相关的事务。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "巨蟹座": {
      "1": "水星在巨蟹座使思维偏向照护与敏感，你善用归属来学习与表达。 提防多虑导致信息噪音，靠结构化与复核来矫正。 当水星位于第1宫，你会以理性与沟通处理与自我呈现与开端相关的事务。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "水星在巨蟹座使思维偏向照护与敏感，你善用归属来学习与表达。 提防多虑导致信息噪音，靠结构化与复核来矫正。 当水星位于第2宫，你会以理性与沟通处理与资源与价值相关的事务。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "水星在巨蟹座使思维偏向照护与敏感，你善用归属来学习与表达。 提防多虑导致信息噪音，靠结构化与复核来矫正。 当水星位于第3宫，你会以理性与沟通处理与学习与沟通相关的事务。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "水星在巨蟹座使思维偏向照护与敏感，你善用归属来学习与表达。 提防多虑导致信息噪音，靠结构化与复核来矫正。 当水星位于第4宫，你会以理性与沟通处理与家庭与根基相关的事务。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "水星在巨蟹座使思维偏向照护与敏感，你善用归属来学习与表达。 提防多虑导致信息噪音，靠结构化与复核来矫正。 当水星位于第5宫，你会以理性与沟通处理与创造与表达相关的事务。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "水星在巨蟹座使思维偏向照护与敏感，你善用归属来学习与表达。 提防多虑导致信息噪音，靠结构化与复核来矫正。 当水星位于第6宫，你会以理性与沟通处理与日常与健康相关的事务。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "水星在巨蟹座使思维偏向照护与敏感，你善用归属来学习与表达。 提防多虑导致信息噪音，靠结构化与复核来矫正。 当水星位于第7宫，你会以理性与沟通处理与伴侣与合作相关的事务。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "水星在巨蟹座使思维偏向照护与敏感，你善用归属来学习与表达。 提防多虑导致信息噪音，靠结构化与复核来矫正。 当水星位于第8宫，你会以理性与沟通处理与共享与转化相关的事务。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "水星在巨蟹座使思维偏向照护与敏感，你善用归属来学习与表达。 提防多虑导致信息噪音，靠结构化与复核来矫正。 当水星位于第9宫，你会以理性与沟通处理与远行与信念相关的事务。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "水星在巨蟹座使思维偏向照护与敏感，你善用归属来学习与表达。 提防多虑导致信息噪音，靠结构化与复核来矫正。 当水星位于第10宫，你会以理性与沟通处理与事业与公众相关的事务。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "水星在巨蟹座使思维偏向照护与敏感，你善用归属来学习与表达。 提防多虑导致信息噪音，靠结构化与复核来矫正。 当水星位于第11宫，你会以理性与沟通处理与社群与愿景相关的事务。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "水星在巨蟹座使思维偏向照护与敏感，你善用归属来学习与表达。 提防多虑导致信息噪音，靠结构化与复核来矫正。 当水星位于第12宫，你会以理性与沟通处理与潜意识与疗愈相关的事务。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "狮子座": {
      "1": "水星在狮子座使思维偏向自信与创造，你善用表现来学习与表达。 提防自我中心导致信息噪音，靠结构化与复核来矫正。 当水星位于第1宫，你会以理性与沟通处理与自我呈现与开端相关的事务。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "水星在狮子座使思维偏向自信与创造，你善用表现来学习与表达。 提防自我中心导致信息噪音，靠结构化与复核来矫正。 当水星位于第2宫，你会以理性与沟通处理与资源与价值相关的事务。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "水星在狮子座使思维偏向自信与创造，你善用表现来学习与表达。 提防自我中心导致信息噪音，靠结构化与复核来矫正。 当水星位于第3宫，你会以理性与沟通处理与学习与沟通相关的事务。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "水星在狮子座使思维偏向自信与创造，你善用表现来学习与表达。 提防自我中心导致信息噪音，靠结构化与复核来矫正。 当水星位于第4宫，你会以理性与沟通处理与家庭与根基相关的事务。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "水星在狮子座使思维偏向自信与创造，你善用表现来学习与表达。 提防自我中心导致信息噪音，靠结构化与复核来矫正。 当水星位于第5宫，你会以理性与沟通处理与创造与表达相关的事务。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "水星在狮子座使思维偏向自信与创造，你善用表现来学习与表达。 提防自我中心导致信息噪音，靠结构化与复核来矫正。 当水星位于第6宫，你会以理性与沟通处理与日常与健康相关的事务。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "水星在狮子座使思维偏向自信与创造，你善用表现来学习与表达。 提防自我中心导致信息噪音，靠结构化与复核来矫正。 当水星位于第7宫，你会以理性与沟通处理与伴侣与合作相关的事务。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "水星在狮子座使思维偏向自信与创造，你善用表现来学习与表达。 提防自我中心导致信息噪音，靠结构化与复核来矫正。 当水星位于第8宫，你会以理性与沟通处理与共享与转化相关的事务。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "水星在狮子座使思维偏向自信与创造，你善用表现来学习与表达。 提防自我中心导致信息噪音，靠结构化与复核来矫正。 当水星位于第9宫，你会以理性与沟通处理与远行与信念相关的事务。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "水星在狮子座使思维偏向自信与创造，你善用表现来学习与表达。 提防自我中心导致信息噪音，靠结构化与复核来矫正。 当水星位于第10宫，你会以理性与沟通处理与事业与公众相关的事务。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "水星在狮子座使思维偏向自信与创造，你善用表现来学习与表达。 提防自我中心导致信息噪音，靠结构化与复核来矫正。 当水星位于第11宫，你会以理性与沟通处理与社群与愿景相关的事务。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "水星在狮子座使思维偏向自信与创造，你善用表现来学习与表达。 提防自我中心导致信息噪音，靠结构化与复核来矫正。 当水星位于第12宫，你会以理性与沟通处理与潜意识与疗愈相关的事务。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "处女座": {
      "1": "水星在处女座使思维偏向细致与分析，你善用改进来学习与表达。 提防挑剔导致信息噪音，靠结构化与复核来矫正。 当水星位于第1宫，你会以理性与沟通处理与自我呈现与开端相关的事务。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "水星在处女座使思维偏向细致与分析，你善用改进来学习与表达。 提防挑剔导致信息噪音，靠结构化与复核来矫正。 当水星位于第2宫，你会以理性与沟通处理与资源与价值相关的事务。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "水星在处女座使思维偏向细致与分析，你善用改进来学习与表达。 提防挑剔导致信息噪音，靠结构化与复核来矫正。 当水星位于第3宫，你会以理性与沟通处理与学习与沟通相关的事务。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "水星在处女座使思维偏向细致与分析，你善用改进来学习与表达。 提防挑剔导致信息噪音，靠结构化与复核来矫正。 当水星位于第4宫，你会以理性与沟通处理与家庭与根基相关的事务。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "水星在处女座使思维偏向细致与分析，你善用改进来学习与表达。 提防挑剔导致信息噪音，靠结构化与复核来矫正。 当水星位于第5宫，你会以理性与沟通处理与创造与表达相关的事务。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "水星在处女座使思维偏向细致与分析，你善用改进来学习与表达。 提防挑剔导致信息噪音，靠结构化与复核来矫正。 当水星位于第6宫，你会以理性与沟通处理与日常与健康相关的事务。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "水星在处女座使思维偏向细致与分析，你善用改进来学习与表达。 提防挑剔导致信息噪音，靠结构化与复核来矫正。 当水星位于第7宫，你会以理性与沟通处理与伴侣与合作相关的事务。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "水星在处女座使思维偏向细致与分析，你善用改进来学习与表达。 提防挑剔导致信息噪音，靠结构化与复核来矫正。 当水星位于第8宫，你会以理性与沟通处理与共享与转化相关的事务。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "水星在处女座使思维偏向细致与分析，你善用改进来学习与表达。 提防挑剔导致信息噪音，靠结构化与复核来矫正。 当水星位于第9宫，你会以理性与沟通处理与远行与信念相关的事务。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "水星在处女座使思维偏向细致与分析，你善用改进来学习与表达。 提防挑剔导致信息噪音，靠结构化与复核来矫正。 当水星位于第10宫，你会以理性与沟通处理与事业与公众相关的事务。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "水星在处女座使思维偏向细致与分析，你善用改进来学习与表达。 提防挑剔导致信息噪音，靠结构化与复核来矫正。 当水星位于第11宫，你会以理性与沟通处理与社群与愿景相关的事务。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "水星在处女座使思维偏向细致与分析，你善用改进来学习与表达。 提防挑剔导致信息噪音，靠结构化与复核来矫正。 当水星位于第12宫，你会以理性与沟通处理与潜意识与疗愈相关的事务。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "天秤座": {
      "1": "水星在天秤座使思维偏向平衡与合作，你善用审美来学习与表达。 提防犹豫导致信息噪音，靠结构化与复核来矫正。 当水星位于第1宫，你会以理性与沟通处理与自我呈现与开端相关的事务。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "水星在天秤座使思维偏向平衡与合作，你善用审美来学习与表达。 提防犹豫导致信息噪音，靠结构化与复核来矫正。 当水星位于第2宫，你会以理性与沟通处理与资源与价值相关的事务。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "水星在天秤座使思维偏向平衡与合作，你善用审美来学习与表达。 提防犹豫导致信息噪音，靠结构化与复核来矫正。 当水星位于第3宫，你会以理性与沟通处理与学习与沟通相关的事务。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "水星在天秤座使思维偏向平衡与合作，你善用审美来学习与表达。 提防犹豫导致信息噪音，靠结构化与复核来矫正。 当水星位于第4宫，你会以理性与沟通处理与家庭与根基相关的事务。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "水星在天秤座使思维偏向平衡与合作，你善用审美来学习与表达。 提防犹豫导致信息噪音，靠结构化与复核来矫正。 当水星位于第5宫，你会以理性与沟通处理与创造与表达相关的事务。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "水星在天秤座使思维偏向平衡与合作，你善用审美来学习与表达。 提防犹豫导致信息噪音，靠结构化与复核来矫正。 当水星位于第6宫，你会以理性与沟通处理与日常与健康相关的事务。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "水星在天秤座使思维偏向平衡与合作，你善用审美来学习与表达。 提防犹豫导致信息噪音，靠结构化与复核来矫正。 当水星位于第7宫，你会以理性与沟通处理与伴侣与合作相关的事务。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "水星在天秤座使思维偏向平衡与合作，你善用审美来学习与表达。 提防犹豫导致信息噪音，靠结构化与复核来矫正。 当水星位于第8宫，你会以理性与沟通处理与共享与转化相关的事务。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "水星在天秤座使思维偏向平衡与合作，你善用审美来学习与表达。 提防犹豫导致信息噪音，靠结构化与复核来矫正。 当水星位于第9宫，你会以理性与沟通处理与远行与信念相关的事务。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "水星在天秤座使思维偏向平衡与合作，你善用审美来学习与表达。 提防犹豫导致信息噪音，靠结构化与复核来矫正。 当水星位于第10宫，你会以理性与沟通处理与事业与公众相关的事务。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "水星在天秤座使思维偏向平衡与合作，你善用审美来学习与表达。 提防犹豫导致信息噪音，靠结构化与复核来矫正。 当水星位于第11宫，你会以理性与沟通处理与社群与愿景相关的事务。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "水星在天秤座使思维偏向平衡与合作，你善用审美来学习与表达。 提防犹豫导致信息噪音，靠结构化与复核来矫正。 当水星位于第12宫，你会以理性与沟通处理与潜意识与疗愈相关的事务。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "天蝎座": {
      "1": "水星在天蝎座使思维偏向深度与洞察，你善用专注来学习与表达。 提防控制欲导致信息噪音，靠结构化与复核来矫正。 当水星位于第1宫，你会以理性与沟通处理与自我呈现与开端相关的事务。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "水星在天蝎座使思维偏向深度与洞察，你善用专注来学习与表达。 提防控制欲导致信息噪音，靠结构化与复核来矫正。 当水星位于第2宫，你会以理性与沟通处理与资源与价值相关的事务。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "水星在天蝎座使思维偏向深度与洞察，你善用专注来学习与表达。 提防控制欲导致信息噪音，靠结构化与复核来矫正。 当水星位于第3宫，你会以理性与沟通处理与学习与沟通相关的事务。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "水星在天蝎座使思维偏向深度与洞察，你善用专注来学习与表达。 提防控制欲导致信息噪音，靠结构化与复核来矫正。 当水星位于第4宫，你会以理性与沟通处理与家庭与根基相关的事务。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "水星在天蝎座使思维偏向深度与洞察，你善用专注来学习与表达。 提防控制欲导致信息噪音，靠结构化与复核来矫正。 当水星位于第5宫，你会以理性与沟通处理与创造与表达相关的事务。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "水星在天蝎座使思维偏向深度与洞察，你善用专注来学习与表达。 提防控制欲导致信息噪音，靠结构化与复核来矫正。 当水星位于第6宫，你会以理性与沟通处理与日常与健康相关的事务。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "水星在天蝎座使思维偏向深度与洞察，你善用专注来学习与表达。 提防控制欲导致信息噪音，靠结构化与复核来矫正。 当水星位于第7宫，你会以理性与沟通处理与伴侣与合作相关的事务。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "水星在天蝎座使思维偏向深度与洞察，你善用专注来学习与表达。 提防控制欲导致信息噪音，靠结构化与复核来矫正。 当水星位于第8宫，你会以理性与沟通处理与共享与转化相关的事务。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "水星在天蝎座使思维偏向深度与洞察，你善用专注来学习与表达。 提防控制欲导致信息噪音，靠结构化与复核来矫正。 当水星位于第9宫，你会以理性与沟通处理与远行与信念相关的事务。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "水星在天蝎座使思维偏向深度与洞察，你善用专注来学习与表达。 提防控制欲导致信息噪音，靠结构化与复核来矫正。 当水星位于第10宫，你会以理性与沟通处理与事业与公众相关的事务。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "水星在天蝎座使思维偏向深度与洞察，你善用专注来学习与表达。 提防控制欲导致信息噪音，靠结构化与复核来矫正。 当水星位于第11宫，你会以理性与沟通处理与社群与愿景相关的事务。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "水星在天蝎座使思维偏向深度与洞察，你善用专注来学习与表达。 提防控制欲导致信息噪音，靠结构化与复核来矫正。 当水星位于第12宫，你会以理性与沟通处理与潜意识与疗愈相关的事务。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "射手座": {
      "1": "水星在射手座使思维偏向探索与远见，你善用自由来学习与表达。 提防冒进导致信息噪音，靠结构化与复核来矫正。 当水星位于第1宫，你会以理性与沟通处理与自我呈现与开端相关的事务。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "水星在射手座使思维偏向探索与远见，你善用自由来学习与表达。 提防冒进导致信息噪音，靠结构化与复核来矫正。 当水星位于第2宫，你会以理性与沟通处理与资源与价值相关的事务。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "水星在射手座使思维偏向探索与远见，你善用自由来学习与表达。 提防冒进导致信息噪音，靠结构化与复核来矫正。 当水星位于第3宫，你会以理性与沟通处理与学习与沟通相关的事务。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "水星在射手座使思维偏向探索与远见，你善用自由来学习与表达。 提防冒进导致信息噪音，靠结构化与复核来矫正。 当水星位于第4宫，你会以理性与沟通处理与家庭与根基相关的事务。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "水星在射手座使思维偏向探索与远见，你善用自由来学习与表达。 提防冒进导致信息噪音，靠结构化与复核来矫正。 当水星位于第5宫，你会以理性与沟通处理与创造与表达相关的事务。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "水星在射手座使思维偏向探索与远见，你善用自由来学习与表达。 提防冒进导致信息噪音，靠结构化与复核来矫正。 当水星位于第6宫，你会以理性与沟通处理与日常与健康相关的事务。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "水星在射手座使思维偏向探索与远见，你善用自由来学习与表达。 提防冒进导致信息噪音，靠结构化与复核来矫正。 当水星位于第7宫，你会以理性与沟通处理与伴侣与合作相关的事务。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "水星在射手座使思维偏向探索与远见，你善用自由来学习与表达。 提防冒进导致信息噪音，靠结构化与复核来矫正。 当水星位于第8宫，你会以理性与沟通处理与共享与转化相关的事务。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "水星在射手座使思维偏向探索与远见，你善用自由来学习与表达。 提防冒进导致信息噪音，靠结构化与复核来矫正。 当水星位于第9宫，你会以理性与沟通处理与远行与信念相关的事务。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "水星在射手座使思维偏向探索与远见，你善用自由来学习与表达。 提防冒进导致信息噪音，靠结构化与复核来矫正。 当水星位于第10宫，你会以理性与沟通处理与事业与公众相关的事务。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "水星在射手座使思维偏向探索与远见，你善用自由来学习与表达。 提防冒进导致信息噪音，靠结构化与复核来矫正。 当水星位于第11宫，你会以理性与沟通处理与社群与愿景相关的事务。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "水星在射手座使思维偏向探索与远见，你善用自由来学习与表达。 提防冒进导致信息噪音，靠结构化与复核来矫正。 当水星位于第12宫，你会以理性与沟通处理与潜意识与疗愈相关的事务。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "摩羯座": {
      "1": "水星在摩羯座使思维偏向纪律与目标，你善用结构来学习与表达。 提防保守导致信息噪音，靠结构化与复核来矫正。 当水星位于第1宫，你会以理性与沟通处理与自我呈现与开端相关的事务。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "水星在摩羯座使思维偏向纪律与目标，你善用结构来学习与表达。 提防保守导致信息噪音，靠结构化与复核来矫正。 当水星位于第2宫，你会以理性与沟通处理与资源与价值相关的事务。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "水星在摩羯座使思维偏向纪律与目标，你善用结构来学习与表达。 提防保守导致信息噪音，靠结构化与复核来矫正。 当水星位于第3宫，你会以理性与沟通处理与学习与沟通相关的事务。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "水星在摩羯座使思维偏向纪律与目标，你善用结构来学习与表达。 提防保守导致信息噪音，靠结构化与复核来矫正。 当水星位于第4宫，你会以理性与沟通处理与家庭与根基相关的事务。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "水星在摩羯座使思维偏向纪律与目标，你善用结构来学习与表达。 提防保守导致信息噪音，靠结构化与复核来矫正。 当水星位于第5宫，你会以理性与沟通处理与创造与表达相关的事务。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "水星在摩羯座使思维偏向纪律与目标，你善用结构来学习与表达。 提防保守导致信息噪音，靠结构化与复核来矫正。 当水星位于第6宫，你会以理性与沟通处理与日常与健康相关的事务。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "水星在摩羯座使思维偏向纪律与目标，你善用结构来学习与表达。 提防保守导致信息噪音，靠结构化与复核来矫正。 当水星位于第7宫，你会以理性与沟通处理与伴侣与合作相关的事务。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "水星在摩羯座使思维偏向纪律与目标，你善用结构来学习与表达。 提防保守导致信息噪音，靠结构化与复核来矫正。 当水星位于第8宫，你会以理性与沟通处理与共享与转化相关的事务。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "水星在摩羯座使思维偏向纪律与目标，你善用结构来学习与表达。 提防保守导致信息噪音，靠结构化与复核来矫正。 当水星位于第9宫，你会以理性与沟通处理与远行与信念相关的事务。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "水星在摩羯座使思维偏向纪律与目标，你善用结构来学习与表达。 提防保守导致信息噪音，靠结构化与复核来矫正。 当水星位于第10宫，你会以理性与沟通处理与事业与公众相关的事务。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "水星在摩羯座使思维偏向纪律与目标，你善用结构来学习与表达。 提防保守导致信息噪音，靠结构化与复核来矫正。 当水星位于第11宫，你会以理性与沟通处理与社群与愿景相关的事务。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "水星在摩羯座使思维偏向纪律与目标，你善用结构来学习与表达。 提防保守导致信息噪音，靠结构化与复核来矫正。 当水星位于第12宫，你会以理性与沟通处理与潜意识与疗愈相关的事务。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "水瓶座": {
      "1": "水星在水瓶座使思维偏向独立与革新，你善用理性来学习与表达。 提防疏离导致信息噪音，靠结构化与复核来矫正。 当水星位于第1宫，你会以理性与沟通处理与自我呈现与开端相关的事务。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "水星在水瓶座使思维偏向独立与革新，你善用理性来学习与表达。 提防疏离导致信息噪音，靠结构化与复核来矫正。 当水星位于第2宫，你会以理性与沟通处理与资源与价值相关的事务。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "水星在水瓶座使思维偏向独立与革新，你善用理性来学习与表达。 提防疏离导致信息噪音，靠结构化与复核来矫正。 当水星位于第3宫，你会以理性与沟通处理与学习与沟通相关的事务。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "水星在水瓶座使思维偏向独立与革新，你善用理性来学习与表达。 提防疏离导致信息噪音，靠结构化与复核来矫正。 当水星位于第4宫，你会以理性与沟通处理与家庭与根基相关的事务。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "水星在水瓶座使思维偏向独立与革新，你善用理性来学习与表达。 提防疏离导致信息噪音，靠结构化与复核来矫正。 当水星位于第5宫，你会以理性与沟通处理与创造与表达相关的事务。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "水星在水瓶座使思维偏向独立与革新，你善用理性来学习与表达。 提防疏离导致信息噪音，靠结构化与复核来矫正。 当水星位于第6宫，你会以理性与沟通处理与日常与健康相关的事务。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "水星在水瓶座使思维偏向独立与革新，你善用理性来学习与表达。 提防疏离导致信息噪音，靠结构化与复核来矫正。 当水星位于第7宫，你会以理性与沟通处理与伴侣与合作相关的事务。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "水星在水瓶座使思维偏向独立与革新，你善用理性来学习与表达。 提防疏离导致信息噪音，靠结构化与复核来矫正。 当水星位于第8宫，你会以理性与沟通处理与共享与转化相关的事务。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "水星在水瓶座使思维偏向独立与革新，你善用理性来学习与表达。 提防疏离导致信息噪音，靠结构化与复核来矫正。 当水星位于第9宫，你会以理性与沟通处理与远行与信念相关的事务。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "水星在水瓶座使思维偏向独立与革新，你善用理性来学习与表达。 提防疏离导致信息噪音，靠结构化与复核来矫正。 当水星位于第10宫，你会以理性与沟通处理与事业与公众相关的事务。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "水星在水瓶座使思维偏向独立与革新，你善用理性来学习与表达。 提防疏离导致信息噪音，靠结构化与复核来矫正。 当水星位于第11宫，你会以理性与沟通处理与社群与愿景相关的事务。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "水星在水瓶座使思维偏向独立与革新，你善用理性来学习与表达。 提防疏离导致信息噪音，靠结构化与复核来矫正。 当水星位于第12宫，你会以理性与沟通处理与潜意识与疗愈相关的事务。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "双鱼座": {
      "1": "水星在双鱼座使思维偏向共情与想象，你善用融合来学习与表达。 提防迷离导致信息噪音，靠结构化与复核来矫正。 当水星位于第1宫，你会以理性与沟通处理与自我呈现与开端相关的事务。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "水星在双鱼座使思维偏向共情与想象，你善用融合来学习与表达。 提防迷离导致信息噪音，靠结构化与复核来矫正。 当水星位于第2宫，你会以理性与沟通处理与资源与价值相关的事务。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "水星在双鱼座使思维偏向共情与想象，你善用融合来学习与表达。 提防迷离导致信息噪音，靠结构化与复核来矫正。 当水星位于第3宫，你会以理性与沟通处理与学习与沟通相关的事务。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "水星在双鱼座使思维偏向共情与想象，你善用融合来学习与表达。 提防迷离导致信息噪音，靠结构化与复核来矫正。 当水星位于第4宫，你会以理性与沟通处理与家庭与根基相关的事务。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "水星在双鱼座使思维偏向共情与想象，你善用融合来学习与表达。 提防迷离导致信息噪音，靠结构化与复核来矫正。 当水星位于第5宫，你会以理性与沟通处理与创造与表达相关的事务。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "水星在双鱼座使思维偏向共情与想象，你善用融合来学习与表达。 提防迷离导致信息噪音，靠结构化与复核来矫正。 当水星位于第6宫，你会以理性与沟通处理与日常与健康相关的事务。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "水星在双鱼座使思维偏向共情与想象，你善用融合来学习与表达。 提防迷离导致信息噪音，靠结构化与复核来矫正。 当水星位于第7宫，你会以理性与沟通处理与伴侣与合作相关的事务。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "水星在双鱼座使思维偏向共情与想象，你善用融合来学习与表达。 提防迷离导致信息噪音，靠结构化与复核来矫正。 当水星位于第8宫，你会以理性与沟通处理与共享与转化相关的事务。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "水星在双鱼座使思维偏向共情与想象，你善用融合来学习与表达。 提防迷离导致信息噪音，靠结构化与复核来矫正。 当水星位于第9宫，你会以理性与沟通处理与远行与信念相关的事务。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "水星在双鱼座使思维偏向共情与想象，你善用融合来学习与表达。 提防迷离导致信息噪音，靠结构化与复核来矫正。 当水星位于第10宫，你会以理性与沟通处理与事业与公众相关的事务。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "水星在双鱼座使思维偏向共情与想象，你善用融合来学习与表达。 提防迷离导致信息噪音，靠结构化与复核来矫正。 当水星位于第11宫，你会以理性与沟通处理与社群与愿景相关的事务。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "水星在双鱼座使思维偏向共情与想象，你善用融合来学习与表达。 提防迷离导致信息噪音，靠结构化与复核来矫正。 当水星位于第12宫，你会以理性与沟通处理与潜意识与疗愈相关的事务。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    }
  },
  "金星": {
    "白羊座": {
      "1": "金星在白羊座让审美与关系呈现开创与直接的调性，你在价值交换中偏好行动。 避免因急躁而迁就或过度装饰，明确界限更能互惠。 当金星位于第1宫，你倾向在自我呈现与开端中追求和谐与美感。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "金星在白羊座让审美与关系呈现开创与直接的调性，你在价值交换中偏好行动。 避免因急躁而迁就或过度装饰，明确界限更能互惠。 当金星位于第2宫，你倾向在资源与价值中追求和谐与美感。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "金星在白羊座让审美与关系呈现开创与直接的调性，你在价值交换中偏好行动。 避免因急躁而迁就或过度装饰，明确界限更能互惠。 当金星位于第3宫，你倾向在学习与沟通中追求和谐与美感。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "金星在白羊座让审美与关系呈现开创与直接的调性，你在价值交换中偏好行动。 避免因急躁而迁就或过度装饰，明确界限更能互惠。 当金星位于第4宫，你倾向在家庭与根基中追求和谐与美感。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "金星在白羊座让审美与关系呈现开创与直接的调性，你在价值交换中偏好行动。 避免因急躁而迁就或过度装饰，明确界限更能互惠。 当金星位于第5宫，你倾向在创造与表达中追求和谐与美感。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "金星在白羊座让审美与关系呈现开创与直接的调性，你在价值交换中偏好行动。 避免因急躁而迁就或过度装饰，明确界限更能互惠。 当金星位于第6宫，你倾向在日常与健康中追求和谐与美感。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "金星在白羊座让审美与关系呈现开创与直接的调性，你在价值交换中偏好行动。 避免因急躁而迁就或过度装饰，明确界限更能互惠。 当金星位于第7宫，你倾向在伴侣与合作中追求和谐与美感。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "金星在白羊座让审美与关系呈现开创与直接的调性，你在价值交换中偏好行动。 避免因急躁而迁就或过度装饰，明确界限更能互惠。 当金星位于第8宫，你倾向在共享与转化中追求和谐与美感。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "金星在白羊座让审美与关系呈现开创与直接的调性，你在价值交换中偏好行动。 避免因急躁而迁就或过度装饰，明确界限更能互惠。 当金星位于第9宫，你倾向在远行与信念中追求和谐与美感。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "金星在白羊座让审美与关系呈现开创与直接的调性，你在价值交换中偏好行动。 避免因急躁而迁就或过度装饰，明确界限更能互惠。 当金星位于第10宫，你倾向在事业与公众中追求和谐与美感。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "金星在白羊座让审美与关系呈现开创与直接的调性，你在价值交换中偏好行动。 避免因急躁而迁就或过度装饰，明确界限更能互惠。 当金星位于第11宫，你倾向在社群与愿景中追求和谐与美感。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "金星在白羊座让审美与关系呈现开创与直接的调性，你在价值交换中偏好行动。 避免因急躁而迁就或过度装饰，明确界限更能互惠。 当金星位于第12宫，你倾向在潜意识与疗愈中追求和谐与美感。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "金牛座": {
      "1": "金星在金牛座让审美与关系呈现稳健与务实的调性，你在价值交换中偏好耐心。 避免因固执而迁就或过度装饰，明确界限更能互惠。 当金星位于第1宫，你倾向在自我呈现与开端中追求和谐与美感。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "金星在金牛座让审美与关系呈现稳健与务实的调性，你在价值交换中偏好耐心。 避免因固执而迁就或过度装饰，明确界限更能互惠。 当金星位于第2宫，你倾向在资源与价值中追求和谐与美感。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "金星在金牛座让审美与关系呈现稳健与务实的调性，你在价值交换中偏好耐心。 避免因固执而迁就或过度装饰，明确界限更能互惠。 当金星位于第3宫，你倾向在学习与沟通中追求和谐与美感。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "金星在金牛座让审美与关系呈现稳健与务实的调性，你在价值交换中偏好耐心。 避免因固执而迁就或过度装饰，明确界限更能互惠。 当金星位于第4宫，你倾向在家庭与根基中追求和谐与美感。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "金星在金牛座让审美与关系呈现稳健与务实的调性，你在价值交换中偏好耐心。 避免因固执而迁就或过度装饰，明确界限更能互惠。 当金星位于第5宫，你倾向在创造与表达中追求和谐与美感。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "金星在金牛座让审美与关系呈现稳健与务实的调性，你在价值交换中偏好耐心。 避免因固执而迁就或过度装饰，明确界限更能互惠。 当金星位于第6宫，你倾向在日常与健康中追求和谐与美感。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "金星在金牛座让审美与关系呈现稳健与务实的调性，你在价值交换中偏好耐心。 避免因固执而迁就或过度装饰，明确界限更能互惠。 当金星位于第7宫，你倾向在伴侣与合作中追求和谐与美感。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "金星在金牛座让审美与关系呈现稳健与务实的调性，你在价值交换中偏好耐心。 避免因固执而迁就或过度装饰，明确界限更能互惠。 当金星位于第8宫，你倾向在共享与转化中追求和谐与美感。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "金星在金牛座让审美与关系呈现稳健与务实的调性，你在价值交换中偏好耐心。 避免因固执而迁就或过度装饰，明确界限更能互惠。 当金星位于第9宫，你倾向在远行与信念中追求和谐与美感。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "金星在金牛座让审美与关系呈现稳健与务实的调性，你在价值交换中偏好耐心。 避免因固执而迁就或过度装饰，明确界限更能互惠。 当金星位于第10宫，你倾向在事业与公众中追求和谐与美感。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "金星在金牛座让审美与关系呈现稳健与务实的调性，你在价值交换中偏好耐心。 避免因固执而迁就或过度装饰，明确界限更能互惠。 当金星位于第11宫，你倾向在社群与愿景中追求和谐与美感。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "金星在金牛座让审美与关系呈现稳健与务实的调性，你在价值交换中偏好耐心。 避免因固执而迁就或过度装饰，明确界限更能互惠。 当金星位于第12宫，你倾向在潜意识与疗愈中追求和谐与美感。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "双子座": {
      "1": "金星在双子座让审美与关系呈现机敏与好奇的调性，你在价值交换中偏好沟通。 避免因分散而迁就或过度装饰，明确界限更能互惠。 当金星位于第1宫，你倾向在自我呈现与开端中追求和谐与美感。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "金星在双子座让审美与关系呈现机敏与好奇的调性，你在价值交换中偏好沟通。 避免因分散而迁就或过度装饰，明确界限更能互惠。 当金星位于第2宫，你倾向在资源与价值中追求和谐与美感。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "金星在双子座让审美与关系呈现机敏与好奇的调性，你在价值交换中偏好沟通。 避免因分散而迁就或过度装饰，明确界限更能互惠。 当金星位于第3宫，你倾向在学习与沟通中追求和谐与美感。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "金星在双子座让审美与关系呈现机敏与好奇的调性，你在价值交换中偏好沟通。 避免因分散而迁就或过度装饰，明确界限更能互惠。 当金星位于第4宫，你倾向在家庭与根基中追求和谐与美感。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "金星在双子座让审美与关系呈现机敏与好奇的调性，你在价值交换中偏好沟通。 避免因分散而迁就或过度装饰，明确界限更能互惠。 当金星位于第5宫，你倾向在创造与表达中追求和谐与美感。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "金星在双子座让审美与关系呈现机敏与好奇的调性，你在价值交换中偏好沟通。 避免因分散而迁就或过度装饰，明确界限更能互惠。 当金星位于第6宫，你倾向在日常与健康中追求和谐与美感。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "金星在双子座让审美与关系呈现机敏与好奇的调性，你在价值交换中偏好沟通。 避免因分散而迁就或过度装饰，明确界限更能互惠。 当金星位于第7宫，你倾向在伴侣与合作中追求和谐与美感。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "金星在双子座让审美与关系呈现机敏与好奇的调性，你在价值交换中偏好沟通。 避免因分散而迁就或过度装饰，明确界限更能互惠。 当金星位于第8宫，你倾向在共享与转化中追求和谐与美感。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "金星在双子座让审美与关系呈现机敏与好奇的调性，你在价值交换中偏好沟通。 避免因分散而迁就或过度装饰，明确界限更能互惠。 当金星位于第9宫，你倾向在远行与信念中追求和谐与美感。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "金星在双子座让审美与关系呈现机敏与好奇的调性，你在价值交换中偏好沟通。 避免因分散而迁就或过度装饰，明确界限更能互惠。 当金星位于第10宫，你倾向在事业与公众中追求和谐与美感。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "金星在双子座让审美与关系呈现机敏与好奇的调性，你在价值交换中偏好沟通。 避免因分散而迁就或过度装饰，明确界限更能互惠。 当金星位于第11宫，你倾向在社群与愿景中追求和谐与美感。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "金星在双子座让审美与关系呈现机敏与好奇的调性，你在价值交换中偏好沟通。 避免因分散而迁就或过度装饰，明确界限更能互惠。 当金星位于第12宫，你倾向在潜意识与疗愈中追求和谐与美感。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "巨蟹座": {
      "1": "金星在巨蟹座让审美与关系呈现照护与敏感的调性，你在价值交换中偏好归属。 避免因多虑而迁就或过度装饰，明确界限更能互惠。 当金星位于第1宫，你倾向在自我呈现与开端中追求和谐与美感。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "金星在巨蟹座让审美与关系呈现照护与敏感的调性，你在价值交换中偏好归属。 避免因多虑而迁就或过度装饰，明确界限更能互惠。 当金星位于第2宫，你倾向在资源与价值中追求和谐与美感。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "金星在巨蟹座让审美与关系呈现照护与敏感的调性，你在价值交换中偏好归属。 避免因多虑而迁就或过度装饰，明确界限更能互惠。 当金星位于第3宫，你倾向在学习与沟通中追求和谐与美感。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "金星在巨蟹座让审美与关系呈现照护与敏感的调性，你在价值交换中偏好归属。 避免因多虑而迁就或过度装饰，明确界限更能互惠。 当金星位于第4宫，你倾向在家庭与根基中追求和谐与美感。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "金星在巨蟹座让审美与关系呈现照护与敏感的调性，你在价值交换中偏好归属。 避免因多虑而迁就或过度装饰，明确界限更能互惠。 当金星位于第5宫，你倾向在创造与表达中追求和谐与美感。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "金星在巨蟹座让审美与关系呈现照护与敏感的调性，你在价值交换中偏好归属。 避免因多虑而迁就或过度装饰，明确界限更能互惠。 当金星位于第6宫，你倾向在日常与健康中追求和谐与美感。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "金星在巨蟹座让审美与关系呈现照护与敏感的调性，你在价值交换中偏好归属。 避免因多虑而迁就或过度装饰，明确界限更能互惠。 当金星位于第7宫，你倾向在伴侣与合作中追求和谐与美感。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "金星在巨蟹座让审美与关系呈现照护与敏感的调性，你在价值交换中偏好归属。 避免因多虑而迁就或过度装饰，明确界限更能互惠。 当金星位于第8宫，你倾向在共享与转化中追求和谐与美感。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "金星在巨蟹座让审美与关系呈现照护与敏感的调性，你在价值交换中偏好归属。 避免因多虑而迁就或过度装饰，明确界限更能互惠。 当金星位于第9宫，你倾向在远行与信念中追求和谐与美感。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "金星在巨蟹座让审美与关系呈现照护与敏感的调性，你在价值交换中偏好归属。 避免因多虑而迁就或过度装饰，明确界限更能互惠。 当金星位于第10宫，你倾向在事业与公众中追求和谐与美感。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "金星在巨蟹座让审美与关系呈现照护与敏感的调性，你在价值交换中偏好归属。 避免因多虑而迁就或过度装饰，明确界限更能互惠。 当金星位于第11宫，你倾向在社群与愿景中追求和谐与美感。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "金星在巨蟹座让审美与关系呈现照护与敏感的调性，你在价值交换中偏好归属。 避免因多虑而迁就或过度装饰，明确界限更能互惠。 当金星位于第12宫，你倾向在潜意识与疗愈中追求和谐与美感。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "狮子座": {
      "1": "金星在狮子座让审美与关系呈现自信与创造的调性，你在价值交换中偏好表现。 避免因自我中心而迁就或过度装饰，明确界限更能互惠。 当金星位于第1宫，你倾向在自我呈现与开端中追求和谐与美感。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "金星在狮子座让审美与关系呈现自信与创造的调性，你在价值交换中偏好表现。 避免因自我中心而迁就或过度装饰，明确界限更能互惠。 当金星位于第2宫，你倾向在资源与价值中追求和谐与美感。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "金星在狮子座让审美与关系呈现自信与创造的调性，你在价值交换中偏好表现。 避免因自我中心而迁就或过度装饰，明确界限更能互惠。 当金星位于第3宫，你倾向在学习与沟通中追求和谐与美感。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "金星在狮子座让审美与关系呈现自信与创造的调性，你在价值交换中偏好表现。 避免因自我中心而迁就或过度装饰，明确界限更能互惠。 当金星位于第4宫，你倾向在家庭与根基中追求和谐与美感。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "金星在狮子座让审美与关系呈现自信与创造的调性，你在价值交换中偏好表现。 避免因自我中心而迁就或过度装饰，明确界限更能互惠。 当金星位于第5宫，你倾向在创造与表达中追求和谐与美感。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "金星在狮子座让审美与关系呈现自信与创造的调性，你在价值交换中偏好表现。 避免因自我中心而迁就或过度装饰，明确界限更能互惠。 当金星位于第6宫，你倾向在日常与健康中追求和谐与美感。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "金星在狮子座让审美与关系呈现自信与创造的调性，你在价值交换中偏好表现。 避免因自我中心而迁就或过度装饰，明确界限更能互惠。 当金星位于第7宫，你倾向在伴侣与合作中追求和谐与美感。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "金星在狮子座让审美与关系呈现自信与创造的调性，你在价值交换中偏好表现。 避免因自我中心而迁就或过度装饰，明确界限更能互惠。 当金星位于第8宫，你倾向在共享与转化中追求和谐与美感。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "金星在狮子座让审美与关系呈现自信与创造的调性，你在价值交换中偏好表现。 避免因自我中心而迁就或过度装饰，明确界限更能互惠。 当金星位于第9宫，你倾向在远行与信念中追求和谐与美感。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "金星在狮子座让审美与关系呈现自信与创造的调性，你在价值交换中偏好表现。 避免因自我中心而迁就或过度装饰，明确界限更能互惠。 当金星位于第10宫，你倾向在事业与公众中追求和谐与美感。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "金星在狮子座让审美与关系呈现自信与创造的调性，你在价值交换中偏好表现。 避免因自我中心而迁就或过度装饰，明确界限更能互惠。 当金星位于第11宫，你倾向在社群与愿景中追求和谐与美感。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "金星在狮子座让审美与关系呈现自信与创造的调性，你在价值交换中偏好表现。 避免因自我中心而迁就或过度装饰，明确界限更能互惠。 当金星位于第12宫，你倾向在潜意识与疗愈中追求和谐与美感。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "处女座": {
      "1": "金星在处女座让审美与关系呈现细致与分析的调性，你在价值交换中偏好改进。 避免因挑剔而迁就或过度装饰，明确界限更能互惠。 当金星位于第1宫，你倾向在自我呈现与开端中追求和谐与美感。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "金星在处女座让审美与关系呈现细致与分析的调性，你在价值交换中偏好改进。 避免因挑剔而迁就或过度装饰，明确界限更能互惠。 当金星位于第2宫，你倾向在资源与价值中追求和谐与美感。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "金星在处女座让审美与关系呈现细致与分析的调性，你在价值交换中偏好改进。 避免因挑剔而迁就或过度装饰，明确界限更能互惠。 当金星位于第3宫，你倾向在学习与沟通中追求和谐与美感。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "金星在处女座让审美与关系呈现细致与分析的调性，你在价值交换中偏好改进。 避免因挑剔而迁就或过度装饰，明确界限更能互惠。 当金星位于第4宫，你倾向在家庭与根基中追求和谐与美感。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "金星在处女座让审美与关系呈现细致与分析的调性，你在价值交换中偏好改进。 避免因挑剔而迁就或过度装饰，明确界限更能互惠。 当金星位于第5宫，你倾向在创造与表达中追求和谐与美感。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "金星在处女座让审美与关系呈现细致与分析的调性，你在价值交换中偏好改进。 避免因挑剔而迁就或过度装饰，明确界限更能互惠。 当金星位于第6宫，你倾向在日常与健康中追求和谐与美感。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "金星在处女座让审美与关系呈现细致与分析的调性，你在价值交换中偏好改进。 避免因挑剔而迁就或过度装饰，明确界限更能互惠。 当金星位于第7宫，你倾向在伴侣与合作中追求和谐与美感。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "金星在处女座让审美与关系呈现细致与分析的调性，你在价值交换中偏好改进。 避免因挑剔而迁就或过度装饰，明确界限更能互惠。 当金星位于第8宫，你倾向在共享与转化中追求和谐与美感。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "金星在处女座让审美与关系呈现细致与分析的调性，你在价值交换中偏好改进。 避免因挑剔而迁就或过度装饰，明确界限更能互惠。 当金星位于第9宫，你倾向在远行与信念中追求和谐与美感。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "金星在处女座让审美与关系呈现细致与分析的调性，你在价值交换中偏好改进。 避免因挑剔而迁就或过度装饰，明确界限更能互惠。 当金星位于第10宫，你倾向在事业与公众中追求和谐与美感。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "金星在处女座让审美与关系呈现细致与分析的调性，你在价值交换中偏好改进。 避免因挑剔而迁就或过度装饰，明确界限更能互惠。 当金星位于第11宫，你倾向在社群与愿景中追求和谐与美感。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "金星在处女座让审美与关系呈现细致与分析的调性，你在价值交换中偏好改进。 避免因挑剔而迁就或过度装饰，明确界限更能互惠。 当金星位于第12宫，你倾向在潜意识与疗愈中追求和谐与美感。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "天秤座": {
      "1": "金星在天秤座让审美与关系呈现平衡与合作的调性，你在价值交换中偏好审美。 避免因犹豫而迁就或过度装饰，明确界限更能互惠。 当金星位于第1宫，你倾向在自我呈现与开端中追求和谐与美感。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "金星在天秤座让审美与关系呈现平衡与合作的调性，你在价值交换中偏好审美。 避免因犹豫而迁就或过度装饰，明确界限更能互惠。 当金星位于第2宫，你倾向在资源与价值中追求和谐与美感。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "金星在天秤座让审美与关系呈现平衡与合作的调性，你在价值交换中偏好审美。 避免因犹豫而迁就或过度装饰，明确界限更能互惠。 当金星位于第3宫，你倾向在学习与沟通中追求和谐与美感。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "金星在天秤座让审美与关系呈现平衡与合作的调性，你在价值交换中偏好审美。 避免因犹豫而迁就或过度装饰，明确界限更能互惠。 当金星位于第4宫，你倾向在家庭与根基中追求和谐与美感。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "金星在天秤座让审美与关系呈现平衡与合作的调性，你在价值交换中偏好审美。 避免因犹豫而迁就或过度装饰，明确界限更能互惠。 当金星位于第5宫，你倾向在创造与表达中追求和谐与美感。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "金星在天秤座让审美与关系呈现平衡与合作的调性，你在价值交换中偏好审美。 避免因犹豫而迁就或过度装饰，明确界限更能互惠。 当金星位于第6宫，你倾向在日常与健康中追求和谐与美感。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "金星在天秤座让审美与关系呈现平衡与合作的调性，你在价值交换中偏好审美。 避免因犹豫而迁就或过度装饰，明确界限更能互惠。 当金星位于第7宫，你倾向在伴侣与合作中追求和谐与美感。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "金星在天秤座让审美与关系呈现平衡与合作的调性，你在价值交换中偏好审美。 避免因犹豫而迁就或过度装饰，明确界限更能互惠。 当金星位于第8宫，你倾向在共享与转化中追求和谐与美感。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "金星在天秤座让审美与关系呈现平衡与合作的调性，你在价值交换中偏好审美。 避免因犹豫而迁就或过度装饰，明确界限更能互惠。 当金星位于第9宫，你倾向在远行与信念中追求和谐与美感。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "金星在天秤座让审美与关系呈现平衡与合作的调性，你在价值交换中偏好审美。 避免因犹豫而迁就或过度装饰，明确界限更能互惠。 当金星位于第10宫，你倾向在事业与公众中追求和谐与美感。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "金星在天秤座让审美与关系呈现平衡与合作的调性，你在价值交换中偏好审美。 避免因犹豫而迁就或过度装饰，明确界限更能互惠。 当金星位于第11宫，你倾向在社群与愿景中追求和谐与美感。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "金星在天秤座让审美与关系呈现平衡与合作的调性，你在价值交换中偏好审美。 避免因犹豫而迁就或过度装饰，明确界限更能互惠。 当金星位于第12宫，你倾向在潜意识与疗愈中追求和谐与美感。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "天蝎座": {
      "1": "金星在天蝎座让审美与关系呈现深度与洞察的调性，你在价值交换中偏好专注。 避免因控制欲而迁就或过度装饰，明确界限更能互惠。 当金星位于第1宫，你倾向在自我呈现与开端中追求和谐与美感。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "金星在天蝎座让审美与关系呈现深度与洞察的调性，你在价值交换中偏好专注。 避免因控制欲而迁就或过度装饰，明确界限更能互惠。 当金星位于第2宫，你倾向在资源与价值中追求和谐与美感。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "金星在天蝎座让审美与关系呈现深度与洞察的调性，你在价值交换中偏好专注。 避免因控制欲而迁就或过度装饰，明确界限更能互惠。 当金星位于第3宫，你倾向在学习与沟通中追求和谐与美感。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "金星在天蝎座让审美与关系呈现深度与洞察的调性，你在价值交换中偏好专注。 避免因控制欲而迁就或过度装饰，明确界限更能互惠。 当金星位于第4宫，你倾向在家庭与根基中追求和谐与美感。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "金星在天蝎座让审美与关系呈现深度与洞察的调性，你在价值交换中偏好专注。 避免因控制欲而迁就或过度装饰，明确界限更能互惠。 当金星位于第5宫，你倾向在创造与表达中追求和谐与美感。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "金星在天蝎座让审美与关系呈现深度与洞察的调性，你在价值交换中偏好专注。 避免因控制欲而迁就或过度装饰，明确界限更能互惠。 当金星位于第6宫，你倾向在日常与健康中追求和谐与美感。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "金星在天蝎座让审美与关系呈现深度与洞察的调性，你在价值交换中偏好专注。 避免因控制欲而迁就或过度装饰，明确界限更能互惠。 当金星位于第7宫，你倾向在伴侣与合作中追求和谐与美感。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "金星在天蝎座让审美与关系呈现深度与洞察的调性，你在价值交换中偏好专注。 避免因控制欲而迁就或过度装饰，明确界限更能互惠。 当金星位于第8宫，你倾向在共享与转化中追求和谐与美感。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "金星在天蝎座让审美与关系呈现深度与洞察的调性，你在价值交换中偏好专注。 避免因控制欲而迁就或过度装饰，明确界限更能互惠。 当金星位于第9宫，你倾向在远行与信念中追求和谐与美感。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "金星在天蝎座让审美与关系呈现深度与洞察的调性，你在价值交换中偏好专注。 避免因控制欲而迁就或过度装饰，明确界限更能互惠。 当金星位于第10宫，你倾向在事业与公众中追求和谐与美感。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "金星在天蝎座让审美与关系呈现深度与洞察的调性，你在价值交换中偏好专注。 避免因控制欲而迁就或过度装饰，明确界限更能互惠。 当金星位于第11宫，你倾向在社群与愿景中追求和谐与美感。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "金星在天蝎座让审美与关系呈现深度与洞察的调性，你在价值交换中偏好专注。 避免因控制欲而迁就或过度装饰，明确界限更能互惠。 当金星位于第12宫，你倾向在潜意识与疗愈中追求和谐与美感。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "射手座": {
      "1": "金星在射手座让审美与关系呈现探索与远见的调性，你在价值交换中偏好自由。 避免因冒进而迁就或过度装饰，明确界限更能互惠。 当金星位于第1宫，你倾向在自我呈现与开端中追求和谐与美感。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "金星在射手座让审美与关系呈现探索与远见的调性，你在价值交换中偏好自由。 避免因冒进而迁就或过度装饰，明确界限更能互惠。 当金星位于第2宫，你倾向在资源与价值中追求和谐与美感。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "金星在射手座让审美与关系呈现探索与远见的调性，你在价值交换中偏好自由。 避免因冒进而迁就或过度装饰，明确界限更能互惠。 当金星位于第3宫，你倾向在学习与沟通中追求和谐与美感。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "金星在射手座让审美与关系呈现探索与远见的调性，你在价值交换中偏好自由。 避免因冒进而迁就或过度装饰，明确界限更能互惠。 当金星位于第4宫，你倾向在家庭与根基中追求和谐与美感。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "金星在射手座让审美与关系呈现探索与远见的调性，你在价值交换中偏好自由。 避免因冒进而迁就或过度装饰，明确界限更能互惠。 当金星位于第5宫，你倾向在创造与表达中追求和谐与美感。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "金星在射手座让审美与关系呈现探索与远见的调性，你在价值交换中偏好自由。 避免因冒进而迁就或过度装饰，明确界限更能互惠。 当金星位于第6宫，你倾向在日常与健康中追求和谐与美感。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "金星在射手座让审美与关系呈现探索与远见的调性，你在价值交换中偏好自由。 避免因冒进而迁就或过度装饰，明确界限更能互惠。 当金星位于第7宫，你倾向在伴侣与合作中追求和谐与美感。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "金星在射手座让审美与关系呈现探索与远见的调性，你在价值交换中偏好自由。 避免因冒进而迁就或过度装饰，明确界限更能互惠。 当金星位于第8宫，你倾向在共享与转化中追求和谐与美感。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "金星在射手座让审美与关系呈现探索与远见的调性，你在价值交换中偏好自由。 避免因冒进而迁就或过度装饰，明确界限更能互惠。 当金星位于第9宫，你倾向在远行与信念中追求和谐与美感。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "金星在射手座让审美与关系呈现探索与远见的调性，你在价值交换中偏好自由。 避免因冒进而迁就或过度装饰，明确界限更能互惠。 当金星位于第10宫，你倾向在事业与公众中追求和谐与美感。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "金星在射手座让审美与关系呈现探索与远见的调性，你在价值交换中偏好自由。 避免因冒进而迁就或过度装饰，明确界限更能互惠。 当金星位于第11宫，你倾向在社群与愿景中追求和谐与美感。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "金星在射手座让审美与关系呈现探索与远见的调性，你在价值交换中偏好自由。 避免因冒进而迁就或过度装饰，明确界限更能互惠。 当金星位于第12宫，你倾向在潜意识与疗愈中追求和谐与美感。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "摩羯座": {
      "1": "金星在摩羯座让审美与关系呈现纪律与目标的调性，你在价值交换中偏好结构。 避免因保守而迁就或过度装饰，明确界限更能互惠。 当金星位于第1宫，你倾向在自我呈现与开端中追求和谐与美感。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "金星在摩羯座让审美与关系呈现纪律与目标的调性，你在价值交换中偏好结构。 避免因保守而迁就或过度装饰，明确界限更能互惠。 当金星位于第2宫，你倾向在资源与价值中追求和谐与美感。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "金星在摩羯座让审美与关系呈现纪律与目标的调性，你在价值交换中偏好结构。 避免因保守而迁就或过度装饰，明确界限更能互惠。 当金星位于第3宫，你倾向在学习与沟通中追求和谐与美感。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "金星在摩羯座让审美与关系呈现纪律与目标的调性，你在价值交换中偏好结构。 避免因保守而迁就或过度装饰，明确界限更能互惠。 当金星位于第4宫，你倾向在家庭与根基中追求和谐与美感。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "金星在摩羯座让审美与关系呈现纪律与目标的调性，你在价值交换中偏好结构。 避免因保守而迁就或过度装饰，明确界限更能互惠。 当金星位于第5宫，你倾向在创造与表达中追求和谐与美感。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "金星在摩羯座让审美与关系呈现纪律与目标的调性，你在价值交换中偏好结构。 避免因保守而迁就或过度装饰，明确界限更能互惠。 当金星位于第6宫，你倾向在日常与健康中追求和谐与美感。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "金星在摩羯座让审美与关系呈现纪律与目标的调性，你在价值交换中偏好结构。 避免因保守而迁就或过度装饰，明确界限更能互惠。 当金星位于第7宫，你倾向在伴侣与合作中追求和谐与美感。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "金星在摩羯座让审美与关系呈现纪律与目标的调性，你在价值交换中偏好结构。 避免因保守而迁就或过度装饰，明确界限更能互惠。 当金星位于第8宫，你倾向在共享与转化中追求和谐与美感。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "金星在摩羯座让审美与关系呈现纪律与目标的调性，你在价值交换中偏好结构。 避免因保守而迁就或过度装饰，明确界限更能互惠。 当金星位于第9宫，你倾向在远行与信念中追求和谐与美感。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "金星在摩羯座让审美与关系呈现纪律与目标的调性，你在价值交换中偏好结构。 避免因保守而迁就或过度装饰，明确界限更能互惠。 当金星位于第10宫，你倾向在事业与公众中追求和谐与美感。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "金星在摩羯座让审美与关系呈现纪律与目标的调性，你在价值交换中偏好结构。 避免因保守而迁就或过度装饰，明确界限更能互惠。 当金星位于第11宫，你倾向在社群与愿景中追求和谐与美感。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "金星在摩羯座让审美与关系呈现纪律与目标的调性，你在价值交换中偏好结构。 避免因保守而迁就或过度装饰，明确界限更能互惠。 当金星位于第12宫，你倾向在潜意识与疗愈中追求和谐与美感。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "水瓶座": {
      "1": "金星在水瓶座让审美与关系呈现独立与革新的调性，你在价值交换中偏好理性。 避免因疏离而迁就或过度装饰，明确界限更能互惠。 当金星位于第1宫，你倾向在自我呈现与开端中追求和谐与美感。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "金星在水瓶座让审美与关系呈现独立与革新的调性，你在价值交换中偏好理性。 避免因疏离而迁就或过度装饰，明确界限更能互惠。 当金星位于第2宫，你倾向在资源与价值中追求和谐与美感。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "金星在水瓶座让审美与关系呈现独立与革新的调性，你在价值交换中偏好理性。 避免因疏离而迁就或过度装饰，明确界限更能互惠。 当金星位于第3宫，你倾向在学习与沟通中追求和谐与美感。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "金星在水瓶座让审美与关系呈现独立与革新的调性，你在价值交换中偏好理性。 避免因疏离而迁就或过度装饰，明确界限更能互惠。 当金星位于第4宫，你倾向在家庭与根基中追求和谐与美感。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "金星在水瓶座让审美与关系呈现独立与革新的调性，你在价值交换中偏好理性。 避免因疏离而迁就或过度装饰，明确界限更能互惠。 当金星位于第5宫，你倾向在创造与表达中追求和谐与美感。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "金星在水瓶座让审美与关系呈现独立与革新的调性，你在价值交换中偏好理性。 避免因疏离而迁就或过度装饰，明确界限更能互惠。 当金星位于第6宫，你倾向在日常与健康中追求和谐与美感。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "金星在水瓶座让审美与关系呈现独立与革新的调性，你在价值交换中偏好理性。 避免因疏离而迁就或过度装饰，明确界限更能互惠。 当金星位于第7宫，你倾向在伴侣与合作中追求和谐与美感。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "金星在水瓶座让审美与关系呈现独立与革新的调性，你在价值交换中偏好理性。 避免因疏离而迁就或过度装饰，明确界限更能互惠。 当金星位于第8宫，你倾向在共享与转化中追求和谐与美感。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "金星在水瓶座让审美与关系呈现独立与革新的调性，你在价值交换中偏好理性。 避免因疏离而迁就或过度装饰，明确界限更能互惠。 当金星位于第9宫，你倾向在远行与信念中追求和谐与美感。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "金星在水瓶座让审美与关系呈现独立与革新的调性，你在价值交换中偏好理性。 避免因疏离而迁就或过度装饰，明确界限更能互惠。 当金星位于第10宫，你倾向在事业与公众中追求和谐与美感。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "金星在水瓶座让审美与关系呈现独立与革新的调性，你在价值交换中偏好理性。 避免因疏离而迁就或过度装饰，明确界限更能互惠。 当金星位于第11宫，你倾向在社群与愿景中追求和谐与美感。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "金星在水瓶座让审美与关系呈现独立与革新的调性，你在价值交换中偏好理性。 避免因疏离而迁就或过度装饰，明确界限更能互惠。 当金星位于第12宫，你倾向在潜意识与疗愈中追求和谐与美感。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "双鱼座": {
      "1": "金星在双鱼座让审美与关系呈现共情与想象的调性，你在价值交换中偏好融合。 避免因迷离而迁就或过度装饰，明确界限更能互惠。 当金星位于第1宫，你倾向在自我呈现与开端中追求和谐与美感。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "金星在双鱼座让审美与关系呈现共情与想象的调性，你在价值交换中偏好融合。 避免因迷离而迁就或过度装饰，明确界限更能互惠。 当金星位于第2宫，你倾向在资源与价值中追求和谐与美感。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "金星在双鱼座让审美与关系呈现共情与想象的调性，你在价值交换中偏好融合。 避免因迷离而迁就或过度装饰，明确界限更能互惠。 当金星位于第3宫，你倾向在学习与沟通中追求和谐与美感。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "金星在双鱼座让审美与关系呈现共情与想象的调性，你在价值交换中偏好融合。 避免因迷离而迁就或过度装饰，明确界限更能互惠。 当金星位于第4宫，你倾向在家庭与根基中追求和谐与美感。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "金星在双鱼座让审美与关系呈现共情与想象的调性，你在价值交换中偏好融合。 避免因迷离而迁就或过度装饰，明确界限更能互惠。 当金星位于第5宫，你倾向在创造与表达中追求和谐与美感。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "金星在双鱼座让审美与关系呈现共情与想象的调性，你在价值交换中偏好融合。 避免因迷离而迁就或过度装饰，明确界限更能互惠。 当金星位于第6宫，你倾向在日常与健康中追求和谐与美感。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "金星在双鱼座让审美与关系呈现共情与想象的调性，你在价值交换中偏好融合。 避免因迷离而迁就或过度装饰，明确界限更能互惠。 当金星位于第7宫，你倾向在伴侣与合作中追求和谐与美感。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "金星在双鱼座让审美与关系呈现共情与想象的调性，你在价值交换中偏好融合。 避免因迷离而迁就或过度装饰，明确界限更能互惠。 当金星位于第8宫，你倾向在共享与转化中追求和谐与美感。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "金星在双鱼座让审美与关系呈现共情与想象的调性，你在价值交换中偏好融合。 避免因迷离而迁就或过度装饰，明确界限更能互惠。 当金星位于第9宫，你倾向在远行与信念中追求和谐与美感。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "金星在双鱼座让审美与关系呈现共情与想象的调性，你在价值交换中偏好融合。 避免因迷离而迁就或过度装饰，明确界限更能互惠。 当金星位于第10宫，你倾向在事业与公众中追求和谐与美感。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "金星在双鱼座让审美与关系呈现共情与想象的调性，你在价值交换中偏好融合。 避免因迷离而迁就或过度装饰，明确界限更能互惠。 当金星位于第11宫，你倾向在社群与愿景中追求和谐与美感。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "金星在双鱼座让审美与关系呈现共情与想象的调性，你在价值交换中偏好融合。 避免因迷离而迁就或过度装饰，明确界限更能互惠。 当金星位于第12宫，你倾向在潜意识与疗愈中追求和谐与美感。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    }
  },
  "火星": {
    "白羊座": {
      "1": "火星在白羊座赋予行动开创与直接的风格，你常以行动打开局面。 警惕急躁使行动走形，先立规则再发力。 当火星位于第1宫，你会主动推动自我呈现与开端的进展。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "火星在白羊座赋予行动开创与直接的风格，你常以行动打开局面。 警惕急躁使行动走形，先立规则再发力。 当火星位于第2宫，你会主动推动资源与价值的进展。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "火星在白羊座赋予行动开创与直接的风格，你常以行动打开局面。 警惕急躁使行动走形，先立规则再发力。 当火星位于第3宫，你会主动推动学习与沟通的进展。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "火星在白羊座赋予行动开创与直接的风格，你常以行动打开局面。 警惕急躁使行动走形，先立规则再发力。 当火星位于第4宫，你会主动推动家庭与根基的进展。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "火星在白羊座赋予行动开创与直接的风格，你常以行动打开局面。 警惕急躁使行动走形，先立规则再发力。 当火星位于第5宫，你会主动推动创造与表达的进展。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "火星在白羊座赋予行动开创与直接的风格，你常以行动打开局面。 警惕急躁使行动走形，先立规则再发力。 当火星位于第6宫，你会主动推动日常与健康的进展。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "火星在白羊座赋予行动开创与直接的风格，你常以行动打开局面。 警惕急躁使行动走形，先立规则再发力。 当火星位于第7宫，你会主动推动伴侣与合作的进展。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "火星在白羊座赋予行动开创与直接的风格，你常以行动打开局面。 警惕急躁使行动走形，先立规则再发力。 当火星位于第8宫，你会主动推动共享与转化的进展。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "火星在白羊座赋予行动开创与直接的风格，你常以行动打开局面。 警惕急躁使行动走形，先立规则再发力。 当火星位于第9宫，你会主动推动远行与信念的进展。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "火星在白羊座赋予行动开创与直接的风格，你常以行动打开局面。 警惕急躁使行动走形，先立规则再发力。 当火星位于第10宫，你会主动推动事业与公众的进展。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "火星在白羊座赋予行动开创与直接的风格，你常以行动打开局面。 警惕急躁使行动走形，先立规则再发力。 当火星位于第11宫，你会主动推动社群与愿景的进展。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "火星在白羊座赋予行动开创与直接的风格，你常以行动打开局面。 警惕急躁使行动走形，先立规则再发力。 当火星位于第12宫，你会主动推动潜意识与疗愈的进展。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "金牛座": {
      "1": "火星在金牛座赋予行动稳健与务实的风格，你常以耐心打开局面。 警惕固执使行动走形，先立规则再发力。 当火星位于第1宫，你会主动推动自我呈现与开端的进展。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "火星在金牛座赋予行动稳健与务实的风格，你常以耐心打开局面。 警惕固执使行动走形，先立规则再发力。 当火星位于第2宫，你会主动推动资源与价值的进展。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "火星在金牛座赋予行动稳健与务实的风格，你常以耐心打开局面。 警惕固执使行动走形，先立规则再发力。 当火星位于第3宫，你会主动推动学习与沟通的进展。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "火星在金牛座赋予行动稳健与务实的风格，你常以耐心打开局面。 警惕固执使行动走形，先立规则再发力。 当火星位于第4宫，你会主动推动家庭与根基的进展。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "火星在金牛座赋予行动稳健与务实的风格，你常以耐心打开局面。 警惕固执使行动走形，先立规则再发力。 当火星位于第5宫，你会主动推动创造与表达的进展。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "火星在金牛座赋予行动稳健与务实的风格，你常以耐心打开局面。 警惕固执使行动走形，先立规则再发力。 当火星位于第6宫，你会主动推动日常与健康的进展。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "火星在金牛座赋予行动稳健与务实的风格，你常以耐心打开局面。 警惕固执使行动走形，先立规则再发力。 当火星位于第7宫，你会主动推动伴侣与合作的进展。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "火星在金牛座赋予行动稳健与务实的风格，你常以耐心打开局面。 警惕固执使行动走形，先立规则再发力。 当火星位于第8宫，你会主动推动共享与转化的进展。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "火星在金牛座赋予行动稳健与务实的风格，你常以耐心打开局面。 警惕固执使行动走形，先立规则再发力。 当火星位于第9宫，你会主动推动远行与信念的进展。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "火星在金牛座赋予行动稳健与务实的风格，你常以耐心打开局面。 警惕固执使行动走形，先立规则再发力。 当火星位于第10宫，你会主动推动事业与公众的进展。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "火星在金牛座赋予行动稳健与务实的风格，你常以耐心打开局面。 警惕固执使行动走形，先立规则再发力。 当火星位于第11宫，你会主动推动社群与愿景的进展。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "火星在金牛座赋予行动稳健与务实的风格，你常以耐心打开局面。 警惕固执使行动走形，先立规则再发力。 当火星位于第12宫，你会主动推动潜意识与疗愈的进展。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "双子座": {
      "1": "火星在双子座赋予行动机敏与好奇的风格，你常以沟通打开局面。 警惕分散使行动走形，先立规则再发力。 当火星位于第1宫，你会主动推动自我呈现与开端的进展。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "火星在双子座赋予行动机敏与好奇的风格，你常以沟通打开局面。 警惕分散使行动走形，先立规则再发力。 当火星位于第2宫，你会主动推动资源与价值的进展。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "火星在双子座赋予行动机敏与好奇的风格，你常以沟通打开局面。 警惕分散使行动走形，先立规则再发力。 当火星位于第3宫，你会主动推动学习与沟通的进展。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "火星在双子座赋予行动机敏与好奇的风格，你常以沟通打开局面。 警惕分散使行动走形，先立规则再发力。 当火星位于第4宫，你会主动推动家庭与根基的进展。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "火星在双子座赋予行动机敏与好奇的风格，你常以沟通打开局面。 警惕分散使行动走形，先立规则再发力。 当火星位于第5宫，你会主动推动创造与表达的进展。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "火星在双子座赋予行动机敏与好奇的风格，你常以沟通打开局面。 警惕分散使行动走形，先立规则再发力。 当火星位于第6宫，你会主动推动日常与健康的进展。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "火星在双子座赋予行动机敏与好奇的风格，你常以沟通打开局面。 警惕分散使行动走形，先立规则再发力。 当火星位于第7宫，你会主动推动伴侣与合作的进展。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "火星在双子座赋予行动机敏与好奇的风格，你常以沟通打开局面。 警惕分散使行动走形，先立规则再发力。 当火星位于第8宫，你会主动推动共享与转化的进展。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "火星在双子座赋予行动机敏与好奇的风格，你常以沟通打开局面。 警惕分散使行动走形，先立规则再发力。 当火星位于第9宫，你会主动推动远行与信念的进展。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "火星在双子座赋予行动机敏与好奇的风格，你常以沟通打开局面。 警惕分散使行动走形，先立规则再发力。 当火星位于第10宫，你会主动推动事业与公众的进展。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "火星在双子座赋予行动机敏与好奇的风格，你常以沟通打开局面。 警惕分散使行动走形，先立规则再发力。 当火星位于第11宫，你会主动推动社群与愿景的进展。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "火星在双子座赋予行动机敏与好奇的风格，你常以沟通打开局面。 警惕分散使行动走形，先立规则再发力。 当火星位于第12宫，你会主动推动潜意识与疗愈的进展。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "巨蟹座": {
      "1": "火星在巨蟹座赋予行动照护与敏感的风格，你常以归属打开局面。 警惕多虑使行动走形，先立规则再发力。 当火星位于第1宫，你会主动推动自我呈现与开端的进展。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "火星在巨蟹座赋予行动照护与敏感的风格，你常以归属打开局面。 警惕多虑使行动走形，先立规则再发力。 当火星位于第2宫，你会主动推动资源与价值的进展。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "火星在巨蟹座赋予行动照护与敏感的风格，你常以归属打开局面。 警惕多虑使行动走形，先立规则再发力。 当火星位于第3宫，你会主动推动学习与沟通的进展。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "火星在巨蟹座赋予行动照护与敏感的风格，你常以归属打开局面。 警惕多虑使行动走形，先立规则再发力。 当火星位于第4宫，你会主动推动家庭与根基的进展。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "火星在巨蟹座赋予行动照护与敏感的风格，你常以归属打开局面。 警惕多虑使行动走形，先立规则再发力。 当火星位于第5宫，你会主动推动创造与表达的进展。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "火星在巨蟹座赋予行动照护与敏感的风格，你常以归属打开局面。 警惕多虑使行动走形，先立规则再发力。 当火星位于第6宫，你会主动推动日常与健康的进展。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "火星在巨蟹座赋予行动照护与敏感的风格，你常以归属打开局面。 警惕多虑使行动走形，先立规则再发力。 当火星位于第7宫，你会主动推动伴侣与合作的进展。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "火星在巨蟹座赋予行动照护与敏感的风格，你常以归属打开局面。 警惕多虑使行动走形，先立规则再发力。 当火星位于第8宫，你会主动推动共享与转化的进展。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "火星在巨蟹座赋予行动照护与敏感的风格，你常以归属打开局面。 警惕多虑使行动走形，先立规则再发力。 当火星位于第9宫，你会主动推动远行与信念的进展。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "火星在巨蟹座赋予行动照护与敏感的风格，你常以归属打开局面。 警惕多虑使行动走形，先立规则再发力。 当火星位于第10宫，你会主动推动事业与公众的进展。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "火星在巨蟹座赋予行动照护与敏感的风格，你常以归属打开局面。 警惕多虑使行动走形，先立规则再发力。 当火星位于第11宫，你会主动推动社群与愿景的进展。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "火星在巨蟹座赋予行动照护与敏感的风格，你常以归属打开局面。 警惕多虑使行动走形，先立规则再发力。 当火星位于第12宫，你会主动推动潜意识与疗愈的进展。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "狮子座": {
      "1": "火星在狮子座赋予行动自信与创造的风格，你常以表现打开局面。 警惕自我中心使行动走形，先立规则再发力。 当火星位于第1宫，你会主动推动自我呈现与开端的进展。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "火星在狮子座赋予行动自信与创造的风格，你常以表现打开局面。 警惕自我中心使行动走形，先立规则再发力。 当火星位于第2宫，你会主动推动资源与价值的进展。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "火星在狮子座赋予行动自信与创造的风格，你常以表现打开局面。 警惕自我中心使行动走形，先立规则再发力。 当火星位于第3宫，你会主动推动学习与沟通的进展。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "火星在狮子座赋予行动自信与创造的风格，你常以表现打开局面。 警惕自我中心使行动走形，先立规则再发力。 当火星位于第4宫，你会主动推动家庭与根基的进展。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "火星在狮子座赋予行动自信与创造的风格，你常以表现打开局面。 警惕自我中心使行动走形，先立规则再发力。 当火星位于第5宫，你会主动推动创造与表达的进展。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "火星在狮子座赋予行动自信与创造的风格，你常以表现打开局面。 警惕自我中心使行动走形，先立规则再发力。 当火星位于第6宫，你会主动推动日常与健康的进展。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "火星在狮子座赋予行动自信与创造的风格，你常以表现打开局面。 警惕自我中心使行动走形，先立规则再发力。 当火星位于第7宫，你会主动推动伴侣与合作的进展。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "火星在狮子座赋予行动自信与创造的风格，你常以表现打开局面。 警惕自我中心使行动走形，先立规则再发力。 当火星位于第8宫，你会主动推动共享与转化的进展。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "火星在狮子座赋予行动自信与创造的风格，你常以表现打开局面。 警惕自我中心使行动走形，先立规则再发力。 当火星位于第9宫，你会主动推动远行与信念的进展。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "火星在狮子座赋予行动自信与创造的风格，你常以表现打开局面。 警惕自我中心使行动走形，先立规则再发力。 当火星位于第10宫，你会主动推动事业与公众的进展。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "火星在狮子座赋予行动自信与创造的风格，你常以表现打开局面。 警惕自我中心使行动走形，先立规则再发力。 当火星位于第11宫，你会主动推动社群与愿景的进展。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "火星在狮子座赋予行动自信与创造的风格，你常以表现打开局面。 警惕自我中心使行动走形，先立规则再发力。 当火星位于第12宫，你会主动推动潜意识与疗愈的进展。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "处女座": {
      "1": "火星在处女座赋予行动细致与分析的风格，你常以改进打开局面。 警惕挑剔使行动走形，先立规则再发力。 当火星位于第1宫，你会主动推动自我呈现与开端的进展。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "火星在处女座赋予行动细致与分析的风格，你常以改进打开局面。 警惕挑剔使行动走形，先立规则再发力。 当火星位于第2宫，你会主动推动资源与价值的进展。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "火星在处女座赋予行动细致与分析的风格，你常以改进打开局面。 警惕挑剔使行动走形，先立规则再发力。 当火星位于第3宫，你会主动推动学习与沟通的进展。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "火星在处女座赋予行动细致与分析的风格，你常以改进打开局面。 警惕挑剔使行动走形，先立规则再发力。 当火星位于第4宫，你会主动推动家庭与根基的进展。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "火星在处女座赋予行动细致与分析的风格，你常以改进打开局面。 警惕挑剔使行动走形，先立规则再发力。 当火星位于第5宫，你会主动推动创造与表达的进展。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "火星在处女座赋予行动细致与分析的风格，你常以改进打开局面。 警惕挑剔使行动走形，先立规则再发力。 当火星位于第6宫，你会主动推动日常与健康的进展。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "火星在处女座赋予行动细致与分析的风格，你常以改进打开局面。 警惕挑剔使行动走形，先立规则再发力。 当火星位于第7宫，你会主动推动伴侣与合作的进展。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "火星在处女座赋予行动细致与分析的风格，你常以改进打开局面。 警惕挑剔使行动走形，先立规则再发力。 当火星位于第8宫，你会主动推动共享与转化的进展。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "火星在处女座赋予行动细致与分析的风格，你常以改进打开局面。 警惕挑剔使行动走形，先立规则再发力。 当火星位于第9宫，你会主动推动远行与信念的进展。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "火星在处女座赋予行动细致与分析的风格，你常以改进打开局面。 警惕挑剔使行动走形，先立规则再发力。 当火星位于第10宫，你会主动推动事业与公众的进展。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "火星在处女座赋予行动细致与分析的风格，你常以改进打开局面。 警惕挑剔使行动走形，先立规则再发力。 当火星位于第11宫，你会主动推动社群与愿景的进展。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "火星在处女座赋予行动细致与分析的风格，你常以改进打开局面。 警惕挑剔使行动走形，先立规则再发力。 当火星位于第12宫，你会主动推动潜意识与疗愈的进展。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "天秤座": {
      "1": "火星在天秤座赋予行动平衡与合作的风格，你常以审美打开局面。 警惕犹豫使行动走形，先立规则再发力。 当火星位于第1宫，你会主动推动自我呈现与开端的进展。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "火星在天秤座赋予行动平衡与合作的风格，你常以审美打开局面。 警惕犹豫使行动走形，先立规则再发力。 当火星位于第2宫，你会主动推动资源与价值的进展。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "火星在天秤座赋予行动平衡与合作的风格，你常以审美打开局面。 警惕犹豫使行动走形，先立规则再发力。 当火星位于第3宫，你会主动推动学习与沟通的进展。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "火星在天秤座赋予行动平衡与合作的风格，你常以审美打开局面。 警惕犹豫使行动走形，先立规则再发力。 当火星位于第4宫，你会主动推动家庭与根基的进展。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "火星在天秤座赋予行动平衡与合作的风格，你常以审美打开局面。 警惕犹豫使行动走形，先立规则再发力。 当火星位于第5宫，你会主动推动创造与表达的进展。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "火星在天秤座赋予行动平衡与合作的风格，你常以审美打开局面。 警惕犹豫使行动走形，先立规则再发力。 当火星位于第6宫，你会主动推动日常与健康的进展。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "火星在天秤座赋予行动平衡与合作的风格，你常以审美打开局面。 警惕犹豫使行动走形，先立规则再发力。 当火星位于第7宫，你会主动推动伴侣与合作的进展。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "火星在天秤座赋予行动平衡与合作的风格，你常以审美打开局面。 警惕犹豫使行动走形，先立规则再发力。 当火星位于第8宫，你会主动推动共享与转化的进展。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "火星在天秤座赋予行动平衡与合作的风格，你常以审美打开局面。 警惕犹豫使行动走形，先立规则再发力。 当火星位于第9宫，你会主动推动远行与信念的进展。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "火星在天秤座赋予行动平衡与合作的风格，你常以审美打开局面。 警惕犹豫使行动走形，先立规则再发力。 当火星位于第10宫，你会主动推动事业与公众的进展。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "火星在天秤座赋予行动平衡与合作的风格，你常以审美打开局面。 警惕犹豫使行动走形，先立规则再发力。 当火星位于第11宫，你会主动推动社群与愿景的进展。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "火星在天秤座赋予行动平衡与合作的风格，你常以审美打开局面。 警惕犹豫使行动走形，先立规则再发力。 当火星位于第12宫，你会主动推动潜意识与疗愈的进展。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "天蝎座": {
      "1": "火星在天蝎座赋予行动深度与洞察的风格，你常以专注打开局面。 警惕控制欲使行动走形，先立规则再发力。 当火星位于第1宫，你会主动推动自我呈现与开端的进展。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "火星在天蝎座赋予行动深度与洞察的风格，你常以专注打开局面。 警惕控制欲使行动走形，先立规则再发力。 当火星位于第2宫，你会主动推动资源与价值的进展。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "火星在天蝎座赋予行动深度与洞察的风格，你常以专注打开局面。 警惕控制欲使行动走形，先立规则再发力。 当火星位于第3宫，你会主动推动学习与沟通的进展。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "火星在天蝎座赋予行动深度与洞察的风格，你常以专注打开局面。 警惕控制欲使行动走形，先立规则再发力。 当火星位于第4宫，你会主动推动家庭与根基的进展。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "火星在天蝎座赋予行动深度与洞察的风格，你常以专注打开局面。 警惕控制欲使行动走形，先立规则再发力。 当火星位于第5宫，你会主动推动创造与表达的进展。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "火星在天蝎座赋予行动深度与洞察的风格，你常以专注打开局面。 警惕控制欲使行动走形，先立规则再发力。 当火星位于第6宫，你会主动推动日常与健康的进展。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "火星在天蝎座赋予行动深度与洞察的风格，你常以专注打开局面。 警惕控制欲使行动走形，先立规则再发力。 当火星位于第7宫，你会主动推动伴侣与合作的进展。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "火星在天蝎座赋予行动深度与洞察的风格，你常以专注打开局面。 警惕控制欲使行动走形，先立规则再发力。 当火星位于第8宫，你会主动推动共享与转化的进展。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "火星在天蝎座赋予行动深度与洞察的风格，你常以专注打开局面。 警惕控制欲使行动走形，先立规则再发力。 当火星位于第9宫，你会主动推动远行与信念的进展。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "火星在天蝎座赋予行动深度与洞察的风格，你常以专注打开局面。 警惕控制欲使行动走形，先立规则再发力。 当火星位于第10宫，你会主动推动事业与公众的进展。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "火星在天蝎座赋予行动深度与洞察的风格，你常以专注打开局面。 警惕控制欲使行动走形，先立规则再发力。 当火星位于第11宫，你会主动推动社群与愿景的进展。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "火星在天蝎座赋予行动深度与洞察的风格，你常以专注打开局面。 警惕控制欲使行动走形，先立规则再发力。 当火星位于第12宫，你会主动推动潜意识与疗愈的进展。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "射手座": {
      "1": "火星在射手座赋予行动探索与远见的风格，你常以自由打开局面。 警惕冒进使行动走形，先立规则再发力。 当火星位于第1宫，你会主动推动自我呈现与开端的进展。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "火星在射手座赋予行动探索与远见的风格，你常以自由打开局面。 警惕冒进使行动走形，先立规则再发力。 当火星位于第2宫，你会主动推动资源与价值的进展。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "火星在射手座赋予行动探索与远见的风格，你常以自由打开局面。 警惕冒进使行动走形，先立规则再发力。 当火星位于第3宫，你会主动推动学习与沟通的进展。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "火星在射手座赋予行动探索与远见的风格，你常以自由打开局面。 警惕冒进使行动走形，先立规则再发力。 当火星位于第4宫，你会主动推动家庭与根基的进展。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "火星在射手座赋予行动探索与远见的风格，你常以自由打开局面。 警惕冒进使行动走形，先立规则再发力。 当火星位于第5宫，你会主动推动创造与表达的进展。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "火星在射手座赋予行动探索与远见的风格，你常以自由打开局面。 警惕冒进使行动走形，先立规则再发力。 当火星位于第6宫，你会主动推动日常与健康的进展。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "火星在射手座赋予行动探索与远见的风格，你常以自由打开局面。 警惕冒进使行动走形，先立规则再发力。 当火星位于第7宫，你会主动推动伴侣与合作的进展。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "火星在射手座赋予行动探索与远见的风格，你常以自由打开局面。 警惕冒进使行动走形，先立规则再发力。 当火星位于第8宫，你会主动推动共享与转化的进展。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "火星在射手座赋予行动探索与远见的风格，你常以自由打开局面。 警惕冒进使行动走形，先立规则再发力。 当火星位于第9宫，你会主动推动远行与信念的进展。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "火星在射手座赋予行动探索与远见的风格，你常以自由打开局面。 警惕冒进使行动走形，先立规则再发力。 当火星位于第10宫，你会主动推动事业与公众的进展。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "火星在射手座赋予行动探索与远见的风格，你常以自由打开局面。 警惕冒进使行动走形，先立规则再发力。 当火星位于第11宫，你会主动推动社群与愿景的进展。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "火星在射手座赋予行动探索与远见的风格，你常以自由打开局面。 警惕冒进使行动走形，先立规则再发力。 当火星位于第12宫，你会主动推动潜意识与疗愈的进展。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "摩羯座": {
      "1": "火星在摩羯座赋予行动纪律与目标的风格，你常以结构打开局面。 警惕保守使行动走形，先立规则再发力。 当火星位于第1宫，你会主动推动自我呈现与开端的进展。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "火星在摩羯座赋予行动纪律与目标的风格，你常以结构打开局面。 警惕保守使行动走形，先立规则再发力。 当火星位于第2宫，你会主动推动资源与价值的进展。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "火星在摩羯座赋予行动纪律与目标的风格，你常以结构打开局面。 警惕保守使行动走形，先立规则再发力。 当火星位于第3宫，你会主动推动学习与沟通的进展。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "火星在摩羯座赋予行动纪律与目标的风格，你常以结构打开局面。 警惕保守使行动走形，先立规则再发力。 当火星位于第4宫，你会主动推动家庭与根基的进展。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "火星在摩羯座赋予行动纪律与目标的风格，你常以结构打开局面。 警惕保守使行动走形，先立规则再发力。 当火星位于第5宫，你会主动推动创造与表达的进展。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "火星在摩羯座赋予行动纪律与目标的风格，你常以结构打开局面。 警惕保守使行动走形，先立规则再发力。 当火星位于第6宫，你会主动推动日常与健康的进展。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "火星在摩羯座赋予行动纪律与目标的风格，你常以结构打开局面。 警惕保守使行动走形，先立规则再发力。 当火星位于第7宫，你会主动推动伴侣与合作的进展。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "火星在摩羯座赋予行动纪律与目标的风格，你常以结构打开局面。 警惕保守使行动走形，先立规则再发力。 当火星位于第8宫，你会主动推动共享与转化的进展。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "火星在摩羯座赋予行动纪律与目标的风格，你常以结构打开局面。 警惕保守使行动走形，先立规则再发力。 当火星位于第9宫，你会主动推动远行与信念的进展。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "火星在摩羯座赋予行动纪律与目标的风格，你常以结构打开局面。 警惕保守使行动走形，先立规则再发力。 当火星位于第10宫，你会主动推动事业与公众的进展。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "火星在摩羯座赋予行动纪律与目标的风格，你常以结构打开局面。 警惕保守使行动走形，先立规则再发力。 当火星位于第11宫，你会主动推动社群与愿景的进展。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "火星在摩羯座赋予行动纪律与目标的风格，你常以结构打开局面。 警惕保守使行动走形，先立规则再发力。 当火星位于第12宫，你会主动推动潜意识与疗愈的进展。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "水瓶座": {
      "1": "火星在水瓶座赋予行动独立与革新的风格，你常以理性打开局面。 警惕疏离使行动走形，先立规则再发力。 当火星位于第1宫，你会主动推动自我呈现与开端的进展。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "火星在水瓶座赋予行动独立与革新的风格，你常以理性打开局面。 警惕疏离使行动走形，先立规则再发力。 当火星位于第2宫，你会主动推动资源与价值的进展。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "火星在水瓶座赋予行动独立与革新的风格，你常以理性打开局面。 警惕疏离使行动走形，先立规则再发力。 当火星位于第3宫，你会主动推动学习与沟通的进展。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "火星在水瓶座赋予行动独立与革新的风格，你常以理性打开局面。 警惕疏离使行动走形，先立规则再发力。 当火星位于第4宫，你会主动推动家庭与根基的进展。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "火星在水瓶座赋予行动独立与革新的风格，你常以理性打开局面。 警惕疏离使行动走形，先立规则再发力。 当火星位于第5宫，你会主动推动创造与表达的进展。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "火星在水瓶座赋予行动独立与革新的风格，你常以理性打开局面。 警惕疏离使行动走形，先立规则再发力。 当火星位于第6宫，你会主动推动日常与健康的进展。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "火星在水瓶座赋予行动独立与革新的风格，你常以理性打开局面。 警惕疏离使行动走形，先立规则再发力。 当火星位于第7宫，你会主动推动伴侣与合作的进展。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "火星在水瓶座赋予行动独立与革新的风格，你常以理性打开局面。 警惕疏离使行动走形，先立规则再发力。 当火星位于第8宫，你会主动推动共享与转化的进展。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "火星在水瓶座赋予行动独立与革新的风格，你常以理性打开局面。 警惕疏离使行动走形，先立规则再发力。 当火星位于第9宫，你会主动推动远行与信念的进展。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "火星在水瓶座赋予行动独立与革新的风格，你常以理性打开局面。 警惕疏离使行动走形，先立规则再发力。 当火星位于第10宫，你会主动推动事业与公众的进展。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "火星在水瓶座赋予行动独立与革新的风格，你常以理性打开局面。 警惕疏离使行动走形，先立规则再发力。 当火星位于第11宫，你会主动推动社群与愿景的进展。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "火星在水瓶座赋予行动独立与革新的风格，你常以理性打开局面。 警惕疏离使行动走形，先立规则再发力。 当火星位于第12宫，你会主动推动潜意识与疗愈的进展。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "双鱼座": {
      "1": "火星在双鱼座赋予行动共情与想象的风格，你常以融合打开局面。 警惕迷离使行动走形，先立规则再发力。 当火星位于第1宫，你会主动推动自我呈现与开端的进展。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "火星在双鱼座赋予行动共情与想象的风格，你常以融合打开局面。 警惕迷离使行动走形，先立规则再发力。 当火星位于第2宫，你会主动推动资源与价值的进展。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "火星在双鱼座赋予行动共情与想象的风格，你常以融合打开局面。 警惕迷离使行动走形，先立规则再发力。 当火星位于第3宫，你会主动推动学习与沟通的进展。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "火星在双鱼座赋予行动共情与想象的风格，你常以融合打开局面。 警惕迷离使行动走形，先立规则再发力。 当火星位于第4宫，你会主动推动家庭与根基的进展。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "火星在双鱼座赋予行动共情与想象的风格，你常以融合打开局面。 警惕迷离使行动走形，先立规则再发力。 当火星位于第5宫，你会主动推动创造与表达的进展。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "火星在双鱼座赋予行动共情与想象的风格，你常以融合打开局面。 警惕迷离使行动走形，先立规则再发力。 当火星位于第6宫，你会主动推动日常与健康的进展。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "火星在双鱼座赋予行动共情与想象的风格，你常以融合打开局面。 警惕迷离使行动走形，先立规则再发力。 当火星位于第7宫，你会主动推动伴侣与合作的进展。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "火星在双鱼座赋予行动共情与想象的风格，你常以融合打开局面。 警惕迷离使行动走形，先立规则再发力。 当火星位于第8宫，你会主动推动共享与转化的进展。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "火星在双鱼座赋予行动共情与想象的风格，你常以融合打开局面。 警惕迷离使行动走形，先立规则再发力。 当火星位于第9宫，你会主动推动远行与信念的进展。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "火星在双鱼座赋予行动共情与想象的风格，你常以融合打开局面。 警惕迷离使行动走形，先立规则再发力。 当火星位于第10宫，你会主动推动事业与公众的进展。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "火星在双鱼座赋予行动共情与想象的风格，你常以融合打开局面。 警惕迷离使行动走形，先立规则再发力。 当火星位于第11宫，你会主动推动社群与愿景的进展。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "火星在双鱼座赋予行动共情与想象的风格，你常以融合打开局面。 警惕迷离使行动走形，先立规则再发力。 当火星位于第12宫，你会主动推动潜意识与疗愈的进展。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    }
  },
  "木星": {
    "白羊座": {
      "1": "木星在白羊座放大开创与直接的成长路径，机会常来自行动。 当心急躁造成过度乐观，设定检核点控制尺度。 当木星位于第1宫，自我呈现与开端领域常伴随贵人与机遇。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "木星在白羊座放大开创与直接的成长路径，机会常来自行动。 当心急躁造成过度乐观，设定检核点控制尺度。 当木星位于第2宫，资源与价值领域常伴随贵人与机遇。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "木星在白羊座放大开创与直接的成长路径，机会常来自行动。 当心急躁造成过度乐观，设定检核点控制尺度。 当木星位于第3宫，学习与沟通领域常伴随贵人与机遇。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "木星在白羊座放大开创与直接的成长路径，机会常来自行动。 当心急躁造成过度乐观，设定检核点控制尺度。 当木星位于第4宫，家庭与根基领域常伴随贵人与机遇。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "木星在白羊座放大开创与直接的成长路径，机会常来自行动。 当心急躁造成过度乐观，设定检核点控制尺度。 当木星位于第5宫，创造与表达领域常伴随贵人与机遇。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "木星在白羊座放大开创与直接的成长路径，机会常来自行动。 当心急躁造成过度乐观，设定检核点控制尺度。 当木星位于第6宫，日常与健康领域常伴随贵人与机遇。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "木星在白羊座放大开创与直接的成长路径，机会常来自行动。 当心急躁造成过度乐观，设定检核点控制尺度。 当木星位于第7宫，伴侣与合作领域常伴随贵人与机遇。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "木星在白羊座放大开创与直接的成长路径，机会常来自行动。 当心急躁造成过度乐观，设定检核点控制尺度。 当木星位于第8宫，共享与转化领域常伴随贵人与机遇。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "木星在白羊座放大开创与直接的成长路径，机会常来自行动。 当心急躁造成过度乐观，设定检核点控制尺度。 当木星位于第9宫，远行与信念领域常伴随贵人与机遇。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "木星在白羊座放大开创与直接的成长路径，机会常来自行动。 当心急躁造成过度乐观，设定检核点控制尺度。 当木星位于第10宫，事业与公众领域常伴随贵人与机遇。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "木星在白羊座放大开创与直接的成长路径，机会常来自行动。 当心急躁造成过度乐观，设定检核点控制尺度。 当木星位于第11宫，社群与愿景领域常伴随贵人与机遇。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "木星在白羊座放大开创与直接的成长路径，机会常来自行动。 当心急躁造成过度乐观，设定检核点控制尺度。 当木星位于第12宫，潜意识与疗愈领域常伴随贵人与机遇。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "金牛座": {
      "1": "木星在金牛座放大稳健与务实的成长路径，机会常来自耐心。 当心固执造成过度乐观，设定检核点控制尺度。 当木星位于第1宫，自我呈现与开端领域常伴随贵人与机遇。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "木星在金牛座放大稳健与务实的成长路径，机会常来自耐心。 当心固执造成过度乐观，设定检核点控制尺度。 当木星位于第2宫，资源与价值领域常伴随贵人与机遇。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "木星在金牛座放大稳健与务实的成长路径，机会常来自耐心。 当心固执造成过度乐观，设定检核点控制尺度。 当木星位于第3宫，学习与沟通领域常伴随贵人与机遇。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "木星在金牛座放大稳健与务实的成长路径，机会常来自耐心。 当心固执造成过度乐观，设定检核点控制尺度。 当木星位于第4宫，家庭与根基领域常伴随贵人与机遇。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "木星在金牛座放大稳健与务实的成长路径，机会常来自耐心。 当心固执造成过度乐观，设定检核点控制尺度。 当木星位于第5宫，创造与表达领域常伴随贵人与机遇。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "木星在金牛座放大稳健与务实的成长路径，机会常来自耐心。 当心固执造成过度乐观，设定检核点控制尺度。 当木星位于第6宫，日常与健康领域常伴随贵人与机遇。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "木星在金牛座放大稳健与务实的成长路径，机会常来自耐心。 当心固执造成过度乐观，设定检核点控制尺度。 当木星位于第7宫，伴侣与合作领域常伴随贵人与机遇。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "木星在金牛座放大稳健与务实的成长路径，机会常来自耐心。 当心固执造成过度乐观，设定检核点控制尺度。 当木星位于第8宫，共享与转化领域常伴随贵人与机遇。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "木星在金牛座放大稳健与务实的成长路径，机会常来自耐心。 当心固执造成过度乐观，设定检核点控制尺度。 当木星位于第9宫，远行与信念领域常伴随贵人与机遇。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "木星在金牛座放大稳健与务实的成长路径，机会常来自耐心。 当心固执造成过度乐观，设定检核点控制尺度。 当木星位于第10宫，事业与公众领域常伴随贵人与机遇。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "木星在金牛座放大稳健与务实的成长路径，机会常来自耐心。 当心固执造成过度乐观，设定检核点控制尺度。 当木星位于第11宫，社群与愿景领域常伴随贵人与机遇。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "木星在金牛座放大稳健与务实的成长路径，机会常来自耐心。 当心固执造成过度乐观，设定检核点控制尺度。 当木星位于第12宫，潜意识与疗愈领域常伴随贵人与机遇。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "双子座": {
      "1": "木星在双子座放大机敏与好奇的成长路径，机会常来自沟通。 当心分散造成过度乐观，设定检核点控制尺度。 当木星位于第1宫，自我呈现与开端领域常伴随贵人与机遇。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "木星在双子座放大机敏与好奇的成长路径，机会常来自沟通。 当心分散造成过度乐观，设定检核点控制尺度。 当木星位于第2宫，资源与价值领域常伴随贵人与机遇。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "木星在双子座放大机敏与好奇的成长路径，机会常来自沟通。 当心分散造成过度乐观，设定检核点控制尺度。 当木星位于第3宫，学习与沟通领域常伴随贵人与机遇。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "木星在双子座放大机敏与好奇的成长路径，机会常来自沟通。 当心分散造成过度乐观，设定检核点控制尺度。 当木星位于第4宫，家庭与根基领域常伴随贵人与机遇。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "木星在双子座放大机敏与好奇的成长路径，机会常来自沟通。 当心分散造成过度乐观，设定检核点控制尺度。 当木星位于第5宫，创造与表达领域常伴随贵人与机遇。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "木星在双子座放大机敏与好奇的成长路径，机会常来自沟通。 当心分散造成过度乐观，设定检核点控制尺度。 当木星位于第6宫，日常与健康领域常伴随贵人与机遇。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "木星在双子座放大机敏与好奇的成长路径，机会常来自沟通。 当心分散造成过度乐观，设定检核点控制尺度。 当木星位于第7宫，伴侣与合作领域常伴随贵人与机遇。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "木星在双子座放大机敏与好奇的成长路径，机会常来自沟通。 当心分散造成过度乐观，设定检核点控制尺度。 当木星位于第8宫，共享与转化领域常伴随贵人与机遇。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "木星在双子座放大机敏与好奇的成长路径，机会常来自沟通。 当心分散造成过度乐观，设定检核点控制尺度。 当木星位于第9宫，远行与信念领域常伴随贵人与机遇。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "木星在双子座放大机敏与好奇的成长路径，机会常来自沟通。 当心分散造成过度乐观，设定检核点控制尺度。 当木星位于第10宫，事业与公众领域常伴随贵人与机遇。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "木星在双子座放大机敏与好奇的成长路径，机会常来自沟通。 当心分散造成过度乐观，设定检核点控制尺度。 当木星位于第11宫，社群与愿景领域常伴随贵人与机遇。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "木星在双子座放大机敏与好奇的成长路径，机会常来自沟通。 当心分散造成过度乐观，设定检核点控制尺度。 当木星位于第12宫，潜意识与疗愈领域常伴随贵人与机遇。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "巨蟹座": {
      "1": "木星在巨蟹座放大照护与敏感的成长路径，机会常来自归属。 当心多虑造成过度乐观，设定检核点控制尺度。 当木星位于第1宫，自我呈现与开端领域常伴随贵人与机遇。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "木星在巨蟹座放大照护与敏感的成长路径，机会常来自归属。 当心多虑造成过度乐观，设定检核点控制尺度。 当木星位于第2宫，资源与价值领域常伴随贵人与机遇。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "木星在巨蟹座放大照护与敏感的成长路径，机会常来自归属。 当心多虑造成过度乐观，设定检核点控制尺度。 当木星位于第3宫，学习与沟通领域常伴随贵人与机遇。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "木星在巨蟹座放大照护与敏感的成长路径，机会常来自归属。 当心多虑造成过度乐观，设定检核点控制尺度。 当木星位于第4宫，家庭与根基领域常伴随贵人与机遇。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "木星在巨蟹座放大照护与敏感的成长路径，机会常来自归属。 当心多虑造成过度乐观，设定检核点控制尺度。 当木星位于第5宫，创造与表达领域常伴随贵人与机遇。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "木星在巨蟹座放大照护与敏感的成长路径，机会常来自归属。 当心多虑造成过度乐观，设定检核点控制尺度。 当木星位于第6宫，日常与健康领域常伴随贵人与机遇。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "木星在巨蟹座放大照护与敏感的成长路径，机会常来自归属。 当心多虑造成过度乐观，设定检核点控制尺度。 当木星位于第7宫，伴侣与合作领域常伴随贵人与机遇。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "木星在巨蟹座放大照护与敏感的成长路径，机会常来自归属。 当心多虑造成过度乐观，设定检核点控制尺度。 当木星位于第8宫，共享与转化领域常伴随贵人与机遇。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "木星在巨蟹座放大照护与敏感的成长路径，机会常来自归属。 当心多虑造成过度乐观，设定检核点控制尺度。 当木星位于第9宫，远行与信念领域常伴随贵人与机遇。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "木星在巨蟹座放大照护与敏感的成长路径，机会常来自归属。 当心多虑造成过度乐观，设定检核点控制尺度。 当木星位于第10宫，事业与公众领域常伴随贵人与机遇。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "木星在巨蟹座放大照护与敏感的成长路径，机会常来自归属。 当心多虑造成过度乐观，设定检核点控制尺度。 当木星位于第11宫，社群与愿景领域常伴随贵人与机遇。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "木星在巨蟹座放大照护与敏感的成长路径，机会常来自归属。 当心多虑造成过度乐观，设定检核点控制尺度。 当木星位于第12宫，潜意识与疗愈领域常伴随贵人与机遇。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "狮子座": {
      "1": "木星在狮子座放大自信与创造的成长路径，机会常来自表现。 当心自我中心造成过度乐观，设定检核点控制尺度。 当木星位于第1宫，自我呈现与开端领域常伴随贵人与机遇。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "木星在狮子座放大自信与创造的成长路径，机会常来自表现。 当心自我中心造成过度乐观，设定检核点控制尺度。 当木星位于第2宫，资源与价值领域常伴随贵人与机遇。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "木星在狮子座放大自信与创造的成长路径，机会常来自表现。 当心自我中心造成过度乐观，设定检核点控制尺度。 当木星位于第3宫，学习与沟通领域常伴随贵人与机遇。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "木星在狮子座放大自信与创造的成长路径，机会常来自表现。 当心自我中心造成过度乐观，设定检核点控制尺度。 当木星位于第4宫，家庭与根基领域常伴随贵人与机遇。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "木星在狮子座放大自信与创造的成长路径，机会常来自表现。 当心自我中心造成过度乐观，设定检核点控制尺度。 当木星位于第5宫，创造与表达领域常伴随贵人与机遇。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "木星在狮子座放大自信与创造的成长路径，机会常来自表现。 当心自我中心造成过度乐观，设定检核点控制尺度。 当木星位于第6宫，日常与健康领域常伴随贵人与机遇。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "木星在狮子座放大自信与创造的成长路径，机会常来自表现。 当心自我中心造成过度乐观，设定检核点控制尺度。 当木星位于第7宫，伴侣与合作领域常伴随贵人与机遇。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "木星在狮子座放大自信与创造的成长路径，机会常来自表现。 当心自我中心造成过度乐观，设定检核点控制尺度。 当木星位于第8宫，共享与转化领域常伴随贵人与机遇。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "木星在狮子座放大自信与创造的成长路径，机会常来自表现。 当心自我中心造成过度乐观，设定检核点控制尺度。 当木星位于第9宫，远行与信念领域常伴随贵人与机遇。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "木星在狮子座放大自信与创造的成长路径，机会常来自表现。 当心自我中心造成过度乐观，设定检核点控制尺度。 当木星位于第10宫，事业与公众领域常伴随贵人与机遇。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "木星在狮子座放大自信与创造的成长路径，机会常来自表现。 当心自我中心造成过度乐观，设定检核点控制尺度。 当木星位于第11宫，社群与愿景领域常伴随贵人与机遇。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "木星在狮子座放大自信与创造的成长路径，机会常来自表现。 当心自我中心造成过度乐观，设定检核点控制尺度。 当木星位于第12宫，潜意识与疗愈领域常伴随贵人与机遇。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "处女座": {
      "1": "木星在处女座放大细致与分析的成长路径，机会常来自改进。 当心挑剔造成过度乐观，设定检核点控制尺度。 当木星位于第1宫，自我呈现与开端领域常伴随贵人与机遇。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "木星在处女座放大细致与分析的成长路径，机会常来自改进。 当心挑剔造成过度乐观，设定检核点控制尺度。 当木星位于第2宫，资源与价值领域常伴随贵人与机遇。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "木星在处女座放大细致与分析的成长路径，机会常来自改进。 当心挑剔造成过度乐观，设定检核点控制尺度。 当木星位于第3宫，学习与沟通领域常伴随贵人与机遇。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "木星在处女座放大细致与分析的成长路径，机会常来自改进。 当心挑剔造成过度乐观，设定检核点控制尺度。 当木星位于第4宫，家庭与根基领域常伴随贵人与机遇。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "木星在处女座放大细致与分析的成长路径，机会常来自改进。 当心挑剔造成过度乐观，设定检核点控制尺度。 当木星位于第5宫，创造与表达领域常伴随贵人与机遇。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "木星在处女座放大细致与分析的成长路径，机会常来自改进。 当心挑剔造成过度乐观，设定检核点控制尺度。 当木星位于第6宫，日常与健康领域常伴随贵人与机遇。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "木星在处女座放大细致与分析的成长路径，机会常来自改进。 当心挑剔造成过度乐观，设定检核点控制尺度。 当木星位于第7宫，伴侣与合作领域常伴随贵人与机遇。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "木星在处女座放大细致与分析的成长路径，机会常来自改进。 当心挑剔造成过度乐观，设定检核点控制尺度。 当木星位于第8宫，共享与转化领域常伴随贵人与机遇。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "木星在处女座放大细致与分析的成长路径，机会常来自改进。 当心挑剔造成过度乐观，设定检核点控制尺度。 当木星位于第9宫，远行与信念领域常伴随贵人与机遇。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "木星在处女座放大细致与分析的成长路径，机会常来自改进。 当心挑剔造成过度乐观，设定检核点控制尺度。 当木星位于第10宫，事业与公众领域常伴随贵人与机遇。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "木星在处女座放大细致与分析的成长路径，机会常来自改进。 当心挑剔造成过度乐观，设定检核点控制尺度。 当木星位于第11宫，社群与愿景领域常伴随贵人与机遇。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "木星在处女座放大细致与分析的成长路径，机会常来自改进。 当心挑剔造成过度乐观，设定检核点控制尺度。 当木星位于第12宫，潜意识与疗愈领域常伴随贵人与机遇。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "天秤座": {
      "1": "木星在天秤座放大平衡与合作的成长路径，机会常来自审美。 当心犹豫造成过度乐观，设定检核点控制尺度。 当木星位于第1宫，自我呈现与开端领域常伴随贵人与机遇。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "木星在天秤座放大平衡与合作的成长路径，机会常来自审美。 当心犹豫造成过度乐观，设定检核点控制尺度。 当木星位于第2宫，资源与价值领域常伴随贵人与机遇。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "木星在天秤座放大平衡与合作的成长路径，机会常来自审美。 当心犹豫造成过度乐观，设定检核点控制尺度。 当木星位于第3宫，学习与沟通领域常伴随贵人与机遇。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "木星在天秤座放大平衡与合作的成长路径，机会常来自审美。 当心犹豫造成过度乐观，设定检核点控制尺度。 当木星位于第4宫，家庭与根基领域常伴随贵人与机遇。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "木星在天秤座放大平衡与合作的成长路径，机会常来自审美。 当心犹豫造成过度乐观，设定检核点控制尺度。 当木星位于第5宫，创造与表达领域常伴随贵人与机遇。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "木星在天秤座放大平衡与合作的成长路径，机会常来自审美。 当心犹豫造成过度乐观，设定检核点控制尺度。 当木星位于第6宫，日常与健康领域常伴随贵人与机遇。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "木星在天秤座放大平衡与合作的成长路径，机会常来自审美。 当心犹豫造成过度乐观，设定检核点控制尺度。 当木星位于第7宫，伴侣与合作领域常伴随贵人与机遇。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "木星在天秤座放大平衡与合作的成长路径，机会常来自审美。 当心犹豫造成过度乐观，设定检核点控制尺度。 当木星位于第8宫，共享与转化领域常伴随贵人与机遇。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "木星在天秤座放大平衡与合作的成长路径，机会常来自审美。 当心犹豫造成过度乐观，设定检核点控制尺度。 当木星位于第9宫，远行与信念领域常伴随贵人与机遇。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "木星在天秤座放大平衡与合作的成长路径，机会常来自审美。 当心犹豫造成过度乐观，设定检核点控制尺度。 当木星位于第10宫，事业与公众领域常伴随贵人与机遇。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "木星在天秤座放大平衡与合作的成长路径，机会常来自审美。 当心犹豫造成过度乐观，设定检核点控制尺度。 当木星位于第11宫，社群与愿景领域常伴随贵人与机遇。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "木星在天秤座放大平衡与合作的成长路径，机会常来自审美。 当心犹豫造成过度乐观，设定检核点控制尺度。 当木星位于第12宫，潜意识与疗愈领域常伴随贵人与机遇。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "天蝎座": {
      "1": "木星在天蝎座放大深度与洞察的成长路径，机会常来自专注。 当心控制欲造成过度乐观，设定检核点控制尺度。 当木星位于第1宫，自我呈现与开端领域常伴随贵人与机遇。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "木星在天蝎座放大深度与洞察的成长路径，机会常来自专注。 当心控制欲造成过度乐观，设定检核点控制尺度。 当木星位于第2宫，资源与价值领域常伴随贵人与机遇。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "木星在天蝎座放大深度与洞察的成长路径，机会常来自专注。 当心控制欲造成过度乐观，设定检核点控制尺度。 当木星位于第3宫，学习与沟通领域常伴随贵人与机遇。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "木星在天蝎座放大深度与洞察的成长路径，机会常来自专注。 当心控制欲造成过度乐观，设定检核点控制尺度。 当木星位于第4宫，家庭与根基领域常伴随贵人与机遇。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "木星在天蝎座放大深度与洞察的成长路径，机会常来自专注。 当心控制欲造成过度乐观，设定检核点控制尺度。 当木星位于第5宫，创造与表达领域常伴随贵人与机遇。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "木星在天蝎座放大深度与洞察的成长路径，机会常来自专注。 当心控制欲造成过度乐观，设定检核点控制尺度。 当木星位于第6宫，日常与健康领域常伴随贵人与机遇。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "木星在天蝎座放大深度与洞察的成长路径，机会常来自专注。 当心控制欲造成过度乐观，设定检核点控制尺度。 当木星位于第7宫，伴侣与合作领域常伴随贵人与机遇。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "木星在天蝎座放大深度与洞察的成长路径，机会常来自专注。 当心控制欲造成过度乐观，设定检核点控制尺度。 当木星位于第8宫，共享与转化领域常伴随贵人与机遇。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "木星在天蝎座放大深度与洞察的成长路径，机会常来自专注。 当心控制欲造成过度乐观，设定检核点控制尺度。 当木星位于第9宫，远行与信念领域常伴随贵人与机遇。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "木星在天蝎座放大深度与洞察的成长路径，机会常来自专注。 当心控制欲造成过度乐观，设定检核点控制尺度。 当木星位于第10宫，事业与公众领域常伴随贵人与机遇。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "木星在天蝎座放大深度与洞察的成长路径，机会常来自专注。 当心控制欲造成过度乐观，设定检核点控制尺度。 当木星位于第11宫，社群与愿景领域常伴随贵人与机遇。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "木星在天蝎座放大深度与洞察的成长路径，机会常来自专注。 当心控制欲造成过度乐观，设定检核点控制尺度。 当木星位于第12宫，潜意识与疗愈领域常伴随贵人与机遇。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "射手座": {
      "1": "木星在射手座放大探索与远见的成长路径，机会常来自自由。 当心冒进造成过度乐观，设定检核点控制尺度。 当木星位于第1宫，自我呈现与开端领域常伴随贵人与机遇。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "木星在射手座放大探索与远见的成长路径，机会常来自自由。 当心冒进造成过度乐观，设定检核点控制尺度。 当木星位于第2宫，资源与价值领域常伴随贵人与机遇。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "木星在射手座放大探索与远见的成长路径，机会常来自自由。 当心冒进造成过度乐观，设定检核点控制尺度。 当木星位于第3宫，学习与沟通领域常伴随贵人与机遇。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "木星在射手座放大探索与远见的成长路径，机会常来自自由。 当心冒进造成过度乐观，设定检核点控制尺度。 当木星位于第4宫，家庭与根基领域常伴随贵人与机遇。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "木星在射手座放大探索与远见的成长路径，机会常来自自由。 当心冒进造成过度乐观，设定检核点控制尺度。 当木星位于第5宫，创造与表达领域常伴随贵人与机遇。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "木星在射手座放大探索与远见的成长路径，机会常来自自由。 当心冒进造成过度乐观，设定检核点控制尺度。 当木星位于第6宫，日常与健康领域常伴随贵人与机遇。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "木星在射手座放大探索与远见的成长路径，机会常来自自由。 当心冒进造成过度乐观，设定检核点控制尺度。 当木星位于第7宫，伴侣与合作领域常伴随贵人与机遇。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "木星在射手座放大探索与远见的成长路径，机会常来自自由。 当心冒进造成过度乐观，设定检核点控制尺度。 当木星位于第8宫，共享与转化领域常伴随贵人与机遇。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "木星在射手座放大探索与远见的成长路径，机会常来自自由。 当心冒进造成过度乐观，设定检核点控制尺度。 当木星位于第9宫，远行与信念领域常伴随贵人与机遇。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "木星在射手座放大探索与远见的成长路径，机会常来自自由。 当心冒进造成过度乐观，设定检核点控制尺度。 当木星位于第10宫，事业与公众领域常伴随贵人与机遇。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "木星在射手座放大探索与远见的成长路径，机会常来自自由。 当心冒进造成过度乐观，设定检核点控制尺度。 当木星位于第11宫，社群与愿景领域常伴随贵人与机遇。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "木星在射手座放大探索与远见的成长路径，机会常来自自由。 当心冒进造成过度乐观，设定检核点控制尺度。 当木星位于第12宫，潜意识与疗愈领域常伴随贵人与机遇。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "摩羯座": {
      "1": "木星在摩羯座放大纪律与目标的成长路径，机会常来自结构。 当心保守造成过度乐观，设定检核点控制尺度。 当木星位于第1宫，自我呈现与开端领域常伴随贵人与机遇。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "木星在摩羯座放大纪律与目标的成长路径，机会常来自结构。 当心保守造成过度乐观，设定检核点控制尺度。 当木星位于第2宫，资源与价值领域常伴随贵人与机遇。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "木星在摩羯座放大纪律与目标的成长路径，机会常来自结构。 当心保守造成过度乐观，设定检核点控制尺度。 当木星位于第3宫，学习与沟通领域常伴随贵人与机遇。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "木星在摩羯座放大纪律与目标的成长路径，机会常来自结构。 当心保守造成过度乐观，设定检核点控制尺度。 当木星位于第4宫，家庭与根基领域常伴随贵人与机遇。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "木星在摩羯座放大纪律与目标的成长路径，机会常来自结构。 当心保守造成过度乐观，设定检核点控制尺度。 当木星位于第5宫，创造与表达领域常伴随贵人与机遇。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "木星在摩羯座放大纪律与目标的成长路径，机会常来自结构。 当心保守造成过度乐观，设定检核点控制尺度。 当木星位于第6宫，日常与健康领域常伴随贵人与机遇。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "木星在摩羯座放大纪律与目标的成长路径，机会常来自结构。 当心保守造成过度乐观，设定检核点控制尺度。 当木星位于第7宫，伴侣与合作领域常伴随贵人与机遇。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "木星在摩羯座放大纪律与目标的成长路径，机会常来自结构。 当心保守造成过度乐观，设定检核点控制尺度。 当木星位于第8宫，共享与转化领域常伴随贵人与机遇。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "木星在摩羯座放大纪律与目标的成长路径，机会常来自结构。 当心保守造成过度乐观，设定检核点控制尺度。 当木星位于第9宫，远行与信念领域常伴随贵人与机遇。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "木星在摩羯座放大纪律与目标的成长路径，机会常来自结构。 当心保守造成过度乐观，设定检核点控制尺度。 当木星位于第10宫，事业与公众领域常伴随贵人与机遇。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "木星在摩羯座放大纪律与目标的成长路径，机会常来自结构。 当心保守造成过度乐观，设定检核点控制尺度。 当木星位于第11宫，社群与愿景领域常伴随贵人与机遇。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "木星在摩羯座放大纪律与目标的成长路径，机会常来自结构。 当心保守造成过度乐观，设定检核点控制尺度。 当木星位于第12宫，潜意识与疗愈领域常伴随贵人与机遇。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "水瓶座": {
      "1": "木星在水瓶座放大独立与革新的成长路径，机会常来自理性。 当心疏离造成过度乐观，设定检核点控制尺度。 当木星位于第1宫，自我呈现与开端领域常伴随贵人与机遇。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "木星在水瓶座放大独立与革新的成长路径，机会常来自理性。 当心疏离造成过度乐观，设定检核点控制尺度。 当木星位于第2宫，资源与价值领域常伴随贵人与机遇。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "木星在水瓶座放大独立与革新的成长路径，机会常来自理性。 当心疏离造成过度乐观，设定检核点控制尺度。 当木星位于第3宫，学习与沟通领域常伴随贵人与机遇。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "木星在水瓶座放大独立与革新的成长路径，机会常来自理性。 当心疏离造成过度乐观，设定检核点控制尺度。 当木星位于第4宫，家庭与根基领域常伴随贵人与机遇。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "木星在水瓶座放大独立与革新的成长路径，机会常来自理性。 当心疏离造成过度乐观，设定检核点控制尺度。 当木星位于第5宫，创造与表达领域常伴随贵人与机遇。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "木星在水瓶座放大独立与革新的成长路径，机会常来自理性。 当心疏离造成过度乐观，设定检核点控制尺度。 当木星位于第6宫，日常与健康领域常伴随贵人与机遇。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "木星在水瓶座放大独立与革新的成长路径，机会常来自理性。 当心疏离造成过度乐观，设定检核点控制尺度。 当木星位于第7宫，伴侣与合作领域常伴随贵人与机遇。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "木星在水瓶座放大独立与革新的成长路径，机会常来自理性。 当心疏离造成过度乐观，设定检核点控制尺度。 当木星位于第8宫，共享与转化领域常伴随贵人与机遇。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "木星在水瓶座放大独立与革新的成长路径，机会常来自理性。 当心疏离造成过度乐观，设定检核点控制尺度。 当木星位于第9宫，远行与信念领域常伴随贵人与机遇。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "木星在水瓶座放大独立与革新的成长路径，机会常来自理性。 当心疏离造成过度乐观，设定检核点控制尺度。 当木星位于第10宫，事业与公众领域常伴随贵人与机遇。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "木星在水瓶座放大独立与革新的成长路径，机会常来自理性。 当心疏离造成过度乐观，设定检核点控制尺度。 当木星位于第11宫，社群与愿景领域常伴随贵人与机遇。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "木星在水瓶座放大独立与革新的成长路径，机会常来自理性。 当心疏离造成过度乐观，设定检核点控制尺度。 当木星位于第12宫，潜意识与疗愈领域常伴随贵人与机遇。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "双鱼座": {
      "1": "木星在双鱼座放大共情与想象的成长路径，机会常来自融合。 当心迷离造成过度乐观，设定检核点控制尺度。 当木星位于第1宫，自我呈现与开端领域常伴随贵人与机遇。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "木星在双鱼座放大共情与想象的成长路径，机会常来自融合。 当心迷离造成过度乐观，设定检核点控制尺度。 当木星位于第2宫，资源与价值领域常伴随贵人与机遇。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "木星在双鱼座放大共情与想象的成长路径，机会常来自融合。 当心迷离造成过度乐观，设定检核点控制尺度。 当木星位于第3宫，学习与沟通领域常伴随贵人与机遇。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "木星在双鱼座放大共情与想象的成长路径，机会常来自融合。 当心迷离造成过度乐观，设定检核点控制尺度。 当木星位于第4宫，家庭与根基领域常伴随贵人与机遇。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "木星在双鱼座放大共情与想象的成长路径，机会常来自融合。 当心迷离造成过度乐观，设定检核点控制尺度。 当木星位于第5宫，创造与表达领域常伴随贵人与机遇。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "木星在双鱼座放大共情与想象的成长路径，机会常来自融合。 当心迷离造成过度乐观，设定检核点控制尺度。 当木星位于第6宫，日常与健康领域常伴随贵人与机遇。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "木星在双鱼座放大共情与想象的成长路径，机会常来自融合。 当心迷离造成过度乐观，设定检核点控制尺度。 当木星位于第7宫，伴侣与合作领域常伴随贵人与机遇。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "木星在双鱼座放大共情与想象的成长路径，机会常来自融合。 当心迷离造成过度乐观，设定检核点控制尺度。 当木星位于第8宫，共享与转化领域常伴随贵人与机遇。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "木星在双鱼座放大共情与想象的成长路径，机会常来自融合。 当心迷离造成过度乐观，设定检核点控制尺度。 当木星位于第9宫，远行与信念领域常伴随贵人与机遇。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "木星在双鱼座放大共情与想象的成长路径，机会常来自融合。 当心迷离造成过度乐观，设定检核点控制尺度。 当木星位于第10宫，事业与公众领域常伴随贵人与机遇。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "木星在双鱼座放大共情与想象的成长路径，机会常来自融合。 当心迷离造成过度乐观，设定检核点控制尺度。 当木星位于第11宫，社群与愿景领域常伴随贵人与机遇。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "木星在双鱼座放大共情与想象的成长路径，机会常来自融合。 当心迷离造成过度乐观，设定检核点控制尺度。 当木星位于第12宫，潜意识与疗愈领域常伴随贵人与机遇。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    }
  },
  "土星": {
    "白羊座": {
      "1": "土星在白羊座要求以开创与直接的方式承担责任，你需通过行动建立稳固基础。 注意急躁让你过度保守，通过小步试错维持弹性。 当土星位于第1宫，你需要在自我呈现与开端上承担并建立秩序。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "土星在白羊座要求以开创与直接的方式承担责任，你需通过行动建立稳固基础。 注意急躁让你过度保守，通过小步试错维持弹性。 当土星位于第2宫，你需要在资源与价值上承担并建立秩序。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "土星在白羊座要求以开创与直接的方式承担责任，你需通过行动建立稳固基础。 注意急躁让你过度保守，通过小步试错维持弹性。 当土星位于第3宫，你需要在学习与沟通上承担并建立秩序。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "土星在白羊座要求以开创与直接的方式承担责任，你需通过行动建立稳固基础。 注意急躁让你过度保守，通过小步试错维持弹性。 当土星位于第4宫，你需要在家庭与根基上承担并建立秩序。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "土星在白羊座要求以开创与直接的方式承担责任，你需通过行动建立稳固基础。 注意急躁让你过度保守，通过小步试错维持弹性。 当土星位于第5宫，你需要在创造与表达上承担并建立秩序。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "土星在白羊座要求以开创与直接的方式承担责任，你需通过行动建立稳固基础。 注意急躁让你过度保守，通过小步试错维持弹性。 当土星位于第6宫，你需要在日常与健康上承担并建立秩序。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "土星在白羊座要求以开创与直接的方式承担责任，你需通过行动建立稳固基础。 注意急躁让你过度保守，通过小步试错维持弹性。 当土星位于第7宫，你需要在伴侣与合作上承担并建立秩序。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "土星在白羊座要求以开创与直接的方式承担责任，你需通过行动建立稳固基础。 注意急躁让你过度保守，通过小步试错维持弹性。 当土星位于第8宫，你需要在共享与转化上承担并建立秩序。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "土星在白羊座要求以开创与直接的方式承担责任，你需通过行动建立稳固基础。 注意急躁让你过度保守，通过小步试错维持弹性。 当土星位于第9宫，你需要在远行与信念上承担并建立秩序。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "土星在白羊座要求以开创与直接的方式承担责任，你需通过行动建立稳固基础。 注意急躁让你过度保守，通过小步试错维持弹性。 当土星位于第10宫，你需要在事业与公众上承担并建立秩序。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "土星在白羊座要求以开创与直接的方式承担责任，你需通过行动建立稳固基础。 注意急躁让你过度保守，通过小步试错维持弹性。 当土星位于第11宫，你需要在社群与愿景上承担并建立秩序。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "土星在白羊座要求以开创与直接的方式承担责任，你需通过行动建立稳固基础。 注意急躁让你过度保守，通过小步试错维持弹性。 当土星位于第12宫，你需要在潜意识与疗愈上承担并建立秩序。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "金牛座": {
      "1": "土星在金牛座要求以稳健与务实的方式承担责任，你需通过耐心建立稳固基础。 注意固执让你过度保守，通过小步试错维持弹性。 当土星位于第1宫，你需要在自我呈现与开端上承担并建立秩序。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "土星在金牛座要求以稳健与务实的方式承担责任，你需通过耐心建立稳固基础。 注意固执让你过度保守，通过小步试错维持弹性。 当土星位于第2宫，你需要在资源与价值上承担并建立秩序。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "土星在金牛座要求以稳健与务实的方式承担责任，你需通过耐心建立稳固基础。 注意固执让你过度保守，通过小步试错维持弹性。 当土星位于第3宫，你需要在学习与沟通上承担并建立秩序。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "土星在金牛座要求以稳健与务实的方式承担责任，你需通过耐心建立稳固基础。 注意固执让你过度保守，通过小步试错维持弹性。 当土星位于第4宫，你需要在家庭与根基上承担并建立秩序。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "土星在金牛座要求以稳健与务实的方式承担责任，你需通过耐心建立稳固基础。 注意固执让你过度保守，通过小步试错维持弹性。 当土星位于第5宫，你需要在创造与表达上承担并建立秩序。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "土星在金牛座要求以稳健与务实的方式承担责任，你需通过耐心建立稳固基础。 注意固执让你过度保守，通过小步试错维持弹性。 当土星位于第6宫，你需要在日常与健康上承担并建立秩序。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "土星在金牛座要求以稳健与务实的方式承担责任，你需通过耐心建立稳固基础。 注意固执让你过度保守，通过小步试错维持弹性。 当土星位于第7宫，你需要在伴侣与合作上承担并建立秩序。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "土星在金牛座要求以稳健与务实的方式承担责任，你需通过耐心建立稳固基础。 注意固执让你过度保守，通过小步试错维持弹性。 当土星位于第8宫，你需要在共享与转化上承担并建立秩序。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "土星在金牛座要求以稳健与务实的方式承担责任，你需通过耐心建立稳固基础。 注意固执让你过度保守，通过小步试错维持弹性。 当土星位于第9宫，你需要在远行与信念上承担并建立秩序。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "土星在金牛座要求以稳健与务实的方式承担责任，你需通过耐心建立稳固基础。 注意固执让你过度保守，通过小步试错维持弹性。 当土星位于第10宫，你需要在事业与公众上承担并建立秩序。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "土星在金牛座要求以稳健与务实的方式承担责任，你需通过耐心建立稳固基础。 注意固执让你过度保守，通过小步试错维持弹性。 当土星位于第11宫，你需要在社群与愿景上承担并建立秩序。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "土星在金牛座要求以稳健与务实的方式承担责任，你需通过耐心建立稳固基础。 注意固执让你过度保守，通过小步试错维持弹性。 当土星位于第12宫，你需要在潜意识与疗愈上承担并建立秩序。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "双子座": {
      "1": "土星在双子座要求以机敏与好奇的方式承担责任，你需通过沟通建立稳固基础。 注意分散让你过度保守，通过小步试错维持弹性。 当土星位于第1宫，你需要在自我呈现与开端上承担并建立秩序。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "土星在双子座要求以机敏与好奇的方式承担责任，你需通过沟通建立稳固基础。 注意分散让你过度保守，通过小步试错维持弹性。 当土星位于第2宫，你需要在资源与价值上承担并建立秩序。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "土星在双子座要求以机敏与好奇的方式承担责任，你需通过沟通建立稳固基础。 注意分散让你过度保守，通过小步试错维持弹性。 当土星位于第3宫，你需要在学习与沟通上承担并建立秩序。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "土星在双子座要求以机敏与好奇的方式承担责任，你需通过沟通建立稳固基础。 注意分散让你过度保守，通过小步试错维持弹性。 当土星位于第4宫，你需要在家庭与根基上承担并建立秩序。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "土星在双子座要求以机敏与好奇的方式承担责任，你需通过沟通建立稳固基础。 注意分散让你过度保守，通过小步试错维持弹性。 当土星位于第5宫，你需要在创造与表达上承担并建立秩序。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "土星在双子座要求以机敏与好奇的方式承担责任，你需通过沟通建立稳固基础。 注意分散让你过度保守，通过小步试错维持弹性。 当土星位于第6宫，你需要在日常与健康上承担并建立秩序。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "土星在双子座要求以机敏与好奇的方式承担责任，你需通过沟通建立稳固基础。 注意分散让你过度保守，通过小步试错维持弹性。 当土星位于第7宫，你需要在伴侣与合作上承担并建立秩序。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "土星在双子座要求以机敏与好奇的方式承担责任，你需通过沟通建立稳固基础。 注意分散让你过度保守，通过小步试错维持弹性。 当土星位于第8宫，你需要在共享与转化上承担并建立秩序。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "土星在双子座要求以机敏与好奇的方式承担责任，你需通过沟通建立稳固基础。 注意分散让你过度保守，通过小步试错维持弹性。 当土星位于第9宫，你需要在远行与信念上承担并建立秩序。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "土星在双子座要求以机敏与好奇的方式承担责任，你需通过沟通建立稳固基础。 注意分散让你过度保守，通过小步试错维持弹性。 当土星位于第10宫，你需要在事业与公众上承担并建立秩序。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "土星在双子座要求以机敏与好奇的方式承担责任，你需通过沟通建立稳固基础。 注意分散让你过度保守，通过小步试错维持弹性。 当土星位于第11宫，你需要在社群与愿景上承担并建立秩序。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "土星在双子座要求以机敏与好奇的方式承担责任，你需通过沟通建立稳固基础。 注意分散让你过度保守，通过小步试错维持弹性。 当土星位于第12宫，你需要在潜意识与疗愈上承担并建立秩序。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "巨蟹座": {
      "1": "土星在巨蟹座要求以照护与敏感的方式承担责任，你需通过归属建立稳固基础。 注意多虑让你过度保守，通过小步试错维持弹性。 当土星位于第1宫，你需要在自我呈现与开端上承担并建立秩序。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "土星在巨蟹座要求以照护与敏感的方式承担责任，你需通过归属建立稳固基础。 注意多虑让你过度保守，通过小步试错维持弹性。 当土星位于第2宫，你需要在资源与价值上承担并建立秩序。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "土星在巨蟹座要求以照护与敏感的方式承担责任，你需通过归属建立稳固基础。 注意多虑让你过度保守，通过小步试错维持弹性。 当土星位于第3宫，你需要在学习与沟通上承担并建立秩序。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "土星在巨蟹座要求以照护与敏感的方式承担责任，你需通过归属建立稳固基础。 注意多虑让你过度保守，通过小步试错维持弹性。 当土星位于第4宫，你需要在家庭与根基上承担并建立秩序。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "土星在巨蟹座要求以照护与敏感的方式承担责任，你需通过归属建立稳固基础。 注意多虑让你过度保守，通过小步试错维持弹性。 当土星位于第5宫，你需要在创造与表达上承担并建立秩序。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "土星在巨蟹座要求以照护与敏感的方式承担责任，你需通过归属建立稳固基础。 注意多虑让你过度保守，通过小步试错维持弹性。 当土星位于第6宫，你需要在日常与健康上承担并建立秩序。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "土星在巨蟹座要求以照护与敏感的方式承担责任，你需通过归属建立稳固基础。 注意多虑让你过度保守，通过小步试错维持弹性。 当土星位于第7宫，你需要在伴侣与合作上承担并建立秩序。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "土星在巨蟹座要求以照护与敏感的方式承担责任，你需通过归属建立稳固基础。 注意多虑让你过度保守，通过小步试错维持弹性。 当土星位于第8宫，你需要在共享与转化上承担并建立秩序。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "土星在巨蟹座要求以照护与敏感的方式承担责任，你需通过归属建立稳固基础。 注意多虑让你过度保守，通过小步试错维持弹性。 当土星位于第9宫，你需要在远行与信念上承担并建立秩序。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "土星在巨蟹座要求以照护与敏感的方式承担责任，你需通过归属建立稳固基础。 注意多虑让你过度保守，通过小步试错维持弹性。 当土星位于第10宫，你需要在事业与公众上承担并建立秩序。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "土星在巨蟹座要求以照护与敏感的方式承担责任，你需通过归属建立稳固基础。 注意多虑让你过度保守，通过小步试错维持弹性。 当土星位于第11宫，你需要在社群与愿景上承担并建立秩序。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "土星在巨蟹座要求以照护与敏感的方式承担责任，你需通过归属建立稳固基础。 注意多虑让你过度保守，通过小步试错维持弹性。 当土星位于第12宫，你需要在潜意识与疗愈上承担并建立秩序。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "狮子座": {
      "1": "土星在狮子座要求以自信与创造的方式承担责任，你需通过表现建立稳固基础。 注意自我中心让你过度保守，通过小步试错维持弹性。 当土星位于第1宫，你需要在自我呈现与开端上承担并建立秩序。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "土星在狮子座要求以自信与创造的方式承担责任，你需通过表现建立稳固基础。 注意自我中心让你过度保守，通过小步试错维持弹性。 当土星位于第2宫，你需要在资源与价值上承担并建立秩序。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "土星在狮子座要求以自信与创造的方式承担责任，你需通过表现建立稳固基础。 注意自我中心让你过度保守，通过小步试错维持弹性。 当土星位于第3宫，你需要在学习与沟通上承担并建立秩序。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "土星在狮子座要求以自信与创造的方式承担责任，你需通过表现建立稳固基础。 注意自我中心让你过度保守，通过小步试错维持弹性。 当土星位于第4宫，你需要在家庭与根基上承担并建立秩序。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "土星在狮子座要求以自信与创造的方式承担责任，你需通过表现建立稳固基础。 注意自我中心让你过度保守，通过小步试错维持弹性。 当土星位于第5宫，你需要在创造与表达上承担并建立秩序。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "土星在狮子座要求以自信与创造的方式承担责任，你需通过表现建立稳固基础。 注意自我中心让你过度保守，通过小步试错维持弹性。 当土星位于第6宫，你需要在日常与健康上承担并建立秩序。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "土星在狮子座要求以自信与创造的方式承担责任，你需通过表现建立稳固基础。 注意自我中心让你过度保守，通过小步试错维持弹性。 当土星位于第7宫，你需要在伴侣与合作上承担并建立秩序。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "土星在狮子座要求以自信与创造的方式承担责任，你需通过表现建立稳固基础。 注意自我中心让你过度保守，通过小步试错维持弹性。 当土星位于第8宫，你需要在共享与转化上承担并建立秩序。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "土星在狮子座要求以自信与创造的方式承担责任，你需通过表现建立稳固基础。 注意自我中心让你过度保守，通过小步试错维持弹性。 当土星位于第9宫，你需要在远行与信念上承担并建立秩序。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "土星在狮子座要求以自信与创造的方式承担责任，你需通过表现建立稳固基础。 注意自我中心让你过度保守，通过小步试错维持弹性。 当土星位于第10宫，你需要在事业与公众上承担并建立秩序。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "土星在狮子座要求以自信与创造的方式承担责任，你需通过表现建立稳固基础。 注意自我中心让你过度保守，通过小步试错维持弹性。 当土星位于第11宫，你需要在社群与愿景上承担并建立秩序。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "土星在狮子座要求以自信与创造的方式承担责任，你需通过表现建立稳固基础。 注意自我中心让你过度保守，通过小步试错维持弹性。 当土星位于第12宫，你需要在潜意识与疗愈上承担并建立秩序。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "处女座": {
      "1": "土星在处女座要求以细致与分析的方式承担责任，你需通过改进建立稳固基础。 注意挑剔让你过度保守，通过小步试错维持弹性。 当土星位于第1宫，你需要在自我呈现与开端上承担并建立秩序。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "土星在处女座要求以细致与分析的方式承担责任，你需通过改进建立稳固基础。 注意挑剔让你过度保守，通过小步试错维持弹性。 当土星位于第2宫，你需要在资源与价值上承担并建立秩序。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "土星在处女座要求以细致与分析的方式承担责任，你需通过改进建立稳固基础。 注意挑剔让你过度保守，通过小步试错维持弹性。 当土星位于第3宫，你需要在学习与沟通上承担并建立秩序。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "土星在处女座要求以细致与分析的方式承担责任，你需通过改进建立稳固基础。 注意挑剔让你过度保守，通过小步试错维持弹性。 当土星位于第4宫，你需要在家庭与根基上承担并建立秩序。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "土星在处女座要求以细致与分析的方式承担责任，你需通过改进建立稳固基础。 注意挑剔让你过度保守，通过小步试错维持弹性。 当土星位于第5宫，你需要在创造与表达上承担并建立秩序。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "土星在处女座要求以细致与分析的方式承担责任，你需通过改进建立稳固基础。 注意挑剔让你过度保守，通过小步试错维持弹性。 当土星位于第6宫，你需要在日常与健康上承担并建立秩序。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "土星在处女座要求以细致与分析的方式承担责任，你需通过改进建立稳固基础。 注意挑剔让你过度保守，通过小步试错维持弹性。 当土星位于第7宫，你需要在伴侣与合作上承担并建立秩序。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "土星在处女座要求以细致与分析的方式承担责任，你需通过改进建立稳固基础。 注意挑剔让你过度保守，通过小步试错维持弹性。 当土星位于第8宫，你需要在共享与转化上承担并建立秩序。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "土星在处女座要求以细致与分析的方式承担责任，你需通过改进建立稳固基础。 注意挑剔让你过度保守，通过小步试错维持弹性。 当土星位于第9宫，你需要在远行与信念上承担并建立秩序。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "土星在处女座要求以细致与分析的方式承担责任，你需通过改进建立稳固基础。 注意挑剔让你过度保守，通过小步试错维持弹性。 当土星位于第10宫，你需要在事业与公众上承担并建立秩序。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "土星在处女座要求以细致与分析的方式承担责任，你需通过改进建立稳固基础。 注意挑剔让你过度保守，通过小步试错维持弹性。 当土星位于第11宫，你需要在社群与愿景上承担并建立秩序。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "土星在处女座要求以细致与分析的方式承担责任，你需通过改进建立稳固基础。 注意挑剔让你过度保守，通过小步试错维持弹性。 当土星位于第12宫，你需要在潜意识与疗愈上承担并建立秩序。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "天秤座": {
      "1": "土星在天秤座要求以平衡与合作的方式承担责任，你需通过审美建立稳固基础。 注意犹豫让你过度保守，通过小步试错维持弹性。 当土星位于第1宫，你需要在自我呈现与开端上承担并建立秩序。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "土星在天秤座要求以平衡与合作的方式承担责任，你需通过审美建立稳固基础。 注意犹豫让你过度保守，通过小步试错维持弹性。 当土星位于第2宫，你需要在资源与价值上承担并建立秩序。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "土星在天秤座要求以平衡与合作的方式承担责任，你需通过审美建立稳固基础。 注意犹豫让你过度保守，通过小步试错维持弹性。 当土星位于第3宫，你需要在学习与沟通上承担并建立秩序。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "土星在天秤座要求以平衡与合作的方式承担责任，你需通过审美建立稳固基础。 注意犹豫让你过度保守，通过小步试错维持弹性。 当土星位于第4宫，你需要在家庭与根基上承担并建立秩序。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "土星在天秤座要求以平衡与合作的方式承担责任，你需通过审美建立稳固基础。 注意犹豫让你过度保守，通过小步试错维持弹性。 当土星位于第5宫，你需要在创造与表达上承担并建立秩序。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "土星在天秤座要求以平衡与合作的方式承担责任，你需通过审美建立稳固基础。 注意犹豫让你过度保守，通过小步试错维持弹性。 当土星位于第6宫，你需要在日常与健康上承担并建立秩序。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "土星在天秤座要求以平衡与合作的方式承担责任，你需通过审美建立稳固基础。 注意犹豫让你过度保守，通过小步试错维持弹性。 当土星位于第7宫，你需要在伴侣与合作上承担并建立秩序。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "土星在天秤座要求以平衡与合作的方式承担责任，你需通过审美建立稳固基础。 注意犹豫让你过度保守，通过小步试错维持弹性。 当土星位于第8宫，你需要在共享与转化上承担并建立秩序。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "土星在天秤座要求以平衡与合作的方式承担责任，你需通过审美建立稳固基础。 注意犹豫让你过度保守，通过小步试错维持弹性。 当土星位于第9宫，你需要在远行与信念上承担并建立秩序。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "土星在天秤座要求以平衡与合作的方式承担责任，你需通过审美建立稳固基础。 注意犹豫让你过度保守，通过小步试错维持弹性。 当土星位于第10宫，你需要在事业与公众上承担并建立秩序。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "土星在天秤座要求以平衡与合作的方式承担责任，你需通过审美建立稳固基础。 注意犹豫让你过度保守，通过小步试错维持弹性。 当土星位于第11宫，你需要在社群与愿景上承担并建立秩序。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "土星在天秤座要求以平衡与合作的方式承担责任，你需通过审美建立稳固基础。 注意犹豫让你过度保守，通过小步试错维持弹性。 当土星位于第12宫，你需要在潜意识与疗愈上承担并建立秩序。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "天蝎座": {
      "1": "土星在天蝎座要求以深度与洞察的方式承担责任，你需通过专注建立稳固基础。 注意控制欲让你过度保守，通过小步试错维持弹性。 当土星位于第1宫，你需要在自我呈现与开端上承担并建立秩序。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "土星在天蝎座要求以深度与洞察的方式承担责任，你需通过专注建立稳固基础。 注意控制欲让你过度保守，通过小步试错维持弹性。 当土星位于第2宫，你需要在资源与价值上承担并建立秩序。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "土星在天蝎座要求以深度与洞察的方式承担责任，你需通过专注建立稳固基础。 注意控制欲让你过度保守，通过小步试错维持弹性。 当土星位于第3宫，你需要在学习与沟通上承担并建立秩序。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "土星在天蝎座要求以深度与洞察的方式承担责任，你需通过专注建立稳固基础。 注意控制欲让你过度保守，通过小步试错维持弹性。 当土星位于第4宫，你需要在家庭与根基上承担并建立秩序。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "土星在天蝎座要求以深度与洞察的方式承担责任，你需通过专注建立稳固基础。 注意控制欲让你过度保守，通过小步试错维持弹性。 当土星位于第5宫，你需要在创造与表达上承担并建立秩序。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "土星在天蝎座要求以深度与洞察的方式承担责任，你需通过专注建立稳固基础。 注意控制欲让你过度保守，通过小步试错维持弹性。 当土星位于第6宫，你需要在日常与健康上承担并建立秩序。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "土星在天蝎座要求以深度与洞察的方式承担责任，你需通过专注建立稳固基础。 注意控制欲让你过度保守，通过小步试错维持弹性。 当土星位于第7宫，你需要在伴侣与合作上承担并建立秩序。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "土星在天蝎座要求以深度与洞察的方式承担责任，你需通过专注建立稳固基础。 注意控制欲让你过度保守，通过小步试错维持弹性。 当土星位于第8宫，你需要在共享与转化上承担并建立秩序。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "土星在天蝎座要求以深度与洞察的方式承担责任，你需通过专注建立稳固基础。 注意控制欲让你过度保守，通过小步试错维持弹性。 当土星位于第9宫，你需要在远行与信念上承担并建立秩序。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "土星在天蝎座要求以深度与洞察的方式承担责任，你需通过专注建立稳固基础。 注意控制欲让你过度保守，通过小步试错维持弹性。 当土星位于第10宫，你需要在事业与公众上承担并建立秩序。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "土星在天蝎座要求以深度与洞察的方式承担责任，你需通过专注建立稳固基础。 注意控制欲让你过度保守，通过小步试错维持弹性。 当土星位于第11宫，你需要在社群与愿景上承担并建立秩序。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "土星在天蝎座要求以深度与洞察的方式承担责任，你需通过专注建立稳固基础。 注意控制欲让你过度保守，通过小步试错维持弹性。 当土星位于第12宫，你需要在潜意识与疗愈上承担并建立秩序。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "射手座": {
      "1": "土星在射手座要求以探索与远见的方式承担责任，你需通过自由建立稳固基础。 注意冒进让你过度保守，通过小步试错维持弹性。 当土星位于第1宫，你需要在自我呈现与开端上承担并建立秩序。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "土星在射手座要求以探索与远见的方式承担责任，你需通过自由建立稳固基础。 注意冒进让你过度保守，通过小步试错维持弹性。 当土星位于第2宫，你需要在资源与价值上承担并建立秩序。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "土星在射手座要求以探索与远见的方式承担责任，你需通过自由建立稳固基础。 注意冒进让你过度保守，通过小步试错维持弹性。 当土星位于第3宫，你需要在学习与沟通上承担并建立秩序。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "土星在射手座要求以探索与远见的方式承担责任，你需通过自由建立稳固基础。 注意冒进让你过度保守，通过小步试错维持弹性。 当土星位于第4宫，你需要在家庭与根基上承担并建立秩序。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "土星在射手座要求以探索与远见的方式承担责任，你需通过自由建立稳固基础。 注意冒进让你过度保守，通过小步试错维持弹性。 当土星位于第5宫，你需要在创造与表达上承担并建立秩序。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "土星在射手座要求以探索与远见的方式承担责任，你需通过自由建立稳固基础。 注意冒进让你过度保守，通过小步试错维持弹性。 当土星位于第6宫，你需要在日常与健康上承担并建立秩序。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "土星在射手座要求以探索与远见的方式承担责任，你需通过自由建立稳固基础。 注意冒进让你过度保守，通过小步试错维持弹性。 当土星位于第7宫，你需要在伴侣与合作上承担并建立秩序。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "土星在射手座要求以探索与远见的方式承担责任，你需通过自由建立稳固基础。 注意冒进让你过度保守，通过小步试错维持弹性。 当土星位于第8宫，你需要在共享与转化上承担并建立秩序。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "土星在射手座要求以探索与远见的方式承担责任，你需通过自由建立稳固基础。 注意冒进让你过度保守，通过小步试错维持弹性。 当土星位于第9宫，你需要在远行与信念上承担并建立秩序。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "土星在射手座要求以探索与远见的方式承担责任，你需通过自由建立稳固基础。 注意冒进让你过度保守，通过小步试错维持弹性。 当土星位于第10宫，你需要在事业与公众上承担并建立秩序。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "土星在射手座要求以探索与远见的方式承担责任，你需通过自由建立稳固基础。 注意冒进让你过度保守，通过小步试错维持弹性。 当土星位于第11宫，你需要在社群与愿景上承担并建立秩序。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "土星在射手座要求以探索与远见的方式承担责任，你需通过自由建立稳固基础。 注意冒进让你过度保守，通过小步试错维持弹性。 当土星位于第12宫，你需要在潜意识与疗愈上承担并建立秩序。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "摩羯座": {
      "1": "土星在摩羯座要求以纪律与目标的方式承担责任，你需通过结构建立稳固基础。 注意保守让你过度保守，通过小步试错维持弹性。 当土星位于第1宫，你需要在自我呈现与开端上承担并建立秩序。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "土星在摩羯座要求以纪律与目标的方式承担责任，你需通过结构建立稳固基础。 注意保守让你过度保守，通过小步试错维持弹性。 当土星位于第2宫，你需要在资源与价值上承担并建立秩序。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "土星在摩羯座要求以纪律与目标的方式承担责任，你需通过结构建立稳固基础。 注意保守让你过度保守，通过小步试错维持弹性。 当土星位于第3宫，你需要在学习与沟通上承担并建立秩序。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "土星在摩羯座要求以纪律与目标的方式承担责任，你需通过结构建立稳固基础。 注意保守让你过度保守，通过小步试错维持弹性。 当土星位于第4宫，你需要在家庭与根基上承担并建立秩序。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "土星在摩羯座要求以纪律与目标的方式承担责任，你需通过结构建立稳固基础。 注意保守让你过度保守，通过小步试错维持弹性。 当土星位于第5宫，你需要在创造与表达上承担并建立秩序。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "土星在摩羯座要求以纪律与目标的方式承担责任，你需通过结构建立稳固基础。 注意保守让你过度保守，通过小步试错维持弹性。 当土星位于第6宫，你需要在日常与健康上承担并建立秩序。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "土星在摩羯座要求以纪律与目标的方式承担责任，你需通过结构建立稳固基础。 注意保守让你过度保守，通过小步试错维持弹性。 当土星位于第7宫，你需要在伴侣与合作上承担并建立秩序。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "土星在摩羯座要求以纪律与目标的方式承担责任，你需通过结构建立稳固基础。 注意保守让你过度保守，通过小步试错维持弹性。 当土星位于第8宫，你需要在共享与转化上承担并建立秩序。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "土星在摩羯座要求以纪律与目标的方式承担责任，你需通过结构建立稳固基础。 注意保守让你过度保守，通过小步试错维持弹性。 当土星位于第9宫，你需要在远行与信念上承担并建立秩序。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "土星在摩羯座要求以纪律与目标的方式承担责任，你需通过结构建立稳固基础。 注意保守让你过度保守，通过小步试错维持弹性。 当土星位于第10宫，你需要在事业与公众上承担并建立秩序。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "土星在摩羯座要求以纪律与目标的方式承担责任，你需通过结构建立稳固基础。 注意保守让你过度保守，通过小步试错维持弹性。 当土星位于第11宫，你需要在社群与愿景上承担并建立秩序。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "土星在摩羯座要求以纪律与目标的方式承担责任，你需通过结构建立稳固基础。 注意保守让你过度保守，通过小步试错维持弹性。 当土星位于第12宫，你需要在潜意识与疗愈上承担并建立秩序。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "水瓶座": {
      "1": "土星在水瓶座要求以独立与革新的方式承担责任，你需通过理性建立稳固基础。 注意疏离让你过度保守，通过小步试错维持弹性。 当土星位于第1宫，你需要在自我呈现与开端上承担并建立秩序。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "土星在水瓶座要求以独立与革新的方式承担责任，你需通过理性建立稳固基础。 注意疏离让你过度保守，通过小步试错维持弹性。 当土星位于第2宫，你需要在资源与价值上承担并建立秩序。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "土星在水瓶座要求以独立与革新的方式承担责任，你需通过理性建立稳固基础。 注意疏离让你过度保守，通过小步试错维持弹性。 当土星位于第3宫，你需要在学习与沟通上承担并建立秩序。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "土星在水瓶座要求以独立与革新的方式承担责任，你需通过理性建立稳固基础。 注意疏离让你过度保守，通过小步试错维持弹性。 当土星位于第4宫，你需要在家庭与根基上承担并建立秩序。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "土星在水瓶座要求以独立与革新的方式承担责任，你需通过理性建立稳固基础。 注意疏离让你过度保守，通过小步试错维持弹性。 当土星位于第5宫，你需要在创造与表达上承担并建立秩序。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "土星在水瓶座要求以独立与革新的方式承担责任，你需通过理性建立稳固基础。 注意疏离让你过度保守，通过小步试错维持弹性。 当土星位于第6宫，你需要在日常与健康上承担并建立秩序。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "土星在水瓶座要求以独立与革新的方式承担责任，你需通过理性建立稳固基础。 注意疏离让你过度保守，通过小步试错维持弹性。 当土星位于第7宫，你需要在伴侣与合作上承担并建立秩序。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "土星在水瓶座要求以独立与革新的方式承担责任，你需通过理性建立稳固基础。 注意疏离让你过度保守，通过小步试错维持弹性。 当土星位于第8宫，你需要在共享与转化上承担并建立秩序。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "土星在水瓶座要求以独立与革新的方式承担责任，你需通过理性建立稳固基础。 注意疏离让你过度保守，通过小步试错维持弹性。 当土星位于第9宫，你需要在远行与信念上承担并建立秩序。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "土星在水瓶座要求以独立与革新的方式承担责任，你需通过理性建立稳固基础。 注意疏离让你过度保守，通过小步试错维持弹性。 当土星位于第10宫，你需要在事业与公众上承担并建立秩序。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "土星在水瓶座要求以独立与革新的方式承担责任，你需通过理性建立稳固基础。 注意疏离让你过度保守，通过小步试错维持弹性。 当土星位于第11宫，你需要在社群与愿景上承担并建立秩序。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "土星在水瓶座要求以独立与革新的方式承担责任，你需通过理性建立稳固基础。 注意疏离让你过度保守，通过小步试错维持弹性。 当土星位于第12宫，你需要在潜意识与疗愈上承担并建立秩序。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "双鱼座": {
      "1": "土星在双鱼座要求以共情与想象的方式承担责任，你需通过融合建立稳固基础。 注意迷离让你过度保守，通过小步试错维持弹性。 当土星位于第1宫，你需要在自我呈现与开端上承担并建立秩序。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "土星在双鱼座要求以共情与想象的方式承担责任，你需通过融合建立稳固基础。 注意迷离让你过度保守，通过小步试错维持弹性。 当土星位于第2宫，你需要在资源与价值上承担并建立秩序。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "土星在双鱼座要求以共情与想象的方式承担责任，你需通过融合建立稳固基础。 注意迷离让你过度保守，通过小步试错维持弹性。 当土星位于第3宫，你需要在学习与沟通上承担并建立秩序。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "土星在双鱼座要求以共情与想象的方式承担责任，你需通过融合建立稳固基础。 注意迷离让你过度保守，通过小步试错维持弹性。 当土星位于第4宫，你需要在家庭与根基上承担并建立秩序。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "土星在双鱼座要求以共情与想象的方式承担责任，你需通过融合建立稳固基础。 注意迷离让你过度保守，通过小步试错维持弹性。 当土星位于第5宫，你需要在创造与表达上承担并建立秩序。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "土星在双鱼座要求以共情与想象的方式承担责任，你需通过融合建立稳固基础。 注意迷离让你过度保守，通过小步试错维持弹性。 当土星位于第6宫，你需要在日常与健康上承担并建立秩序。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "土星在双鱼座要求以共情与想象的方式承担责任，你需通过融合建立稳固基础。 注意迷离让你过度保守，通过小步试错维持弹性。 当土星位于第7宫，你需要在伴侣与合作上承担并建立秩序。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "土星在双鱼座要求以共情与想象的方式承担责任，你需通过融合建立稳固基础。 注意迷离让你过度保守，通过小步试错维持弹性。 当土星位于第8宫，你需要在共享与转化上承担并建立秩序。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "土星在双鱼座要求以共情与想象的方式承担责任，你需通过融合建立稳固基础。 注意迷离让你过度保守，通过小步试错维持弹性。 当土星位于第9宫，你需要在远行与信念上承担并建立秩序。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "土星在双鱼座要求以共情与想象的方式承担责任，你需通过融合建立稳固基础。 注意迷离让你过度保守，通过小步试错维持弹性。 当土星位于第10宫，你需要在事业与公众上承担并建立秩序。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "土星在双鱼座要求以共情与想象的方式承担责任，你需通过融合建立稳固基础。 注意迷离让你过度保守，通过小步试错维持弹性。 当土星位于第11宫，你需要在社群与愿景上承担并建立秩序。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "土星在双鱼座要求以共情与想象的方式承担责任，你需通过融合建立稳固基础。 注意迷离让你过度保守，通过小步试错维持弹性。 当土星位于第12宫，你需要在潜意识与疗愈上承担并建立秩序。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    }
  },
  "天王星": {
    "白羊座": {
      "1": "天王星在白羊座强调开创与直接的独特性，你以行动打破旧框架。 提防急躁变为无谓对立，以可协商边界承接创新。 当天王星位于第1宫，你会以创新方式改造自我呈现与开端。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "天王星在白羊座强调开创与直接的独特性，你以行动打破旧框架。 提防急躁变为无谓对立，以可协商边界承接创新。 当天王星位于第2宫，你会以创新方式改造资源与价值。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "天王星在白羊座强调开创与直接的独特性，你以行动打破旧框架。 提防急躁变为无谓对立，以可协商边界承接创新。 当天王星位于第3宫，你会以创新方式改造学习与沟通。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "天王星在白羊座强调开创与直接的独特性，你以行动打破旧框架。 提防急躁变为无谓对立，以可协商边界承接创新。 当天王星位于第4宫，你会以创新方式改造家庭与根基。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "天王星在白羊座强调开创与直接的独特性，你以行动打破旧框架。 提防急躁变为无谓对立，以可协商边界承接创新。 当天王星位于第5宫，你会以创新方式改造创造与表达。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "天王星在白羊座强调开创与直接的独特性，你以行动打破旧框架。 提防急躁变为无谓对立，以可协商边界承接创新。 当天王星位于第6宫，你会以创新方式改造日常与健康。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "天王星在白羊座强调开创与直接的独特性，你以行动打破旧框架。 提防急躁变为无谓对立，以可协商边界承接创新。 当天王星位于第7宫，你会以创新方式改造伴侣与合作。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "天王星在白羊座强调开创与直接的独特性，你以行动打破旧框架。 提防急躁变为无谓对立，以可协商边界承接创新。 当天王星位于第8宫，你会以创新方式改造共享与转化。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "天王星在白羊座强调开创与直接的独特性，你以行动打破旧框架。 提防急躁变为无谓对立，以可协商边界承接创新。 当天王星位于第9宫，你会以创新方式改造远行与信念。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "天王星在白羊座强调开创与直接的独特性，你以行动打破旧框架。 提防急躁变为无谓对立，以可协商边界承接创新。 当天王星位于第10宫，你会以创新方式改造事业与公众。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "天王星在白羊座强调开创与直接的独特性，你以行动打破旧框架。 提防急躁变为无谓对立，以可协商边界承接创新。 当天王星位于第11宫，你会以创新方式改造社群与愿景。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "天王星在白羊座强调开创与直接的独特性，你以行动打破旧框架。 提防急躁变为无谓对立，以可协商边界承接创新。 当天王星位于第12宫，你会以创新方式改造潜意识与疗愈。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "金牛座": {
      "1": "天王星在金牛座强调稳健与务实的独特性，你以耐心打破旧框架。 提防固执变为无谓对立，以可协商边界承接创新。 当天王星位于第1宫，你会以创新方式改造自我呈现与开端。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "天王星在金牛座强调稳健与务实的独特性，你以耐心打破旧框架。 提防固执变为无谓对立，以可协商边界承接创新。 当天王星位于第2宫，你会以创新方式改造资源与价值。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "天王星在金牛座强调稳健与务实的独特性，你以耐心打破旧框架。 提防固执变为无谓对立，以可协商边界承接创新。 当天王星位于第3宫，你会以创新方式改造学习与沟通。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "天王星在金牛座强调稳健与务实的独特性，你以耐心打破旧框架。 提防固执变为无谓对立，以可协商边界承接创新。 当天王星位于第4宫，你会以创新方式改造家庭与根基。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "天王星在金牛座强调稳健与务实的独特性，你以耐心打破旧框架。 提防固执变为无谓对立，以可协商边界承接创新。 当天王星位于第5宫，你会以创新方式改造创造与表达。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "天王星在金牛座强调稳健与务实的独特性，你以耐心打破旧框架。 提防固执变为无谓对立，以可协商边界承接创新。 当天王星位于第6宫，你会以创新方式改造日常与健康。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "天王星在金牛座强调稳健与务实的独特性，你以耐心打破旧框架。 提防固执变为无谓对立，以可协商边界承接创新。 当天王星位于第7宫，你会以创新方式改造伴侣与合作。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "天王星在金牛座强调稳健与务实的独特性，你以耐心打破旧框架。 提防固执变为无谓对立，以可协商边界承接创新。 当天王星位于第8宫，你会以创新方式改造共享与转化。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "天王星在金牛座强调稳健与务实的独特性，你以耐心打破旧框架。 提防固执变为无谓对立，以可协商边界承接创新。 当天王星位于第9宫，你会以创新方式改造远行与信念。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "天王星在金牛座强调稳健与务实的独特性，你以耐心打破旧框架。 提防固执变为无谓对立，以可协商边界承接创新。 当天王星位于第10宫，你会以创新方式改造事业与公众。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "天王星在金牛座强调稳健与务实的独特性，你以耐心打破旧框架。 提防固执变为无谓对立，以可协商边界承接创新。 当天王星位于第11宫，你会以创新方式改造社群与愿景。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "天王星在金牛座强调稳健与务实的独特性，你以耐心打破旧框架。 提防固执变为无谓对立，以可协商边界承接创新。 当天王星位于第12宫，你会以创新方式改造潜意识与疗愈。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "双子座": {
      "1": "天王星在双子座强调机敏与好奇的独特性，你以沟通打破旧框架。 提防分散变为无谓对立，以可协商边界承接创新。 当天王星位于第1宫，你会以创新方式改造自我呈现与开端。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "天王星在双子座强调机敏与好奇的独特性，你以沟通打破旧框架。 提防分散变为无谓对立，以可协商边界承接创新。 当天王星位于第2宫，你会以创新方式改造资源与价值。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "天王星在双子座强调机敏与好奇的独特性，你以沟通打破旧框架。 提防分散变为无谓对立，以可协商边界承接创新。 当天王星位于第3宫，你会以创新方式改造学习与沟通。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "天王星在双子座强调机敏与好奇的独特性，你以沟通打破旧框架。 提防分散变为无谓对立，以可协商边界承接创新。 当天王星位于第4宫，你会以创新方式改造家庭与根基。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "天王星在双子座强调机敏与好奇的独特性，你以沟通打破旧框架。 提防分散变为无谓对立，以可协商边界承接创新。 当天王星位于第5宫，你会以创新方式改造创造与表达。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "天王星在双子座强调机敏与好奇的独特性，你以沟通打破旧框架。 提防分散变为无谓对立，以可协商边界承接创新。 当天王星位于第6宫，你会以创新方式改造日常与健康。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "天王星在双子座强调机敏与好奇的独特性，你以沟通打破旧框架。 提防分散变为无谓对立，以可协商边界承接创新。 当天王星位于第7宫，你会以创新方式改造伴侣与合作。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "天王星在双子座强调机敏与好奇的独特性，你以沟通打破旧框架。 提防分散变为无谓对立，以可协商边界承接创新。 当天王星位于第8宫，你会以创新方式改造共享与转化。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "天王星在双子座强调机敏与好奇的独特性，你以沟通打破旧框架。 提防分散变为无谓对立，以可协商边界承接创新。 当天王星位于第9宫，你会以创新方式改造远行与信念。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "天王星在双子座强调机敏与好奇的独特性，你以沟通打破旧框架。 提防分散变为无谓对立，以可协商边界承接创新。 当天王星位于第10宫，你会以创新方式改造事业与公众。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "天王星在双子座强调机敏与好奇的独特性，你以沟通打破旧框架。 提防分散变为无谓对立，以可协商边界承接创新。 当天王星位于第11宫，你会以创新方式改造社群与愿景。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "天王星在双子座强调机敏与好奇的独特性，你以沟通打破旧框架。 提防分散变为无谓对立，以可协商边界承接创新。 当天王星位于第12宫，你会以创新方式改造潜意识与疗愈。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "巨蟹座": {
      "1": "天王星在巨蟹座强调照护与敏感的独特性，你以归属打破旧框架。 提防多虑变为无谓对立，以可协商边界承接创新。 当天王星位于第1宫，你会以创新方式改造自我呈现与开端。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "天王星在巨蟹座强调照护与敏感的独特性，你以归属打破旧框架。 提防多虑变为无谓对立，以可协商边界承接创新。 当天王星位于第2宫，你会以创新方式改造资源与价值。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "天王星在巨蟹座强调照护与敏感的独特性，你以归属打破旧框架。 提防多虑变为无谓对立，以可协商边界承接创新。 当天王星位于第3宫，你会以创新方式改造学习与沟通。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "天王星在巨蟹座强调照护与敏感的独特性，你以归属打破旧框架。 提防多虑变为无谓对立，以可协商边界承接创新。 当天王星位于第4宫，你会以创新方式改造家庭与根基。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "天王星在巨蟹座强调照护与敏感的独特性，你以归属打破旧框架。 提防多虑变为无谓对立，以可协商边界承接创新。 当天王星位于第5宫，你会以创新方式改造创造与表达。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "天王星在巨蟹座强调照护与敏感的独特性，你以归属打破旧框架。 提防多虑变为无谓对立，以可协商边界承接创新。 当天王星位于第6宫，你会以创新方式改造日常与健康。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "天王星在巨蟹座强调照护与敏感的独特性，你以归属打破旧框架。 提防多虑变为无谓对立，以可协商边界承接创新。 当天王星位于第7宫，你会以创新方式改造伴侣与合作。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "天王星在巨蟹座强调照护与敏感的独特性，你以归属打破旧框架。 提防多虑变为无谓对立，以可协商边界承接创新。 当天王星位于第8宫，你会以创新方式改造共享与转化。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "天王星在巨蟹座强调照护与敏感的独特性，你以归属打破旧框架。 提防多虑变为无谓对立，以可协商边界承接创新。 当天王星位于第9宫，你会以创新方式改造远行与信念。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "天王星在巨蟹座强调照护与敏感的独特性，你以归属打破旧框架。 提防多虑变为无谓对立，以可协商边界承接创新。 当天王星位于第10宫，你会以创新方式改造事业与公众。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "天王星在巨蟹座强调照护与敏感的独特性，你以归属打破旧框架。 提防多虑变为无谓对立，以可协商边界承接创新。 当天王星位于第11宫，你会以创新方式改造社群与愿景。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "天王星在巨蟹座强调照护与敏感的独特性，你以归属打破旧框架。 提防多虑变为无谓对立，以可协商边界承接创新。 当天王星位于第12宫，你会以创新方式改造潜意识与疗愈。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "狮子座": {
      "1": "天王星在狮子座强调自信与创造的独特性，你以表现打破旧框架。 提防自我中心变为无谓对立，以可协商边界承接创新。 当天王星位于第1宫，你会以创新方式改造自我呈现与开端。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "天王星在狮子座强调自信与创造的独特性，你以表现打破旧框架。 提防自我中心变为无谓对立，以可协商边界承接创新。 当天王星位于第2宫，你会以创新方式改造资源与价值。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "天王星在狮子座强调自信与创造的独特性，你以表现打破旧框架。 提防自我中心变为无谓对立，以可协商边界承接创新。 当天王星位于第3宫，你会以创新方式改造学习与沟通。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "天王星在狮子座强调自信与创造的独特性，你以表现打破旧框架。 提防自我中心变为无谓对立，以可协商边界承接创新。 当天王星位于第4宫，你会以创新方式改造家庭与根基。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "天王星在狮子座强调自信与创造的独特性，你以表现打破旧框架。 提防自我中心变为无谓对立，以可协商边界承接创新。 当天王星位于第5宫，你会以创新方式改造创造与表达。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "天王星在狮子座强调自信与创造的独特性，你以表现打破旧框架。 提防自我中心变为无谓对立，以可协商边界承接创新。 当天王星位于第6宫，你会以创新方式改造日常与健康。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "天王星在狮子座强调自信与创造的独特性，你以表现打破旧框架。 提防自我中心变为无谓对立，以可协商边界承接创新。 当天王星位于第7宫，你会以创新方式改造伴侣与合作。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "天王星在狮子座强调自信与创造的独特性，你以表现打破旧框架。 提防自我中心变为无谓对立，以可协商边界承接创新。 当天王星位于第8宫，你会以创新方式改造共享与转化。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "天王星在狮子座强调自信与创造的独特性，你以表现打破旧框架。 提防自我中心变为无谓对立，以可协商边界承接创新。 当天王星位于第9宫，你会以创新方式改造远行与信念。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "天王星在狮子座强调自信与创造的独特性，你以表现打破旧框架。 提防自我中心变为无谓对立，以可协商边界承接创新。 当天王星位于第10宫，你会以创新方式改造事业与公众。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "天王星在狮子座强调自信与创造的独特性，你以表现打破旧框架。 提防自我中心变为无谓对立，以可协商边界承接创新。 当天王星位于第11宫，你会以创新方式改造社群与愿景。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "天王星在狮子座强调自信与创造的独特性，你以表现打破旧框架。 提防自我中心变为无谓对立，以可协商边界承接创新。 当天王星位于第12宫，你会以创新方式改造潜意识与疗愈。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "处女座": {
      "1": "天王星在处女座强调细致与分析的独特性，你以改进打破旧框架。 提防挑剔变为无谓对立，以可协商边界承接创新。 当天王星位于第1宫，你会以创新方式改造自我呈现与开端。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "天王星在处女座强调细致与分析的独特性，你以改进打破旧框架。 提防挑剔变为无谓对立，以可协商边界承接创新。 当天王星位于第2宫，你会以创新方式改造资源与价值。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "天王星在处女座强调细致与分析的独特性，你以改进打破旧框架。 提防挑剔变为无谓对立，以可协商边界承接创新。 当天王星位于第3宫，你会以创新方式改造学习与沟通。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "天王星在处女座强调细致与分析的独特性，你以改进打破旧框架。 提防挑剔变为无谓对立，以可协商边界承接创新。 当天王星位于第4宫，你会以创新方式改造家庭与根基。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "天王星在处女座强调细致与分析的独特性，你以改进打破旧框架。 提防挑剔变为无谓对立，以可协商边界承接创新。 当天王星位于第5宫，你会以创新方式改造创造与表达。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "天王星在处女座强调细致与分析的独特性，你以改进打破旧框架。 提防挑剔变为无谓对立，以可协商边界承接创新。 当天王星位于第6宫，你会以创新方式改造日常与健康。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "天王星在处女座强调细致与分析的独特性，你以改进打破旧框架。 提防挑剔变为无谓对立，以可协商边界承接创新。 当天王星位于第7宫，你会以创新方式改造伴侣与合作。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "天王星在处女座强调细致与分析的独特性，你以改进打破旧框架。 提防挑剔变为无谓对立，以可协商边界承接创新。 当天王星位于第8宫，你会以创新方式改造共享与转化。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "天王星在处女座强调细致与分析的独特性，你以改进打破旧框架。 提防挑剔变为无谓对立，以可协商边界承接创新。 当天王星位于第9宫，你会以创新方式改造远行与信念。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "天王星在处女座强调细致与分析的独特性，你以改进打破旧框架。 提防挑剔变为无谓对立，以可协商边界承接创新。 当天王星位于第10宫，你会以创新方式改造事业与公众。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "天王星在处女座强调细致与分析的独特性，你以改进打破旧框架。 提防挑剔变为无谓对立，以可协商边界承接创新。 当天王星位于第11宫，你会以创新方式改造社群与愿景。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "天王星在处女座强调细致与分析的独特性，你以改进打破旧框架。 提防挑剔变为无谓对立，以可协商边界承接创新。 当天王星位于第12宫，你会以创新方式改造潜意识与疗愈。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "天秤座": {
      "1": "天王星在天秤座强调平衡与合作的独特性，你以审美打破旧框架。 提防犹豫变为无谓对立，以可协商边界承接创新。 当天王星位于第1宫，你会以创新方式改造自我呈现与开端。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "天王星在天秤座强调平衡与合作的独特性，你以审美打破旧框架。 提防犹豫变为无谓对立，以可协商边界承接创新。 当天王星位于第2宫，你会以创新方式改造资源与价值。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "天王星在天秤座强调平衡与合作的独特性，你以审美打破旧框架。 提防犹豫变为无谓对立，以可协商边界承接创新。 当天王星位于第3宫，你会以创新方式改造学习与沟通。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "天王星在天秤座强调平衡与合作的独特性，你以审美打破旧框架。 提防犹豫变为无谓对立，以可协商边界承接创新。 当天王星位于第4宫，你会以创新方式改造家庭与根基。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "天王星在天秤座强调平衡与合作的独特性，你以审美打破旧框架。 提防犹豫变为无谓对立，以可协商边界承接创新。 当天王星位于第5宫，你会以创新方式改造创造与表达。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "天王星在天秤座强调平衡与合作的独特性，你以审美打破旧框架。 提防犹豫变为无谓对立，以可协商边界承接创新。 当天王星位于第6宫，你会以创新方式改造日常与健康。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "天王星在天秤座强调平衡与合作的独特性，你以审美打破旧框架。 提防犹豫变为无谓对立，以可协商边界承接创新。 当天王星位于第7宫，你会以创新方式改造伴侣与合作。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "天王星在天秤座强调平衡与合作的独特性，你以审美打破旧框架。 提防犹豫变为无谓对立，以可协商边界承接创新。 当天王星位于第8宫，你会以创新方式改造共享与转化。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "天王星在天秤座强调平衡与合作的独特性，你以审美打破旧框架。 提防犹豫变为无谓对立，以可协商边界承接创新。 当天王星位于第9宫，你会以创新方式改造远行与信念。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "天王星在天秤座强调平衡与合作的独特性，你以审美打破旧框架。 提防犹豫变为无谓对立，以可协商边界承接创新。 当天王星位于第10宫，你会以创新方式改造事业与公众。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "天王星在天秤座强调平衡与合作的独特性，你以审美打破旧框架。 提防犹豫变为无谓对立，以可协商边界承接创新。 当天王星位于第11宫，你会以创新方式改造社群与愿景。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "天王星在天秤座强调平衡与合作的独特性，你以审美打破旧框架。 提防犹豫变为无谓对立，以可协商边界承接创新。 当天王星位于第12宫，你会以创新方式改造潜意识与疗愈。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "天蝎座": {
      "1": "天王星在天蝎座强调深度与洞察的独特性，你以专注打破旧框架。 提防控制欲变为无谓对立，以可协商边界承接创新。 当天王星位于第1宫，你会以创新方式改造自我呈现与开端。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "天王星在天蝎座强调深度与洞察的独特性，你以专注打破旧框架。 提防控制欲变为无谓对立，以可协商边界承接创新。 当天王星位于第2宫，你会以创新方式改造资源与价值。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "天王星在天蝎座强调深度与洞察的独特性，你以专注打破旧框架。 提防控制欲变为无谓对立，以可协商边界承接创新。 当天王星位于第3宫，你会以创新方式改造学习与沟通。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "天王星在天蝎座强调深度与洞察的独特性，你以专注打破旧框架。 提防控制欲变为无谓对立，以可协商边界承接创新。 当天王星位于第4宫，你会以创新方式改造家庭与根基。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "天王星在天蝎座强调深度与洞察的独特性，你以专注打破旧框架。 提防控制欲变为无谓对立，以可协商边界承接创新。 当天王星位于第5宫，你会以创新方式改造创造与表达。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "天王星在天蝎座强调深度与洞察的独特性，你以专注打破旧框架。 提防控制欲变为无谓对立，以可协商边界承接创新。 当天王星位于第6宫，你会以创新方式改造日常与健康。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "天王星在天蝎座强调深度与洞察的独特性，你以专注打破旧框架。 提防控制欲变为无谓对立，以可协商边界承接创新。 当天王星位于第7宫，你会以创新方式改造伴侣与合作。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "天王星在天蝎座强调深度与洞察的独特性，你以专注打破旧框架。 提防控制欲变为无谓对立，以可协商边界承接创新。 当天王星位于第8宫，你会以创新方式改造共享与转化。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "天王星在天蝎座强调深度与洞察的独特性，你以专注打破旧框架。 提防控制欲变为无谓对立，以可协商边界承接创新。 当天王星位于第9宫，你会以创新方式改造远行与信念。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "天王星在天蝎座强调深度与洞察的独特性，你以专注打破旧框架。 提防控制欲变为无谓对立，以可协商边界承接创新。 当天王星位于第10宫，你会以创新方式改造事业与公众。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "天王星在天蝎座强调深度与洞察的独特性，你以专注打破旧框架。 提防控制欲变为无谓对立，以可协商边界承接创新。 当天王星位于第11宫，你会以创新方式改造社群与愿景。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "天王星在天蝎座强调深度与洞察的独特性，你以专注打破旧框架。 提防控制欲变为无谓对立，以可协商边界承接创新。 当天王星位于第12宫，你会以创新方式改造潜意识与疗愈。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "射手座": {
      "1": "天王星在射手座强调探索与远见的独特性，你以自由打破旧框架。 提防冒进变为无谓对立，以可协商边界承接创新。 当天王星位于第1宫，你会以创新方式改造自我呈现与开端。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "天王星在射手座强调探索与远见的独特性，你以自由打破旧框架。 提防冒进变为无谓对立，以可协商边界承接创新。 当天王星位于第2宫，你会以创新方式改造资源与价值。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "天王星在射手座强调探索与远见的独特性，你以自由打破旧框架。 提防冒进变为无谓对立，以可协商边界承接创新。 当天王星位于第3宫，你会以创新方式改造学习与沟通。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "天王星在射手座强调探索与远见的独特性，你以自由打破旧框架。 提防冒进变为无谓对立，以可协商边界承接创新。 当天王星位于第4宫，你会以创新方式改造家庭与根基。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "天王星在射手座强调探索与远见的独特性，你以自由打破旧框架。 提防冒进变为无谓对立，以可协商边界承接创新。 当天王星位于第5宫，你会以创新方式改造创造与表达。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "天王星在射手座强调探索与远见的独特性，你以自由打破旧框架。 提防冒进变为无谓对立，以可协商边界承接创新。 当天王星位于第6宫，你会以创新方式改造日常与健康。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "天王星在射手座强调探索与远见的独特性，你以自由打破旧框架。 提防冒进变为无谓对立，以可协商边界承接创新。 当天王星位于第7宫，你会以创新方式改造伴侣与合作。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "天王星在射手座强调探索与远见的独特性，你以自由打破旧框架。 提防冒进变为无谓对立，以可协商边界承接创新。 当天王星位于第8宫，你会以创新方式改造共享与转化。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "天王星在射手座强调探索与远见的独特性，你以自由打破旧框架。 提防冒进变为无谓对立，以可协商边界承接创新。 当天王星位于第9宫，你会以创新方式改造远行与信念。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "天王星在射手座强调探索与远见的独特性，你以自由打破旧框架。 提防冒进变为无谓对立，以可协商边界承接创新。 当天王星位于第10宫，你会以创新方式改造事业与公众。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "天王星在射手座强调探索与远见的独特性，你以自由打破旧框架。 提防冒进变为无谓对立，以可协商边界承接创新。 当天王星位于第11宫，你会以创新方式改造社群与愿景。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "天王星在射手座强调探索与远见的独特性，你以自由打破旧框架。 提防冒进变为无谓对立，以可协商边界承接创新。 当天王星位于第12宫，你会以创新方式改造潜意识与疗愈。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "摩羯座": {
      "1": "天王星在摩羯座强调纪律与目标的独特性，你以结构打破旧框架。 提防保守变为无谓对立，以可协商边界承接创新。 当天王星位于第1宫，你会以创新方式改造自我呈现与开端。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "天王星在摩羯座强调纪律与目标的独特性，你以结构打破旧框架。 提防保守变为无谓对立，以可协商边界承接创新。 当天王星位于第2宫，你会以创新方式改造资源与价值。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "天王星在摩羯座强调纪律与目标的独特性，你以结构打破旧框架。 提防保守变为无谓对立，以可协商边界承接创新。 当天王星位于第3宫，你会以创新方式改造学习与沟通。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "天王星在摩羯座强调纪律与目标的独特性，你以结构打破旧框架。 提防保守变为无谓对立，以可协商边界承接创新。 当天王星位于第4宫，你会以创新方式改造家庭与根基。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "天王星在摩羯座强调纪律与目标的独特性，你以结构打破旧框架。 提防保守变为无谓对立，以可协商边界承接创新。 当天王星位于第5宫，你会以创新方式改造创造与表达。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "天王星在摩羯座强调纪律与目标的独特性，你以结构打破旧框架。 提防保守变为无谓对立，以可协商边界承接创新。 当天王星位于第6宫，你会以创新方式改造日常与健康。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "天王星在摩羯座强调纪律与目标的独特性，你以结构打破旧框架。 提防保守变为无谓对立，以可协商边界承接创新。 当天王星位于第7宫，你会以创新方式改造伴侣与合作。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "天王星在摩羯座强调纪律与目标的独特性，你以结构打破旧框架。 提防保守变为无谓对立，以可协商边界承接创新。 当天王星位于第8宫，你会以创新方式改造共享与转化。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "天王星在摩羯座强调纪律与目标的独特性，你以结构打破旧框架。 提防保守变为无谓对立，以可协商边界承接创新。 当天王星位于第9宫，你会以创新方式改造远行与信念。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "天王星在摩羯座强调纪律与目标的独特性，你以结构打破旧框架。 提防保守变为无谓对立，以可协商边界承接创新。 当天王星位于第10宫，你会以创新方式改造事业与公众。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "天王星在摩羯座强调纪律与目标的独特性，你以结构打破旧框架。 提防保守变为无谓对立，以可协商边界承接创新。 当天王星位于第11宫，你会以创新方式改造社群与愿景。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "天王星在摩羯座强调纪律与目标的独特性，你以结构打破旧框架。 提防保守变为无谓对立，以可协商边界承接创新。 当天王星位于第12宫，你会以创新方式改造潜意识与疗愈。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "水瓶座": {
      "1": "天王星在水瓶座强调独立与革新的独特性，你以理性打破旧框架。 提防疏离变为无谓对立，以可协商边界承接创新。 当天王星位于第1宫，你会以创新方式改造自我呈现与开端。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "天王星在水瓶座强调独立与革新的独特性，你以理性打破旧框架。 提防疏离变为无谓对立，以可协商边界承接创新。 当天王星位于第2宫，你会以创新方式改造资源与价值。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "天王星在水瓶座强调独立与革新的独特性，你以理性打破旧框架。 提防疏离变为无谓对立，以可协商边界承接创新。 当天王星位于第3宫，你会以创新方式改造学习与沟通。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "天王星在水瓶座强调独立与革新的独特性，你以理性打破旧框架。 提防疏离变为无谓对立，以可协商边界承接创新。 当天王星位于第4宫，你会以创新方式改造家庭与根基。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "天王星在水瓶座强调独立与革新的独特性，你以理性打破旧框架。 提防疏离变为无谓对立，以可协商边界承接创新。 当天王星位于第5宫，你会以创新方式改造创造与表达。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "天王星在水瓶座强调独立与革新的独特性，你以理性打破旧框架。 提防疏离变为无谓对立，以可协商边界承接创新。 当天王星位于第6宫，你会以创新方式改造日常与健康。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "天王星在水瓶座强调独立与革新的独特性，你以理性打破旧框架。 提防疏离变为无谓对立，以可协商边界承接创新。 当天王星位于第7宫，你会以创新方式改造伴侣与合作。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "天王星在水瓶座强调独立与革新的独特性，你以理性打破旧框架。 提防疏离变为无谓对立，以可协商边界承接创新。 当天王星位于第8宫，你会以创新方式改造共享与转化。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "天王星在水瓶座强调独立与革新的独特性，你以理性打破旧框架。 提防疏离变为无谓对立，以可协商边界承接创新。 当天王星位于第9宫，你会以创新方式改造远行与信念。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "天王星在水瓶座强调独立与革新的独特性，你以理性打破旧框架。 提防疏离变为无谓对立，以可协商边界承接创新。 当天王星位于第10宫，你会以创新方式改造事业与公众。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "天王星在水瓶座强调独立与革新的独特性，你以理性打破旧框架。 提防疏离变为无谓对立，以可协商边界承接创新。 当天王星位于第11宫，你会以创新方式改造社群与愿景。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "天王星在水瓶座强调独立与革新的独特性，你以理性打破旧框架。 提防疏离变为无谓对立，以可协商边界承接创新。 当天王星位于第12宫，你会以创新方式改造潜意识与疗愈。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "双鱼座": {
      "1": "天王星在双鱼座强调共情与想象的独特性，你以融合打破旧框架。 提防迷离变为无谓对立，以可协商边界承接创新。 当天王星位于第1宫，你会以创新方式改造自我呈现与开端。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "天王星在双鱼座强调共情与想象的独特性，你以融合打破旧框架。 提防迷离变为无谓对立，以可协商边界承接创新。 当天王星位于第2宫，你会以创新方式改造资源与价值。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "天王星在双鱼座强调共情与想象的独特性，你以融合打破旧框架。 提防迷离变为无谓对立，以可协商边界承接创新。 当天王星位于第3宫，你会以创新方式改造学习与沟通。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "天王星在双鱼座强调共情与想象的独特性，你以融合打破旧框架。 提防迷离变为无谓对立，以可协商边界承接创新。 当天王星位于第4宫，你会以创新方式改造家庭与根基。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "天王星在双鱼座强调共情与想象的独特性，你以融合打破旧框架。 提防迷离变为无谓对立，以可协商边界承接创新。 当天王星位于第5宫，你会以创新方式改造创造与表达。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "天王星在双鱼座强调共情与想象的独特性，你以融合打破旧框架。 提防迷离变为无谓对立，以可协商边界承接创新。 当天王星位于第6宫，你会以创新方式改造日常与健康。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "天王星在双鱼座强调共情与想象的独特性，你以融合打破旧框架。 提防迷离变为无谓对立，以可协商边界承接创新。 当天王星位于第7宫，你会以创新方式改造伴侣与合作。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "天王星在双鱼座强调共情与想象的独特性，你以融合打破旧框架。 提防迷离变为无谓对立，以可协商边界承接创新。 当天王星位于第8宫，你会以创新方式改造共享与转化。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "天王星在双鱼座强调共情与想象的独特性，你以融合打破旧框架。 提防迷离变为无谓对立，以可协商边界承接创新。 当天王星位于第9宫，你会以创新方式改造远行与信念。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "天王星在双鱼座强调共情与想象的独特性，你以融合打破旧框架。 提防迷离变为无谓对立，以可协商边界承接创新。 当天王星位于第10宫，你会以创新方式改造事业与公众。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "天王星在双鱼座强调共情与想象的独特性，你以融合打破旧框架。 提防迷离变为无谓对立，以可协商边界承接创新。 当天王星位于第11宫，你会以创新方式改造社群与愿景。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "天王星在双鱼座强调共情与想象的独特性，你以融合打破旧框架。 提防迷离变为无谓对立，以可协商边界承接创新。 当天王星位于第12宫，你会以创新方式改造潜意识与疗愈。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    }
  },
  "海王星": {
    "白羊座": {
      "1": "海王星在白羊座提升开创与直接的想象力，你倾向以行动共情与联结。 避免急躁走向逃避，用事实锚点守住现实。 当海王星位于第1宫，自我呈现与开端易出现理想化与模糊边界。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "海王星在白羊座提升开创与直接的想象力，你倾向以行动共情与联结。 避免急躁走向逃避，用事实锚点守住现实。 当海王星位于第2宫，资源与价值易出现理想化与模糊边界。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "海王星在白羊座提升开创与直接的想象力，你倾向以行动共情与联结。 避免急躁走向逃避，用事实锚点守住现实。 当海王星位于第3宫，学习与沟通易出现理想化与模糊边界。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "海王星在白羊座提升开创与直接的想象力，你倾向以行动共情与联结。 避免急躁走向逃避，用事实锚点守住现实。 当海王星位于第4宫，家庭与根基易出现理想化与模糊边界。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "海王星在白羊座提升开创与直接的想象力，你倾向以行动共情与联结。 避免急躁走向逃避，用事实锚点守住现实。 当海王星位于第5宫，创造与表达易出现理想化与模糊边界。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "海王星在白羊座提升开创与直接的想象力，你倾向以行动共情与联结。 避免急躁走向逃避，用事实锚点守住现实。 当海王星位于第6宫，日常与健康易出现理想化与模糊边界。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "海王星在白羊座提升开创与直接的想象力，你倾向以行动共情与联结。 避免急躁走向逃避，用事实锚点守住现实。 当海王星位于第7宫，伴侣与合作易出现理想化与模糊边界。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "海王星在白羊座提升开创与直接的想象力，你倾向以行动共情与联结。 避免急躁走向逃避，用事实锚点守住现实。 当海王星位于第8宫，共享与转化易出现理想化与模糊边界。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "海王星在白羊座提升开创与直接的想象力，你倾向以行动共情与联结。 避免急躁走向逃避，用事实锚点守住现实。 当海王星位于第9宫，远行与信念易出现理想化与模糊边界。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "海王星在白羊座提升开创与直接的想象力，你倾向以行动共情与联结。 避免急躁走向逃避，用事实锚点守住现实。 当海王星位于第10宫，事业与公众易出现理想化与模糊边界。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "海王星在白羊座提升开创与直接的想象力，你倾向以行动共情与联结。 避免急躁走向逃避，用事实锚点守住现实。 当海王星位于第11宫，社群与愿景易出现理想化与模糊边界。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "海王星在白羊座提升开创与直接的想象力，你倾向以行动共情与联结。 避免急躁走向逃避，用事实锚点守住现实。 当海王星位于第12宫，潜意识与疗愈易出现理想化与模糊边界。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "金牛座": {
      "1": "海王星在金牛座提升稳健与务实的想象力，你倾向以耐心共情与联结。 避免固执走向逃避，用事实锚点守住现实。 当海王星位于第1宫，自我呈现与开端易出现理想化与模糊边界。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "海王星在金牛座提升稳健与务实的想象力，你倾向以耐心共情与联结。 避免固执走向逃避，用事实锚点守住现实。 当海王星位于第2宫，资源与价值易出现理想化与模糊边界。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "海王星在金牛座提升稳健与务实的想象力，你倾向以耐心共情与联结。 避免固执走向逃避，用事实锚点守住现实。 当海王星位于第3宫，学习与沟通易出现理想化与模糊边界。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "海王星在金牛座提升稳健与务实的想象力，你倾向以耐心共情与联结。 避免固执走向逃避，用事实锚点守住现实。 当海王星位于第4宫，家庭与根基易出现理想化与模糊边界。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "海王星在金牛座提升稳健与务实的想象力，你倾向以耐心共情与联结。 避免固执走向逃避，用事实锚点守住现实。 当海王星位于第5宫，创造与表达易出现理想化与模糊边界。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "海王星在金牛座提升稳健与务实的想象力，你倾向以耐心共情与联结。 避免固执走向逃避，用事实锚点守住现实。 当海王星位于第6宫，日常与健康易出现理想化与模糊边界。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "海王星在金牛座提升稳健与务实的想象力，你倾向以耐心共情与联结。 避免固执走向逃避，用事实锚点守住现实。 当海王星位于第7宫，伴侣与合作易出现理想化与模糊边界。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "海王星在金牛座提升稳健与务实的想象力，你倾向以耐心共情与联结。 避免固执走向逃避，用事实锚点守住现实。 当海王星位于第8宫，共享与转化易出现理想化与模糊边界。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "海王星在金牛座提升稳健与务实的想象力，你倾向以耐心共情与联结。 避免固执走向逃避，用事实锚点守住现实。 当海王星位于第9宫，远行与信念易出现理想化与模糊边界。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "海王星在金牛座提升稳健与务实的想象力，你倾向以耐心共情与联结。 避免固执走向逃避，用事实锚点守住现实。 当海王星位于第10宫，事业与公众易出现理想化与模糊边界。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "海王星在金牛座提升稳健与务实的想象力，你倾向以耐心共情与联结。 避免固执走向逃避，用事实锚点守住现实。 当海王星位于第11宫，社群与愿景易出现理想化与模糊边界。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "海王星在金牛座提升稳健与务实的想象力，你倾向以耐心共情与联结。 避免固执走向逃避，用事实锚点守住现实。 当海王星位于第12宫，潜意识与疗愈易出现理想化与模糊边界。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "双子座": {
      "1": "海王星在双子座提升机敏与好奇的想象力，你倾向以沟通共情与联结。 避免分散走向逃避，用事实锚点守住现实。 当海王星位于第1宫，自我呈现与开端易出现理想化与模糊边界。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "海王星在双子座提升机敏与好奇的想象力，你倾向以沟通共情与联结。 避免分散走向逃避，用事实锚点守住现实。 当海王星位于第2宫，资源与价值易出现理想化与模糊边界。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "海王星在双子座提升机敏与好奇的想象力，你倾向以沟通共情与联结。 避免分散走向逃避，用事实锚点守住现实。 当海王星位于第3宫，学习与沟通易出现理想化与模糊边界。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "海王星在双子座提升机敏与好奇的想象力，你倾向以沟通共情与联结。 避免分散走向逃避，用事实锚点守住现实。 当海王星位于第4宫，家庭与根基易出现理想化与模糊边界。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "海王星在双子座提升机敏与好奇的想象力，你倾向以沟通共情与联结。 避免分散走向逃避，用事实锚点守住现实。 当海王星位于第5宫，创造与表达易出现理想化与模糊边界。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "海王星在双子座提升机敏与好奇的想象力，你倾向以沟通共情与联结。 避免分散走向逃避，用事实锚点守住现实。 当海王星位于第6宫，日常与健康易出现理想化与模糊边界。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "海王星在双子座提升机敏与好奇的想象力，你倾向以沟通共情与联结。 避免分散走向逃避，用事实锚点守住现实。 当海王星位于第7宫，伴侣与合作易出现理想化与模糊边界。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "海王星在双子座提升机敏与好奇的想象力，你倾向以沟通共情与联结。 避免分散走向逃避，用事实锚点守住现实。 当海王星位于第8宫，共享与转化易出现理想化与模糊边界。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "海王星在双子座提升机敏与好奇的想象力，你倾向以沟通共情与联结。 避免分散走向逃避，用事实锚点守住现实。 当海王星位于第9宫，远行与信念易出现理想化与模糊边界。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "海王星在双子座提升机敏与好奇的想象力，你倾向以沟通共情与联结。 避免分散走向逃避，用事实锚点守住现实。 当海王星位于第10宫，事业与公众易出现理想化与模糊边界。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "海王星在双子座提升机敏与好奇的想象力，你倾向以沟通共情与联结。 避免分散走向逃避，用事实锚点守住现实。 当海王星位于第11宫，社群与愿景易出现理想化与模糊边界。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "海王星在双子座提升机敏与好奇的想象力，你倾向以沟通共情与联结。 避免分散走向逃避，用事实锚点守住现实。 当海王星位于第12宫，潜意识与疗愈易出现理想化与模糊边界。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "巨蟹座": {
      "1": "海王星在巨蟹座提升照护与敏感的想象力，你倾向以归属共情与联结。 避免多虑走向逃避，用事实锚点守住现实。 当海王星位于第1宫，自我呈现与开端易出现理想化与模糊边界。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "海王星在巨蟹座提升照护与敏感的想象力，你倾向以归属共情与联结。 避免多虑走向逃避，用事实锚点守住现实。 当海王星位于第2宫，资源与价值易出现理想化与模糊边界。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "海王星在巨蟹座提升照护与敏感的想象力，你倾向以归属共情与联结。 避免多虑走向逃避，用事实锚点守住现实。 当海王星位于第3宫，学习与沟通易出现理想化与模糊边界。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "海王星在巨蟹座提升照护与敏感的想象力，你倾向以归属共情与联结。 避免多虑走向逃避，用事实锚点守住现实。 当海王星位于第4宫，家庭与根基易出现理想化与模糊边界。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "海王星在巨蟹座提升照护与敏感的想象力，你倾向以归属共情与联结。 避免多虑走向逃避，用事实锚点守住现实。 当海王星位于第5宫，创造与表达易出现理想化与模糊边界。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "海王星在巨蟹座提升照护与敏感的想象力，你倾向以归属共情与联结。 避免多虑走向逃避，用事实锚点守住现实。 当海王星位于第6宫，日常与健康易出现理想化与模糊边界。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "海王星在巨蟹座提升照护与敏感的想象力，你倾向以归属共情与联结。 避免多虑走向逃避，用事实锚点守住现实。 当海王星位于第7宫，伴侣与合作易出现理想化与模糊边界。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "海王星在巨蟹座提升照护与敏感的想象力，你倾向以归属共情与联结。 避免多虑走向逃避，用事实锚点守住现实。 当海王星位于第8宫，共享与转化易出现理想化与模糊边界。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "海王星在巨蟹座提升照护与敏感的想象力，你倾向以归属共情与联结。 避免多虑走向逃避，用事实锚点守住现实。 当海王星位于第9宫，远行与信念易出现理想化与模糊边界。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "海王星在巨蟹座提升照护与敏感的想象力，你倾向以归属共情与联结。 避免多虑走向逃避，用事实锚点守住现实。 当海王星位于第10宫，事业与公众易出现理想化与模糊边界。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "海王星在巨蟹座提升照护与敏感的想象力，你倾向以归属共情与联结。 避免多虑走向逃避，用事实锚点守住现实。 当海王星位于第11宫，社群与愿景易出现理想化与模糊边界。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "海王星在巨蟹座提升照护与敏感的想象力，你倾向以归属共情与联结。 避免多虑走向逃避，用事实锚点守住现实。 当海王星位于第12宫，潜意识与疗愈易出现理想化与模糊边界。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "狮子座": {
      "1": "海王星在狮子座提升自信与创造的想象力，你倾向以表现共情与联结。 避免自我中心走向逃避，用事实锚点守住现实。 当海王星位于第1宫，自我呈现与开端易出现理想化与模糊边界。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "海王星在狮子座提升自信与创造的想象力，你倾向以表现共情与联结。 避免自我中心走向逃避，用事实锚点守住现实。 当海王星位于第2宫，资源与价值易出现理想化与模糊边界。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "海王星在狮子座提升自信与创造的想象力，你倾向以表现共情与联结。 避免自我中心走向逃避，用事实锚点守住现实。 当海王星位于第3宫，学习与沟通易出现理想化与模糊边界。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "海王星在狮子座提升自信与创造的想象力，你倾向以表现共情与联结。 避免自我中心走向逃避，用事实锚点守住现实。 当海王星位于第4宫，家庭与根基易出现理想化与模糊边界。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "海王星在狮子座提升自信与创造的想象力，你倾向以表现共情与联结。 避免自我中心走向逃避，用事实锚点守住现实。 当海王星位于第5宫，创造与表达易出现理想化与模糊边界。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "海王星在狮子座提升自信与创造的想象力，你倾向以表现共情与联结。 避免自我中心走向逃避，用事实锚点守住现实。 当海王星位于第6宫，日常与健康易出现理想化与模糊边界。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "海王星在狮子座提升自信与创造的想象力，你倾向以表现共情与联结。 避免自我中心走向逃避，用事实锚点守住现实。 当海王星位于第7宫，伴侣与合作易出现理想化与模糊边界。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "海王星在狮子座提升自信与创造的想象力，你倾向以表现共情与联结。 避免自我中心走向逃避，用事实锚点守住现实。 当海王星位于第8宫，共享与转化易出现理想化与模糊边界。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "海王星在狮子座提升自信与创造的想象力，你倾向以表现共情与联结。 避免自我中心走向逃避，用事实锚点守住现实。 当海王星位于第9宫，远行与信念易出现理想化与模糊边界。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "海王星在狮子座提升自信与创造的想象力，你倾向以表现共情与联结。 避免自我中心走向逃避，用事实锚点守住现实。 当海王星位于第10宫，事业与公众易出现理想化与模糊边界。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "海王星在狮子座提升自信与创造的想象力，你倾向以表现共情与联结。 避免自我中心走向逃避，用事实锚点守住现实。 当海王星位于第11宫，社群与愿景易出现理想化与模糊边界。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "海王星在狮子座提升自信与创造的想象力，你倾向以表现共情与联结。 避免自我中心走向逃避，用事实锚点守住现实。 当海王星位于第12宫，潜意识与疗愈易出现理想化与模糊边界。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "处女座": {
      "1": "海王星在处女座提升细致与分析的想象力，你倾向以改进共情与联结。 避免挑剔走向逃避，用事实锚点守住现实。 当海王星位于第1宫，自我呈现与开端易出现理想化与模糊边界。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "海王星在处女座提升细致与分析的想象力，你倾向以改进共情与联结。 避免挑剔走向逃避，用事实锚点守住现实。 当海王星位于第2宫，资源与价值易出现理想化与模糊边界。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "海王星在处女座提升细致与分析的想象力，你倾向以改进共情与联结。 避免挑剔走向逃避，用事实锚点守住现实。 当海王星位于第3宫，学习与沟通易出现理想化与模糊边界。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "海王星在处女座提升细致与分析的想象力，你倾向以改进共情与联结。 避免挑剔走向逃避，用事实锚点守住现实。 当海王星位于第4宫，家庭与根基易出现理想化与模糊边界。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "海王星在处女座提升细致与分析的想象力，你倾向以改进共情与联结。 避免挑剔走向逃避，用事实锚点守住现实。 当海王星位于第5宫，创造与表达易出现理想化与模糊边界。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "海王星在处女座提升细致与分析的想象力，你倾向以改进共情与联结。 避免挑剔走向逃避，用事实锚点守住现实。 当海王星位于第6宫，日常与健康易出现理想化与模糊边界。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "海王星在处女座提升细致与分析的想象力，你倾向以改进共情与联结。 避免挑剔走向逃避，用事实锚点守住现实。 当海王星位于第7宫，伴侣与合作易出现理想化与模糊边界。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "海王星在处女座提升细致与分析的想象力，你倾向以改进共情与联结。 避免挑剔走向逃避，用事实锚点守住现实。 当海王星位于第8宫，共享与转化易出现理想化与模糊边界。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "海王星在处女座提升细致与分析的想象力，你倾向以改进共情与联结。 避免挑剔走向逃避，用事实锚点守住现实。 当海王星位于第9宫，远行与信念易出现理想化与模糊边界。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "海王星在处女座提升细致与分析的想象力，你倾向以改进共情与联结。 避免挑剔走向逃避，用事实锚点守住现实。 当海王星位于第10宫，事业与公众易出现理想化与模糊边界。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "海王星在处女座提升细致与分析的想象力，你倾向以改进共情与联结。 避免挑剔走向逃避，用事实锚点守住现实。 当海王星位于第11宫，社群与愿景易出现理想化与模糊边界。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "海王星在处女座提升细致与分析的想象力，你倾向以改进共情与联结。 避免挑剔走向逃避，用事实锚点守住现实。 当海王星位于第12宫，潜意识与疗愈易出现理想化与模糊边界。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "天秤座": {
      "1": "海王星在天秤座提升平衡与合作的想象力，你倾向以审美共情与联结。 避免犹豫走向逃避，用事实锚点守住现实。 当海王星位于第1宫，自我呈现与开端易出现理想化与模糊边界。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "海王星在天秤座提升平衡与合作的想象力，你倾向以审美共情与联结。 避免犹豫走向逃避，用事实锚点守住现实。 当海王星位于第2宫，资源与价值易出现理想化与模糊边界。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "海王星在天秤座提升平衡与合作的想象力，你倾向以审美共情与联结。 避免犹豫走向逃避，用事实锚点守住现实。 当海王星位于第3宫，学习与沟通易出现理想化与模糊边界。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "海王星在天秤座提升平衡与合作的想象力，你倾向以审美共情与联结。 避免犹豫走向逃避，用事实锚点守住现实。 当海王星位于第4宫，家庭与根基易出现理想化与模糊边界。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "海王星在天秤座提升平衡与合作的想象力，你倾向以审美共情与联结。 避免犹豫走向逃避，用事实锚点守住现实。 当海王星位于第5宫，创造与表达易出现理想化与模糊边界。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "海王星在天秤座提升平衡与合作的想象力，你倾向以审美共情与联结。 避免犹豫走向逃避，用事实锚点守住现实。 当海王星位于第6宫，日常与健康易出现理想化与模糊边界。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "海王星在天秤座提升平衡与合作的想象力，你倾向以审美共情与联结。 避免犹豫走向逃避，用事实锚点守住现实。 当海王星位于第7宫，伴侣与合作易出现理想化与模糊边界。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "海王星在天秤座提升平衡与合作的想象力，你倾向以审美共情与联结。 避免犹豫走向逃避，用事实锚点守住现实。 当海王星位于第8宫，共享与转化易出现理想化与模糊边界。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "海王星在天秤座提升平衡与合作的想象力，你倾向以审美共情与联结。 避免犹豫走向逃避，用事实锚点守住现实。 当海王星位于第9宫，远行与信念易出现理想化与模糊边界。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "海王星在天秤座提升平衡与合作的想象力，你倾向以审美共情与联结。 避免犹豫走向逃避，用事实锚点守住现实。 当海王星位于第10宫，事业与公众易出现理想化与模糊边界。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "海王星在天秤座提升平衡与合作的想象力，你倾向以审美共情与联结。 避免犹豫走向逃避，用事实锚点守住现实。 当海王星位于第11宫，社群与愿景易出现理想化与模糊边界。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "海王星在天秤座提升平衡与合作的想象力，你倾向以审美共情与联结。 避免犹豫走向逃避，用事实锚点守住现实。 当海王星位于第12宫，潜意识与疗愈易出现理想化与模糊边界。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "天蝎座": {
      "1": "海王星在天蝎座提升深度与洞察的想象力，你倾向以专注共情与联结。 避免控制欲走向逃避，用事实锚点守住现实。 当海王星位于第1宫，自我呈现与开端易出现理想化与模糊边界。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "海王星在天蝎座提升深度与洞察的想象力，你倾向以专注共情与联结。 避免控制欲走向逃避，用事实锚点守住现实。 当海王星位于第2宫，资源与价值易出现理想化与模糊边界。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "海王星在天蝎座提升深度与洞察的想象力，你倾向以专注共情与联结。 避免控制欲走向逃避，用事实锚点守住现实。 当海王星位于第3宫，学习与沟通易出现理想化与模糊边界。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "海王星在天蝎座提升深度与洞察的想象力，你倾向以专注共情与联结。 避免控制欲走向逃避，用事实锚点守住现实。 当海王星位于第4宫，家庭与根基易出现理想化与模糊边界。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "海王星在天蝎座提升深度与洞察的想象力，你倾向以专注共情与联结。 避免控制欲走向逃避，用事实锚点守住现实。 当海王星位于第5宫，创造与表达易出现理想化与模糊边界。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "海王星在天蝎座提升深度与洞察的想象力，你倾向以专注共情与联结。 避免控制欲走向逃避，用事实锚点守住现实。 当海王星位于第6宫，日常与健康易出现理想化与模糊边界。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "海王星在天蝎座提升深度与洞察的想象力，你倾向以专注共情与联结。 避免控制欲走向逃避，用事实锚点守住现实。 当海王星位于第7宫，伴侣与合作易出现理想化与模糊边界。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "海王星在天蝎座提升深度与洞察的想象力，你倾向以专注共情与联结。 避免控制欲走向逃避，用事实锚点守住现实。 当海王星位于第8宫，共享与转化易出现理想化与模糊边界。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "海王星在天蝎座提升深度与洞察的想象力，你倾向以专注共情与联结。 避免控制欲走向逃避，用事实锚点守住现实。 当海王星位于第9宫，远行与信念易出现理想化与模糊边界。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "海王星在天蝎座提升深度与洞察的想象力，你倾向以专注共情与联结。 避免控制欲走向逃避，用事实锚点守住现实。 当海王星位于第10宫，事业与公众易出现理想化与模糊边界。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "海王星在天蝎座提升深度与洞察的想象力，你倾向以专注共情与联结。 避免控制欲走向逃避，用事实锚点守住现实。 当海王星位于第11宫，社群与愿景易出现理想化与模糊边界。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "海王星在天蝎座提升深度与洞察的想象力，你倾向以专注共情与联结。 避免控制欲走向逃避，用事实锚点守住现实。 当海王星位于第12宫，潜意识与疗愈易出现理想化与模糊边界。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "射手座": {
      "1": "海王星在射手座提升探索与远见的想象力，你倾向以自由共情与联结。 避免冒进走向逃避，用事实锚点守住现实。 当海王星位于第1宫，自我呈现与开端易出现理想化与模糊边界。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "海王星在射手座提升探索与远见的想象力，你倾向以自由共情与联结。 避免冒进走向逃避，用事实锚点守住现实。 当海王星位于第2宫，资源与价值易出现理想化与模糊边界。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "海王星在射手座提升探索与远见的想象力，你倾向以自由共情与联结。 避免冒进走向逃避，用事实锚点守住现实。 当海王星位于第3宫，学习与沟通易出现理想化与模糊边界。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "海王星在射手座提升探索与远见的想象力，你倾向以自由共情与联结。 避免冒进走向逃避，用事实锚点守住现实。 当海王星位于第4宫，家庭与根基易出现理想化与模糊边界。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "海王星在射手座提升探索与远见的想象力，你倾向以自由共情与联结。 避免冒进走向逃避，用事实锚点守住现实。 当海王星位于第5宫，创造与表达易出现理想化与模糊边界。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "海王星在射手座提升探索与远见的想象力，你倾向以自由共情与联结。 避免冒进走向逃避，用事实锚点守住现实。 当海王星位于第6宫，日常与健康易出现理想化与模糊边界。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "海王星在射手座提升探索与远见的想象力，你倾向以自由共情与联结。 避免冒进走向逃避，用事实锚点守住现实。 当海王星位于第7宫，伴侣与合作易出现理想化与模糊边界。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "海王星在射手座提升探索与远见的想象力，你倾向以自由共情与联结。 避免冒进走向逃避，用事实锚点守住现实。 当海王星位于第8宫，共享与转化易出现理想化与模糊边界。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "海王星在射手座提升探索与远见的想象力，你倾向以自由共情与联结。 避免冒进走向逃避，用事实锚点守住现实。 当海王星位于第9宫，远行与信念易出现理想化与模糊边界。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "海王星在射手座提升探索与远见的想象力，你倾向以自由共情与联结。 避免冒进走向逃避，用事实锚点守住现实。 当海王星位于第10宫，事业与公众易出现理想化与模糊边界。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "海王星在射手座提升探索与远见的想象力，你倾向以自由共情与联结。 避免冒进走向逃避，用事实锚点守住现实。 当海王星位于第11宫，社群与愿景易出现理想化与模糊边界。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "海王星在射手座提升探索与远见的想象力，你倾向以自由共情与联结。 避免冒进走向逃避，用事实锚点守住现实。 当海王星位于第12宫，潜意识与疗愈易出现理想化与模糊边界。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "摩羯座": {
      "1": "海王星在摩羯座提升纪律与目标的想象力，你倾向以结构共情与联结。 避免保守走向逃避，用事实锚点守住现实。 当海王星位于第1宫，自我呈现与开端易出现理想化与模糊边界。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "海王星在摩羯座提升纪律与目标的想象力，你倾向以结构共情与联结。 避免保守走向逃避，用事实锚点守住现实。 当海王星位于第2宫，资源与价值易出现理想化与模糊边界。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "海王星在摩羯座提升纪律与目标的想象力，你倾向以结构共情与联结。 避免保守走向逃避，用事实锚点守住现实。 当海王星位于第3宫，学习与沟通易出现理想化与模糊边界。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "海王星在摩羯座提升纪律与目标的想象力，你倾向以结构共情与联结。 避免保守走向逃避，用事实锚点守住现实。 当海王星位于第4宫，家庭与根基易出现理想化与模糊边界。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "海王星在摩羯座提升纪律与目标的想象力，你倾向以结构共情与联结。 避免保守走向逃避，用事实锚点守住现实。 当海王星位于第5宫，创造与表达易出现理想化与模糊边界。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "海王星在摩羯座提升纪律与目标的想象力，你倾向以结构共情与联结。 避免保守走向逃避，用事实锚点守住现实。 当海王星位于第6宫，日常与健康易出现理想化与模糊边界。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "海王星在摩羯座提升纪律与目标的想象力，你倾向以结构共情与联结。 避免保守走向逃避，用事实锚点守住现实。 当海王星位于第7宫，伴侣与合作易出现理想化与模糊边界。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "海王星在摩羯座提升纪律与目标的想象力，你倾向以结构共情与联结。 避免保守走向逃避，用事实锚点守住现实。 当海王星位于第8宫，共享与转化易出现理想化与模糊边界。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "海王星在摩羯座提升纪律与目标的想象力，你倾向以结构共情与联结。 避免保守走向逃避，用事实锚点守住现实。 当海王星位于第9宫，远行与信念易出现理想化与模糊边界。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "海王星在摩羯座提升纪律与目标的想象力，你倾向以结构共情与联结。 避免保守走向逃避，用事实锚点守住现实。 当海王星位于第10宫，事业与公众易出现理想化与模糊边界。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "海王星在摩羯座提升纪律与目标的想象力，你倾向以结构共情与联结。 避免保守走向逃避，用事实锚点守住现实。 当海王星位于第11宫，社群与愿景易出现理想化与模糊边界。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "海王星在摩羯座提升纪律与目标的想象力，你倾向以结构共情与联结。 避免保守走向逃避，用事实锚点守住现实。 当海王星位于第12宫，潜意识与疗愈易出现理想化与模糊边界。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "水瓶座": {
      "1": "海王星在水瓶座提升独立与革新的想象力，你倾向以理性共情与联结。 避免疏离走向逃避，用事实锚点守住现实。 当海王星位于第1宫，自我呈现与开端易出现理想化与模糊边界。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "海王星在水瓶座提升独立与革新的想象力，你倾向以理性共情与联结。 避免疏离走向逃避，用事实锚点守住现实。 当海王星位于第2宫，资源与价值易出现理想化与模糊边界。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "海王星在水瓶座提升独立与革新的想象力，你倾向以理性共情与联结。 避免疏离走向逃避，用事实锚点守住现实。 当海王星位于第3宫，学习与沟通易出现理想化与模糊边界。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "海王星在水瓶座提升独立与革新的想象力，你倾向以理性共情与联结。 避免疏离走向逃避，用事实锚点守住现实。 当海王星位于第4宫，家庭与根基易出现理想化与模糊边界。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "海王星在水瓶座提升独立与革新的想象力，你倾向以理性共情与联结。 避免疏离走向逃避，用事实锚点守住现实。 当海王星位于第5宫，创造与表达易出现理想化与模糊边界。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "海王星在水瓶座提升独立与革新的想象力，你倾向以理性共情与联结。 避免疏离走向逃避，用事实锚点守住现实。 当海王星位于第6宫，日常与健康易出现理想化与模糊边界。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "海王星在水瓶座提升独立与革新的想象力，你倾向以理性共情与联结。 避免疏离走向逃避，用事实锚点守住现实。 当海王星位于第7宫，伴侣与合作易出现理想化与模糊边界。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "海王星在水瓶座提升独立与革新的想象力，你倾向以理性共情与联结。 避免疏离走向逃避，用事实锚点守住现实。 当海王星位于第8宫，共享与转化易出现理想化与模糊边界。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "海王星在水瓶座提升独立与革新的想象力，你倾向以理性共情与联结。 避免疏离走向逃避，用事实锚点守住现实。 当海王星位于第9宫，远行与信念易出现理想化与模糊边界。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "海王星在水瓶座提升独立与革新的想象力，你倾向以理性共情与联结。 避免疏离走向逃避，用事实锚点守住现实。 当海王星位于第10宫，事业与公众易出现理想化与模糊边界。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "海王星在水瓶座提升独立与革新的想象力，你倾向以理性共情与联结。 避免疏离走向逃避，用事实锚点守住现实。 当海王星位于第11宫，社群与愿景易出现理想化与模糊边界。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "海王星在水瓶座提升独立与革新的想象力，你倾向以理性共情与联结。 避免疏离走向逃避，用事实锚点守住现实。 当海王星位于第12宫，潜意识与疗愈易出现理想化与模糊边界。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "双鱼座": {
      "1": "海王星在双鱼座提升共情与想象的想象力，你倾向以融合共情与联结。 避免迷离走向逃避，用事实锚点守住现实。 当海王星位于第1宫，自我呈现与开端易出现理想化与模糊边界。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "海王星在双鱼座提升共情与想象的想象力，你倾向以融合共情与联结。 避免迷离走向逃避，用事实锚点守住现实。 当海王星位于第2宫，资源与价值易出现理想化与模糊边界。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "海王星在双鱼座提升共情与想象的想象力，你倾向以融合共情与联结。 避免迷离走向逃避，用事实锚点守住现实。 当海王星位于第3宫，学习与沟通易出现理想化与模糊边界。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "海王星在双鱼座提升共情与想象的想象力，你倾向以融合共情与联结。 避免迷离走向逃避，用事实锚点守住现实。 当海王星位于第4宫，家庭与根基易出现理想化与模糊边界。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "海王星在双鱼座提升共情与想象的想象力，你倾向以融合共情与联结。 避免迷离走向逃避，用事实锚点守住现实。 当海王星位于第5宫，创造与表达易出现理想化与模糊边界。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "海王星在双鱼座提升共情与想象的想象力，你倾向以融合共情与联结。 避免迷离走向逃避，用事实锚点守住现实。 当海王星位于第6宫，日常与健康易出现理想化与模糊边界。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "海王星在双鱼座提升共情与想象的想象力，你倾向以融合共情与联结。 避免迷离走向逃避，用事实锚点守住现实。 当海王星位于第7宫，伴侣与合作易出现理想化与模糊边界。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "海王星在双鱼座提升共情与想象的想象力，你倾向以融合共情与联结。 避免迷离走向逃避，用事实锚点守住现实。 当海王星位于第8宫，共享与转化易出现理想化与模糊边界。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "海王星在双鱼座提升共情与想象的想象力，你倾向以融合共情与联结。 避免迷离走向逃避，用事实锚点守住现实。 当海王星位于第9宫，远行与信念易出现理想化与模糊边界。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "海王星在双鱼座提升共情与想象的想象力，你倾向以融合共情与联结。 避免迷离走向逃避，用事实锚点守住现实。 当海王星位于第10宫，事业与公众易出现理想化与模糊边界。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "海王星在双鱼座提升共情与想象的想象力，你倾向以融合共情与联结。 避免迷离走向逃避，用事实锚点守住现实。 当海王星位于第11宫，社群与愿景易出现理想化与模糊边界。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "海王星在双鱼座提升共情与想象的想象力，你倾向以融合共情与联结。 避免迷离走向逃避，用事实锚点守住现实。 当海王星位于第12宫，潜意识与疗愈易出现理想化与模糊边界。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    }
  },
  "冥王星": {
    "白羊座": {
      "1": "冥王星在白羊座驱动开创与直接的深度转化，你会以行动直面核心议题。 当心急躁转为控制，保持透明与复盘。 当冥王星位于第1宫，你会在自我呈现与开端中经历深度转化。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "冥王星在白羊座驱动开创与直接的深度转化，你会以行动直面核心议题。 当心急躁转为控制，保持透明与复盘。 当冥王星位于第2宫，你会在资源与价值中经历深度转化。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "冥王星在白羊座驱动开创与直接的深度转化，你会以行动直面核心议题。 当心急躁转为控制，保持透明与复盘。 当冥王星位于第3宫，你会在学习与沟通中经历深度转化。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "冥王星在白羊座驱动开创与直接的深度转化，你会以行动直面核心议题。 当心急躁转为控制，保持透明与复盘。 当冥王星位于第4宫，你会在家庭与根基中经历深度转化。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "冥王星在白羊座驱动开创与直接的深度转化，你会以行动直面核心议题。 当心急躁转为控制，保持透明与复盘。 当冥王星位于第5宫，你会在创造与表达中经历深度转化。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "冥王星在白羊座驱动开创与直接的深度转化，你会以行动直面核心议题。 当心急躁转为控制，保持透明与复盘。 当冥王星位于第6宫，你会在日常与健康中经历深度转化。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "冥王星在白羊座驱动开创与直接的深度转化，你会以行动直面核心议题。 当心急躁转为控制，保持透明与复盘。 当冥王星位于第7宫，你会在伴侣与合作中经历深度转化。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "冥王星在白羊座驱动开创与直接的深度转化，你会以行动直面核心议题。 当心急躁转为控制，保持透明与复盘。 当冥王星位于第8宫，你会在共享与转化中经历深度转化。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "冥王星在白羊座驱动开创与直接的深度转化，你会以行动直面核心议题。 当心急躁转为控制，保持透明与复盘。 当冥王星位于第9宫，你会在远行与信念中经历深度转化。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "冥王星在白羊座驱动开创与直接的深度转化，你会以行动直面核心议题。 当心急躁转为控制，保持透明与复盘。 当冥王星位于第10宫，你会在事业与公众中经历深度转化。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "冥王星在白羊座驱动开创与直接的深度转化，你会以行动直面核心议题。 当心急躁转为控制，保持透明与复盘。 当冥王星位于第11宫，你会在社群与愿景中经历深度转化。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "冥王星在白羊座驱动开创与直接的深度转化，你会以行动直面核心议题。 当心急躁转为控制，保持透明与复盘。 当冥王星位于第12宫，你会在潜意识与疗愈中经历深度转化。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "金牛座": {
      "1": "冥王星在金牛座驱动稳健与务实的深度转化，你会以耐心直面核心议题。 当心固执转为控制，保持透明与复盘。 当冥王星位于第1宫，你会在自我呈现与开端中经历深度转化。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "冥王星在金牛座驱动稳健与务实的深度转化，你会以耐心直面核心议题。 当心固执转为控制，保持透明与复盘。 当冥王星位于第2宫，你会在资源与价值中经历深度转化。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "冥王星在金牛座驱动稳健与务实的深度转化，你会以耐心直面核心议题。 当心固执转为控制，保持透明与复盘。 当冥王星位于第3宫，你会在学习与沟通中经历深度转化。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "冥王星在金牛座驱动稳健与务实的深度转化，你会以耐心直面核心议题。 当心固执转为控制，保持透明与复盘。 当冥王星位于第4宫，你会在家庭与根基中经历深度转化。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "冥王星在金牛座驱动稳健与务实的深度转化，你会以耐心直面核心议题。 当心固执转为控制，保持透明与复盘。 当冥王星位于第5宫，你会在创造与表达中经历深度转化。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "冥王星在金牛座驱动稳健与务实的深度转化，你会以耐心直面核心议题。 当心固执转为控制，保持透明与复盘。 当冥王星位于第6宫，你会在日常与健康中经历深度转化。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "冥王星在金牛座驱动稳健与务实的深度转化，你会以耐心直面核心议题。 当心固执转为控制，保持透明与复盘。 当冥王星位于第7宫，你会在伴侣与合作中经历深度转化。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "冥王星在金牛座驱动稳健与务实的深度转化，你会以耐心直面核心议题。 当心固执转为控制，保持透明与复盘。 当冥王星位于第8宫，你会在共享与转化中经历深度转化。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "冥王星在金牛座驱动稳健与务实的深度转化，你会以耐心直面核心议题。 当心固执转为控制，保持透明与复盘。 当冥王星位于第9宫，你会在远行与信念中经历深度转化。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "冥王星在金牛座驱动稳健与务实的深度转化，你会以耐心直面核心议题。 当心固执转为控制，保持透明与复盘。 当冥王星位于第10宫，你会在事业与公众中经历深度转化。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "冥王星在金牛座驱动稳健与务实的深度转化，你会以耐心直面核心议题。 当心固执转为控制，保持透明与复盘。 当冥王星位于第11宫，你会在社群与愿景中经历深度转化。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "冥王星在金牛座驱动稳健与务实的深度转化，你会以耐心直面核心议题。 当心固执转为控制，保持透明与复盘。 当冥王星位于第12宫，你会在潜意识与疗愈中经历深度转化。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "双子座": {
      "1": "冥王星在双子座驱动机敏与好奇的深度转化，你会以沟通直面核心议题。 当心分散转为控制，保持透明与复盘。 当冥王星位于第1宫，你会在自我呈现与开端中经历深度转化。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "冥王星在双子座驱动机敏与好奇的深度转化，你会以沟通直面核心议题。 当心分散转为控制，保持透明与复盘。 当冥王星位于第2宫，你会在资源与价值中经历深度转化。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "冥王星在双子座驱动机敏与好奇的深度转化，你会以沟通直面核心议题。 当心分散转为控制，保持透明与复盘。 当冥王星位于第3宫，你会在学习与沟通中经历深度转化。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "冥王星在双子座驱动机敏与好奇的深度转化，你会以沟通直面核心议题。 当心分散转为控制，保持透明与复盘。 当冥王星位于第4宫，你会在家庭与根基中经历深度转化。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "冥王星在双子座驱动机敏与好奇的深度转化，你会以沟通直面核心议题。 当心分散转为控制，保持透明与复盘。 当冥王星位于第5宫，你会在创造与表达中经历深度转化。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "冥王星在双子座驱动机敏与好奇的深度转化，你会以沟通直面核心议题。 当心分散转为控制，保持透明与复盘。 当冥王星位于第6宫，你会在日常与健康中经历深度转化。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "冥王星在双子座驱动机敏与好奇的深度转化，你会以沟通直面核心议题。 当心分散转为控制，保持透明与复盘。 当冥王星位于第7宫，你会在伴侣与合作中经历深度转化。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "冥王星在双子座驱动机敏与好奇的深度转化，你会以沟通直面核心议题。 当心分散转为控制，保持透明与复盘。 当冥王星位于第8宫，你会在共享与转化中经历深度转化。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "冥王星在双子座驱动机敏与好奇的深度转化，你会以沟通直面核心议题。 当心分散转为控制，保持透明与复盘。 当冥王星位于第9宫，你会在远行与信念中经历深度转化。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "冥王星在双子座驱动机敏与好奇的深度转化，你会以沟通直面核心议题。 当心分散转为控制，保持透明与复盘。 当冥王星位于第10宫，你会在事业与公众中经历深度转化。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "冥王星在双子座驱动机敏与好奇的深度转化，你会以沟通直面核心议题。 当心分散转为控制，保持透明与复盘。 当冥王星位于第11宫，你会在社群与愿景中经历深度转化。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "冥王星在双子座驱动机敏与好奇的深度转化，你会以沟通直面核心议题。 当心分散转为控制，保持透明与复盘。 当冥王星位于第12宫，你会在潜意识与疗愈中经历深度转化。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "巨蟹座": {
      "1": "冥王星在巨蟹座驱动照护与敏感的深度转化，你会以归属直面核心议题。 当心多虑转为控制，保持透明与复盘。 当冥王星位于第1宫，你会在自我呈现与开端中经历深度转化。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "冥王星在巨蟹座驱动照护与敏感的深度转化，你会以归属直面核心议题。 当心多虑转为控制，保持透明与复盘。 当冥王星位于第2宫，你会在资源与价值中经历深度转化。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "冥王星在巨蟹座驱动照护与敏感的深度转化，你会以归属直面核心议题。 当心多虑转为控制，保持透明与复盘。 当冥王星位于第3宫，你会在学习与沟通中经历深度转化。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "冥王星在巨蟹座驱动照护与敏感的深度转化，你会以归属直面核心议题。 当心多虑转为控制，保持透明与复盘。 当冥王星位于第4宫，你会在家庭与根基中经历深度转化。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "冥王星在巨蟹座驱动照护与敏感的深度转化，你会以归属直面核心议题。 当心多虑转为控制，保持透明与复盘。 当冥王星位于第5宫，你会在创造与表达中经历深度转化。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "冥王星在巨蟹座驱动照护与敏感的深度转化，你会以归属直面核心议题。 当心多虑转为控制，保持透明与复盘。 当冥王星位于第6宫，你会在日常与健康中经历深度转化。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "冥王星在巨蟹座驱动照护与敏感的深度转化，你会以归属直面核心议题。 当心多虑转为控制，保持透明与复盘。 当冥王星位于第7宫，你会在伴侣与合作中经历深度转化。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "冥王星在巨蟹座驱动照护与敏感的深度转化，你会以归属直面核心议题。 当心多虑转为控制，保持透明与复盘。 当冥王星位于第8宫，你会在共享与转化中经历深度转化。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "冥王星在巨蟹座驱动照护与敏感的深度转化，你会以归属直面核心议题。 当心多虑转为控制，保持透明与复盘。 当冥王星位于第9宫，你会在远行与信念中经历深度转化。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "冥王星在巨蟹座驱动照护与敏感的深度转化，你会以归属直面核心议题。 当心多虑转为控制，保持透明与复盘。 当冥王星位于第10宫，你会在事业与公众中经历深度转化。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "冥王星在巨蟹座驱动照护与敏感的深度转化，你会以归属直面核心议题。 当心多虑转为控制，保持透明与复盘。 当冥王星位于第11宫，你会在社群与愿景中经历深度转化。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "冥王星在巨蟹座驱动照护与敏感的深度转化，你会以归属直面核心议题。 当心多虑转为控制，保持透明与复盘。 当冥王星位于第12宫，你会在潜意识与疗愈中经历深度转化。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "狮子座": {
      "1": "冥王星在狮子座驱动自信与创造的深度转化，你会以表现直面核心议题。 当心自我中心转为控制，保持透明与复盘。 当冥王星位于第1宫，你会在自我呈现与开端中经历深度转化。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "冥王星在狮子座驱动自信与创造的深度转化，你会以表现直面核心议题。 当心自我中心转为控制，保持透明与复盘。 当冥王星位于第2宫，你会在资源与价值中经历深度转化。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "冥王星在狮子座驱动自信与创造的深度转化，你会以表现直面核心议题。 当心自我中心转为控制，保持透明与复盘。 当冥王星位于第3宫，你会在学习与沟通中经历深度转化。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "冥王星在狮子座驱动自信与创造的深度转化，你会以表现直面核心议题。 当心自我中心转为控制，保持透明与复盘。 当冥王星位于第4宫，你会在家庭与根基中经历深度转化。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "冥王星在狮子座驱动自信与创造的深度转化，你会以表现直面核心议题。 当心自我中心转为控制，保持透明与复盘。 当冥王星位于第5宫，你会在创造与表达中经历深度转化。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "冥王星在狮子座驱动自信与创造的深度转化，你会以表现直面核心议题。 当心自我中心转为控制，保持透明与复盘。 当冥王星位于第6宫，你会在日常与健康中经历深度转化。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "冥王星在狮子座驱动自信与创造的深度转化，你会以表现直面核心议题。 当心自我中心转为控制，保持透明与复盘。 当冥王星位于第7宫，你会在伴侣与合作中经历深度转化。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "冥王星在狮子座驱动自信与创造的深度转化，你会以表现直面核心议题。 当心自我中心转为控制，保持透明与复盘。 当冥王星位于第8宫，你会在共享与转化中经历深度转化。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "冥王星在狮子座驱动自信与创造的深度转化，你会以表现直面核心议题。 当心自我中心转为控制，保持透明与复盘。 当冥王星位于第9宫，你会在远行与信念中经历深度转化。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "冥王星在狮子座驱动自信与创造的深度转化，你会以表现直面核心议题。 当心自我中心转为控制，保持透明与复盘。 当冥王星位于第10宫，你会在事业与公众中经历深度转化。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "冥王星在狮子座驱动自信与创造的深度转化，你会以表现直面核心议题。 当心自我中心转为控制，保持透明与复盘。 当冥王星位于第11宫，你会在社群与愿景中经历深度转化。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "冥王星在狮子座驱动自信与创造的深度转化，你会以表现直面核心议题。 当心自我中心转为控制，保持透明与复盘。 当冥王星位于第12宫，你会在潜意识与疗愈中经历深度转化。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "处女座": {
      "1": "冥王星在处女座驱动细致与分析的深度转化，你会以改进直面核心议题。 当心挑剔转为控制，保持透明与复盘。 当冥王星位于第1宫，你会在自我呈现与开端中经历深度转化。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "冥王星在处女座驱动细致与分析的深度转化，你会以改进直面核心议题。 当心挑剔转为控制，保持透明与复盘。 当冥王星位于第2宫，你会在资源与价值中经历深度转化。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "冥王星在处女座驱动细致与分析的深度转化，你会以改进直面核心议题。 当心挑剔转为控制，保持透明与复盘。 当冥王星位于第3宫，你会在学习与沟通中经历深度转化。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "冥王星在处女座驱动细致与分析的深度转化，你会以改进直面核心议题。 当心挑剔转为控制，保持透明与复盘。 当冥王星位于第4宫，你会在家庭与根基中经历深度转化。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "冥王星在处女座驱动细致与分析的深度转化，你会以改进直面核心议题。 当心挑剔转为控制，保持透明与复盘。 当冥王星位于第5宫，你会在创造与表达中经历深度转化。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "冥王星在处女座驱动细致与分析的深度转化，你会以改进直面核心议题。 当心挑剔转为控制，保持透明与复盘。 当冥王星位于第6宫，你会在日常与健康中经历深度转化。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "冥王星在处女座驱动细致与分析的深度转化，你会以改进直面核心议题。 当心挑剔转为控制，保持透明与复盘。 当冥王星位于第7宫，你会在伴侣与合作中经历深度转化。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "冥王星在处女座驱动细致与分析的深度转化，你会以改进直面核心议题。 当心挑剔转为控制，保持透明与复盘。 当冥王星位于第8宫，你会在共享与转化中经历深度转化。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "冥王星在处女座驱动细致与分析的深度转化，你会以改进直面核心议题。 当心挑剔转为控制，保持透明与复盘。 当冥王星位于第9宫，你会在远行与信念中经历深度转化。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "冥王星在处女座驱动细致与分析的深度转化，你会以改进直面核心议题。 当心挑剔转为控制，保持透明与复盘。 当冥王星位于第10宫，你会在事业与公众中经历深度转化。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "冥王星在处女座驱动细致与分析的深度转化，你会以改进直面核心议题。 当心挑剔转为控制，保持透明与复盘。 当冥王星位于第11宫，你会在社群与愿景中经历深度转化。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "冥王星在处女座驱动细致与分析的深度转化，你会以改进直面核心议题。 当心挑剔转为控制，保持透明与复盘。 当冥王星位于第12宫，你会在潜意识与疗愈中经历深度转化。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "天秤座": {
      "1": "冥王星在天秤座驱动平衡与合作的深度转化，你会以审美直面核心议题。 当心犹豫转为控制，保持透明与复盘。 当冥王星位于第1宫，你会在自我呈现与开端中经历深度转化。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "冥王星在天秤座驱动平衡与合作的深度转化，你会以审美直面核心议题。 当心犹豫转为控制，保持透明与复盘。 当冥王星位于第2宫，你会在资源与价值中经历深度转化。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "冥王星在天秤座驱动平衡与合作的深度转化，你会以审美直面核心议题。 当心犹豫转为控制，保持透明与复盘。 当冥王星位于第3宫，你会在学习与沟通中经历深度转化。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "冥王星在天秤座驱动平衡与合作的深度转化，你会以审美直面核心议题。 当心犹豫转为控制，保持透明与复盘。 当冥王星位于第4宫，你会在家庭与根基中经历深度转化。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "冥王星在天秤座驱动平衡与合作的深度转化，你会以审美直面核心议题。 当心犹豫转为控制，保持透明与复盘。 当冥王星位于第5宫，你会在创造与表达中经历深度转化。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "冥王星在天秤座驱动平衡与合作的深度转化，你会以审美直面核心议题。 当心犹豫转为控制，保持透明与复盘。 当冥王星位于第6宫，你会在日常与健康中经历深度转化。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "冥王星在天秤座驱动平衡与合作的深度转化，你会以审美直面核心议题。 当心犹豫转为控制，保持透明与复盘。 当冥王星位于第7宫，你会在伴侣与合作中经历深度转化。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "冥王星在天秤座驱动平衡与合作的深度转化，你会以审美直面核心议题。 当心犹豫转为控制，保持透明与复盘。 当冥王星位于第8宫，你会在共享与转化中经历深度转化。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "冥王星在天秤座驱动平衡与合作的深度转化，你会以审美直面核心议题。 当心犹豫转为控制，保持透明与复盘。 当冥王星位于第9宫，你会在远行与信念中经历深度转化。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "冥王星在天秤座驱动平衡与合作的深度转化，你会以审美直面核心议题。 当心犹豫转为控制，保持透明与复盘。 当冥王星位于第10宫，你会在事业与公众中经历深度转化。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "冥王星在天秤座驱动平衡与合作的深度转化，你会以审美直面核心议题。 当心犹豫转为控制，保持透明与复盘。 当冥王星位于第11宫，你会在社群与愿景中经历深度转化。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "冥王星在天秤座驱动平衡与合作的深度转化，你会以审美直面核心议题。 当心犹豫转为控制，保持透明与复盘。 当冥王星位于第12宫，你会在潜意识与疗愈中经历深度转化。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "天蝎座": {
      "1": "冥王星在天蝎座驱动深度与洞察的深度转化，你会以专注直面核心议题。 当心控制欲转为控制，保持透明与复盘。 当冥王星位于第1宫，你会在自我呈现与开端中经历深度转化。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "冥王星在天蝎座驱动深度与洞察的深度转化，你会以专注直面核心议题。 当心控制欲转为控制，保持透明与复盘。 当冥王星位于第2宫，你会在资源与价值中经历深度转化。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "冥王星在天蝎座驱动深度与洞察的深度转化，你会以专注直面核心议题。 当心控制欲转为控制，保持透明与复盘。 当冥王星位于第3宫，你会在学习与沟通中经历深度转化。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "冥王星在天蝎座驱动深度与洞察的深度转化，你会以专注直面核心议题。 当心控制欲转为控制，保持透明与复盘。 当冥王星位于第4宫，你会在家庭与根基中经历深度转化。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "冥王星在天蝎座驱动深度与洞察的深度转化，你会以专注直面核心议题。 当心控制欲转为控制，保持透明与复盘。 当冥王星位于第5宫，你会在创造与表达中经历深度转化。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "冥王星在天蝎座驱动深度与洞察的深度转化，你会以专注直面核心议题。 当心控制欲转为控制，保持透明与复盘。 当冥王星位于第6宫，你会在日常与健康中经历深度转化。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "冥王星在天蝎座驱动深度与洞察的深度转化，你会以专注直面核心议题。 当心控制欲转为控制，保持透明与复盘。 当冥王星位于第7宫，你会在伴侣与合作中经历深度转化。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "冥王星在天蝎座驱动深度与洞察的深度转化，你会以专注直面核心议题。 当心控制欲转为控制，保持透明与复盘。 当冥王星位于第8宫，你会在共享与转化中经历深度转化。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "冥王星在天蝎座驱动深度与洞察的深度转化，你会以专注直面核心议题。 当心控制欲转为控制，保持透明与复盘。 当冥王星位于第9宫，你会在远行与信念中经历深度转化。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "冥王星在天蝎座驱动深度与洞察的深度转化，你会以专注直面核心议题。 当心控制欲转为控制，保持透明与复盘。 当冥王星位于第10宫，你会在事业与公众中经历深度转化。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "冥王星在天蝎座驱动深度与洞察的深度转化，你会以专注直面核心议题。 当心控制欲转为控制，保持透明与复盘。 当冥王星位于第11宫，你会在社群与愿景中经历深度转化。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "冥王星在天蝎座驱动深度与洞察的深度转化，你会以专注直面核心议题。 当心控制欲转为控制，保持透明与复盘。 当冥王星位于第12宫，你会在潜意识与疗愈中经历深度转化。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "射手座": {
      "1": "冥王星在射手座驱动探索与远见的深度转化，你会以自由直面核心议题。 当心冒进转为控制，保持透明与复盘。 当冥王星位于第1宫，你会在自我呈现与开端中经历深度转化。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "冥王星在射手座驱动探索与远见的深度转化，你会以自由直面核心议题。 当心冒进转为控制，保持透明与复盘。 当冥王星位于第2宫，你会在资源与价值中经历深度转化。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "冥王星在射手座驱动探索与远见的深度转化，你会以自由直面核心议题。 当心冒进转为控制，保持透明与复盘。 当冥王星位于第3宫，你会在学习与沟通中经历深度转化。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "冥王星在射手座驱动探索与远见的深度转化，你会以自由直面核心议题。 当心冒进转为控制，保持透明与复盘。 当冥王星位于第4宫，你会在家庭与根基中经历深度转化。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "冥王星在射手座驱动探索与远见的深度转化，你会以自由直面核心议题。 当心冒进转为控制，保持透明与复盘。 当冥王星位于第5宫，你会在创造与表达中经历深度转化。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "冥王星在射手座驱动探索与远见的深度转化，你会以自由直面核心议题。 当心冒进转为控制，保持透明与复盘。 当冥王星位于第6宫，你会在日常与健康中经历深度转化。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "冥王星在射手座驱动探索与远见的深度转化，你会以自由直面核心议题。 当心冒进转为控制，保持透明与复盘。 当冥王星位于第7宫，你会在伴侣与合作中经历深度转化。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "冥王星在射手座驱动探索与远见的深度转化，你会以自由直面核心议题。 当心冒进转为控制，保持透明与复盘。 当冥王星位于第8宫，你会在共享与转化中经历深度转化。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "冥王星在射手座驱动探索与远见的深度转化，你会以自由直面核心议题。 当心冒进转为控制，保持透明与复盘。 当冥王星位于第9宫，你会在远行与信念中经历深度转化。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "冥王星在射手座驱动探索与远见的深度转化，你会以自由直面核心议题。 当心冒进转为控制，保持透明与复盘。 当冥王星位于第10宫，你会在事业与公众中经历深度转化。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "冥王星在射手座驱动探索与远见的深度转化，你会以自由直面核心议题。 当心冒进转为控制，保持透明与复盘。 当冥王星位于第11宫，你会在社群与愿景中经历深度转化。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "冥王星在射手座驱动探索与远见的深度转化，你会以自由直面核心议题。 当心冒进转为控制，保持透明与复盘。 当冥王星位于第12宫，你会在潜意识与疗愈中经历深度转化。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "摩羯座": {
      "1": "冥王星在摩羯座驱动纪律与目标的深度转化，你会以结构直面核心议题。 当心保守转为控制，保持透明与复盘。 当冥王星位于第1宫，你会在自我呈现与开端中经历深度转化。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "冥王星在摩羯座驱动纪律与目标的深度转化，你会以结构直面核心议题。 当心保守转为控制，保持透明与复盘。 当冥王星位于第2宫，你会在资源与价值中经历深度转化。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "冥王星在摩羯座驱动纪律与目标的深度转化，你会以结构直面核心议题。 当心保守转为控制，保持透明与复盘。 当冥王星位于第3宫，你会在学习与沟通中经历深度转化。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "冥王星在摩羯座驱动纪律与目标的深度转化，你会以结构直面核心议题。 当心保守转为控制，保持透明与复盘。 当冥王星位于第4宫，你会在家庭与根基中经历深度转化。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "冥王星在摩羯座驱动纪律与目标的深度转化，你会以结构直面核心议题。 当心保守转为控制，保持透明与复盘。 当冥王星位于第5宫，你会在创造与表达中经历深度转化。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "冥王星在摩羯座驱动纪律与目标的深度转化，你会以结构直面核心议题。 当心保守转为控制，保持透明与复盘。 当冥王星位于第6宫，你会在日常与健康中经历深度转化。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "冥王星在摩羯座驱动纪律与目标的深度转化，你会以结构直面核心议题。 当心保守转为控制，保持透明与复盘。 当冥王星位于第7宫，你会在伴侣与合作中经历深度转化。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "冥王星在摩羯座驱动纪律与目标的深度转化，你会以结构直面核心议题。 当心保守转为控制，保持透明与复盘。 当冥王星位于第8宫，你会在共享与转化中经历深度转化。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "冥王星在摩羯座驱动纪律与目标的深度转化，你会以结构直面核心议题。 当心保守转为控制，保持透明与复盘。 当冥王星位于第9宫，你会在远行与信念中经历深度转化。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "冥王星在摩羯座驱动纪律与目标的深度转化，你会以结构直面核心议题。 当心保守转为控制，保持透明与复盘。 当冥王星位于第10宫，你会在事业与公众中经历深度转化。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "冥王星在摩羯座驱动纪律与目标的深度转化，你会以结构直面核心议题。 当心保守转为控制，保持透明与复盘。 当冥王星位于第11宫，你会在社群与愿景中经历深度转化。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "冥王星在摩羯座驱动纪律与目标的深度转化，你会以结构直面核心议题。 当心保守转为控制，保持透明与复盘。 当冥王星位于第12宫，你会在潜意识与疗愈中经历深度转化。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "水瓶座": {
      "1": "冥王星在水瓶座驱动独立与革新的深度转化，你会以理性直面核心议题。 当心疏离转为控制，保持透明与复盘。 当冥王星位于第1宫，你会在自我呈现与开端中经历深度转化。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "冥王星在水瓶座驱动独立与革新的深度转化，你会以理性直面核心议题。 当心疏离转为控制，保持透明与复盘。 当冥王星位于第2宫，你会在资源与价值中经历深度转化。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "冥王星在水瓶座驱动独立与革新的深度转化，你会以理性直面核心议题。 当心疏离转为控制，保持透明与复盘。 当冥王星位于第3宫，你会在学习与沟通中经历深度转化。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "冥王星在水瓶座驱动独立与革新的深度转化，你会以理性直面核心议题。 当心疏离转为控制，保持透明与复盘。 当冥王星位于第4宫，你会在家庭与根基中经历深度转化。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "冥王星在水瓶座驱动独立与革新的深度转化，你会以理性直面核心议题。 当心疏离转为控制，保持透明与复盘。 当冥王星位于第5宫，你会在创造与表达中经历深度转化。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "冥王星在水瓶座驱动独立与革新的深度转化，你会以理性直面核心议题。 当心疏离转为控制，保持透明与复盘。 当冥王星位于第6宫，你会在日常与健康中经历深度转化。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "冥王星在水瓶座驱动独立与革新的深度转化，你会以理性直面核心议题。 当心疏离转为控制，保持透明与复盘。 当冥王星位于第7宫，你会在伴侣与合作中经历深度转化。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "冥王星在水瓶座驱动独立与革新的深度转化，你会以理性直面核心议题。 当心疏离转为控制，保持透明与复盘。 当冥王星位于第8宫，你会在共享与转化中经历深度转化。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "冥王星在水瓶座驱动独立与革新的深度转化，你会以理性直面核心议题。 当心疏离转为控制，保持透明与复盘。 当冥王星位于第9宫，你会在远行与信念中经历深度转化。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "冥王星在水瓶座驱动独立与革新的深度转化，你会以理性直面核心议题。 当心疏离转为控制，保持透明与复盘。 当冥王星位于第10宫，你会在事业与公众中经历深度转化。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "冥王星在水瓶座驱动独立与革新的深度转化，你会以理性直面核心议题。 当心疏离转为控制，保持透明与复盘。 当冥王星位于第11宫，你会在社群与愿景中经历深度转化。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "冥王星在水瓶座驱动独立与革新的深度转化，你会以理性直面核心议题。 当心疏离转为控制，保持透明与复盘。 当冥王星位于第12宫，你会在潜意识与疗愈中经历深度转化。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    },
    "双鱼座": {
      "1": "冥王星在双鱼座驱动共情与想象的深度转化，你会以融合直面核心议题。 当心迷离转为控制，保持透明与复盘。 当冥王星位于第1宫，你会在自我呈现与开端中经历深度转化。 建议：以真实表达与主动尝试开场，设立短期可执行的小目标。",
      "2": "冥王星在双鱼座驱动共情与想象的深度转化，你会以融合直面核心议题。 当心迷离转为控制，保持透明与复盘。 当冥王星位于第2宫，你会在资源与价值中经历深度转化。 建议：建立预算与价值清单，稳步累积可持续的收入与技能。",
      "3": "冥王星在双鱼座驱动共情与想象的深度转化，你会以融合直面核心议题。 当心迷离转为控制，保持透明与复盘。 当冥王星位于第3宫，你会在学习与沟通中经历深度转化。 建议：多输出多交流，使用结构化笔记与复盘提升迁移力。",
      "4": "冥王星在双鱼座驱动共情与想象的深度转化，你会以融合直面核心议题。 当心迷离转为控制，保持透明与复盘。 当冥王星位于第4宫，你会在家庭与根基中经历深度转化。 建议：打理居所与家庭关系，构建稳定作息带来安全感。",
      "5": "冥王星在双鱼座驱动共情与想象的深度转化，你会以融合直面核心议题。 当心迷离转为控制，保持透明与复盘。 当冥王星位于第5宫，你会在创造与表达中经历深度转化。 建议：给兴趣与创作留出舞台，用小作品持续验证。",
      "6": "冥王星在双鱼座驱动共情与想象的深度转化，你会以融合直面核心议题。 当心迷离转为控制，保持透明与复盘。 当冥王星位于第6宫，你会在日常与健康中经历深度转化。 建议：优化流程与习惯，关注身心节律与可持续效率。",
      "7": "冥王星在双鱼座驱动共情与想象的深度转化，你会以融合直面核心议题。 当心迷离转为控制，保持透明与复盘。 当冥王星位于第7宫，你会在伴侣与合作中经历深度转化。 建议：以契约与边界明确合作方式，练习高质量沟通。",
      "8": "冥王星在双鱼座驱动共情与想象的深度转化，你会以融合直面核心议题。 当心迷离转为控制，保持透明与复盘。 当冥王星位于第8宫，你会在共享与转化中经历深度转化。 建议：谨慎处理债务与隐私，进行必要的心理与资源整合。",
      "9": "冥王星在双鱼座驱动共情与想象的深度转化，你会以融合直面核心议题。 当心迷离转为控制，保持透明与复盘。 当冥王星位于第9宫，你会在远行与信念中经历深度转化。 建议：规划学习/旅行蓝图，用证据校准信念与视野。",
      "10": "冥王星在双鱼座驱动共情与想象的深度转化，你会以融合直面核心议题。 当心迷离转为控制，保持透明与复盘。 当冥王星位于第10宫，你会在事业与公众中经历深度转化。 建议：明确职涯定位与责任，建立可见的成果与信誉。",
      "11": "冥王星在双鱼座驱动共情与想象的深度转化，你会以融合直面核心议题。 当心迷离转为控制，保持透明与复盘。 当冥王星位于第11宫，你会在社群与愿景中经历深度转化。 建议：经营人脉与团队，拆分长期愿望为阶段里程碑。",
      "12": "冥王星在双鱼座驱动共情与想象的深度转化，你会以融合直面核心议题。 当心迷离转为控制，保持透明与复盘。 当冥王星位于第12宫，你会在潜意识与疗愈中经历深度转化。 建议：留白与修复同等重要，记录梦境与情绪，温和自我照顾。"
    }
  }
}